[
    {
        "VegetableId": 4,
        "VegetableCode": "001",
        "CatalogId": 14,
        "Name": "Carrot",
        "Description": "A versatile root vegetable commonly orange, but also available in purple, red, yellow, and white varieties. Carrots are known for their sweet flavor and high beta-carotene content, making them a nutritious addition to meals.",
        "ThumbnailImage": "https://www.azamsharp.com/images/carrot.png",
        "SeedDepth": "1/4-1/2\" (6-13 mm)",
        "GerminationSoilTemp": "75 F (24 C)",
        "DaysToGermination": 6,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Spring to summer",
        "PhRange": "5.5-6.5",
        "GrowingSoilTemp": "60-70 F (16-21 C)",
        "SpacingBeds": "2\" (5 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Bean, cabbage, chive, leaf lettuce",
        "BadCompanions": "Celery, dill, parsnip",
        "SowingDescription": "\r",
        "GrowingDescription": "The seeds will start to sprout in couple of weeks. When watering the seeds make sure to avoid getting the leaves wet. The wetting of leaves can result in burning holes into the leaves from the sun.",
        "HarvestDescription": "Harvest the carrots when bit that sticks out of the ground is the diameter of a quarter. Dig them up carefully so as not to damage the root.",
        "Active": null,
        "Season": "Spring,Fall,Summer,Winter",
        "DaysToHarvestSeeds": 90,
        "DaysToHarvestSeedlings": 70,
        "HealthBenefits": "Rich in beta-carotene, carrots promote eye health, boost immunity, and support healthy skin.",
        "Pests": [
            {
                "name": "Carrot Fly",
                "description": "The carrot fly (Psila rosae) is a small, black-bodied insect with an orange head and legs. It is a common pest affecting carrots, parsnips, celery, and other Apiaceae plants. The larvae burrow into the roots of these plants, causing damage that results in stunted growth, discoloration, and increased susceptibility to secondary infections.",
                "symptoms": "Rust-colored tunnels in the roots, yellowing and wilting foliage, and cracking of roots. Severely infested plants may rot and fail to thrive.",
                "treatment": "Use fine mesh netting to cover plants and prevent adult flies from laying eggs. Practice crop rotation to disrupt the lifecycle of the pest. Remove and destroy infested plants immediately to prevent the spread of larvae. Companion planting with strong-smelling plants such as onions or garlic can also deter carrot flies.",
                "photo": "https://www.azamsharp.com/images/carrotfly.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are tiny, soft-bodied insects that can vary in color, including green, yellow, brown, red, or black. They feed on plant sap by piercing leaves and stems with their mouthparts. Aphids are a common pest in gardens and farms, often forming large colonies on new growth.",
                "symptoms": "Infested plants may show curling or yellowing leaves, stunted growth, and sticky honeydew residue on foliage. The honeydew can attract ants and lead to the development of sooty mold on the plant surfaces.",
                "treatment": "Introduce natural predators such as ladybugs and lacewings to control aphid populations. Spray plants with a strong jet of water to dislodge the insects. Apply neem oil or insecticidal soap for organic pest management. Remove and destroy heavily infested parts of the plant to prevent further spread.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
            
        ]
    },
    {
        "VegetableId": 7,
        "VegetableCode": "002",
        "CatalogId": 2,
        "Name": "Hot Pepper",
        "Description": "A vibrant and fiery vegetable that adds spice to any dish. Hot peppers are prized for their heat levels, ranging from mild to extreme, and are rich in vitamin C and capsaicin.",
        "ThumbnailImage": "https://www.azamsharp.com/images/pepper.png",
        "SeedDepth": "1/4 \" (6 mm)",
        "GerminationSoilTemp": "80-85 F (27-29 C)",
        "DaysToGermination": 7,
        "SowIndoors": "8 weeks before frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "5.5 - 7.0",
        "GrowingSoilTemp": "70 - 85 F (21-29 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, onion, parsnip, pea",
        "BadCompanions": "Fennel, kohlrabi",
        "SowingDescription": "When planting peppers make sure that the all the dangers of the frost has passed. If there are implications of frost then you can start indoors. \r",
        "GrowingDescription": "Make sure that the soil is evenly moist. Pepper plants require at least 1.5 inch of water a week. You can conserve the moisture by putting mulch on the top of the soil. ",
        "HarvestDescription": "When the pepper has grown to a large size then it is time to harvest. The more you harvest the more peppers will be produced by the plants. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 85,
        "DaysToHarvestSeedlings": 64,
        "HealthBenefits": "Hot peppers contain capsaicin, which may reduce pain, improve digestion, and boost metabolism.",
        "Pests": [
            {
                "name": "Pepper Weevil",
                "description": "The pepper weevil (Anthonomus eugenii) is a small, dark-colored beetle with an oval body and a prominent snout. It is a significant pest of peppers and other Solanaceae plants, causing damage to flowers and fruits. The adult beetles feed on plant tissues, while the larvae develop inside the fruit, leading to significant crop losses.",
                "symptoms": "Premature dropping of flower buds and fruits, yellowing of stems and calyx, and feeding scars or punctures on fruits. Infested fruits may contain larvae and show internal browning or rot.",
                "treatment": "Effective management includes regular monitoring and removal of infested fruits and plants. Use pheromone traps to monitor and reduce adult populations. Practice crop rotation to minimize overwintering weevils. Apply insecticides labeled for pepper weevil control when necessary, and consider biological control agents like the parasitoid wasp Catolaccus hunteri.",
                "photo": "https://www.azamsharp.com/images/pepper_weevil.png"
            }
            ,
            {
                "name": "Thrips",
                "description": "Thrips are tiny, slender insects that feed on plants by puncturing their surfaces and sucking out the contents of cells. They are known to attack a wide variety of plants, including vegetables, fruits, and ornamental plants. Thrips can also transmit plant viruses, making them particularly damaging pests.",
                "symptoms": "Infested plants may show silvery or stippled discoloration on leaves, distorted growth, and black fecal spots on the foliage. Flowers may appear deformed, and fruits can develop scars or become misshapen.",
                "treatment": "Introduce natural predators such as lacewings and minute pirate bugs to control thrip populations. Use insecticidal soaps or neem oil for organic pest management. Sticky traps can help monitor and reduce adult populations. Remove and destroy heavily infested plants to prevent the spread of thrips and associated plant viruses.",
                "photo": "https://www.azamsharp.com/images/thrips.png"
            }
            
        ]
    },
    {
        "VegetableId": 8,
        "VegetableCode": "003",
        "CatalogId": 2,
        "Name": "Green Beans",
        "Description": "A garden favorite and second only to tomatoes in popularity. Green beans are crisp, tender, and packed with fiber and essential vitamins, perfect for stir-fries or as a side dish.",
        "ThumbnailImage": "https://www.azamsharp.com/images/greenbeans.png",
        "SeedDepth": "1\" (2.5 cm)",
        "GerminationSoilTemp": "40-75 F (4-24 C)",
        "DaysToGermination": 14,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Late summer",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "1\" (2.5 cm)",
        "Watering": "Moderate then low",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, celery, chicory, corn, cucumber, eggplant, parsley, early potato, radish, spinach, turnip",
        "BadCompanions": "Onion, late potato",
        "SowingDescription": "First make sure there is no danger of frost. Frost can easily kill green beans. Bury 4-6 seeds 2 inches deep from each other in rows. Cover each seed with soil and then water them. When you plant green beans, you want to water them right away.",
        "GrowingDescription": "Make sure the area is clean and there are no weeds growing. Weeds can steal all nutrients from the green beans and this can result in killing of the green beans plant. Water your green beans every day. You can also include a layer of mulch to help control the weeds and make sure that the ground is moist. \r",
        "HarvestDescription": "You can start harvesting green beans when they are long and firm. The more green beans you will pick the more it will produce. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 50,
        "DaysToHarvestSeedlings": 35,
        "HealthBenefits": "Packed with fiber and vitamins, green beans support digestion and overall immune health.",
        "Pests": [
            {
                "name": "Bean Beetle",
                "description": "The bean beetle, also known as the cowpea weevil (Callosobruchus maculatus), is a small, oval-shaped beetle that primarily affects legumes such as beans, lentils, and cowpeas. Adult beetles lay their eggs on beans, and the larvae burrow into the seeds, causing significant damage.",
                "symptoms": "Hollowed-out or damaged beans with small exit holes. Infested seeds may have larvae feeding inside, which reduces germination and seed quality. Adult beetles are often seen near stored legumes.",
                "treatment": "To manage bean beetle infestations, store beans in airtight containers or the freezer to kill eggs and larvae. Inspect and clean storage areas regularly to eliminate potential infestations. For larger-scale infestations, consider using biological control agents like parasitic wasps or applying food-safe insecticides.",
                "photo": "https://www.azamsharp.com/images/bean_beetle.png"
            }
            ,
            {
                "name": "Spider Mites",
                "description": "Spider mites are tiny arachnids, often less than 1 mm in size, that feed on the sap of plants. They thrive in hot and dry conditions, causing significant damage to a wide variety of plants, including vegetables, fruits, and ornamentals. Spider mites are known for creating fine webbing on plant surfaces.",
                "symptoms": "Infested plants may exhibit stippled or yellowing leaves, with a bronze or dusty appearance. Severe infestations result in leaf drop and fine webbing on the undersides of leaves or between plant stems. Plants may appear weak or stunted.",
                "treatment": "To manage spider mite infestations, spray plants with a strong jet of water to dislodge the mites. Introduce natural predators such as ladybugs or predatory mites. Use horticultural oils, insecticidal soaps, or neem oil to control populations. Keep the plants well-watered and humid to reduce the likelihood of infestation.",
                "photo": "https://www.azamsharp.com/images/spider_mites.png"
            }
            
        ]
    },
    {
        "VegetableId": 9,
        "VegetableCode": "004",
        "CatalogId": 2,
        "Name": "Onion",
        "Description": "A kitchen staple with a sharp and savory flavor. Onions are versatile and essential in countless recipes, from soups and stews to salads and sautés.",
        "ThumbnailImage": "https://www.azamsharp.com/images/onions.png",
        "SeedDepth": "1/4\"-1/2\" (.65 - 1.3 cm)",
        "GerminationSoilTemp": "65-85F (18-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "2 months before frost",
        "SowOutdoors": "Spring",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "55-75 F (13-24 C)",
        "SpacingBeds": "3-4\" (7.5 - 10 cm)",
        "Watering": "Medium and even",
        "Light": "Full sun",
        "GoodCompanions": "Beet, cabbage family, carrot, spinach",
        "BadCompanions": "Asparagus, bean, pea",
        "SowingDescription": "Onions should be planted in full sun. Make sure to loosen the soil and remove all the rocks. Work hard to make the soil firm. Making the soil firm and loose will allow the onions to grow much better.",
        "GrowingDescription": "When choosing onions set make sure the onions are firm and plump. Dig a small hole only enough so that the tip of the onion is exposed outside. ",
        "HarvestDescription": "Harvest the onions in late Spring.",
        "Active": null,
        "Season": "Spring,Fall,Summer,Winter",
        "DaysToHarvestSeeds": 139,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Onions are rich in antioxidants and compounds that fight inflammation and boost heart health.",
        "Pests": [
            {
                "name": "Onion Fly",
                "description": "The onion fly (Delia antiqua) is a small, grayish fly resembling a housefly. It is a significant pest for onions, garlic, leeks, and other alliums. The larvae, also known as maggots, feed on the bulbs and roots of these plants, causing extensive damage and reducing crop yields.",
                "symptoms": "Infested plants may show yellowing and wilting of leaves, stunted growth, and rotting bulbs. The presence of maggots in the bulb or roots is a clear sign of infestation.",
                "treatment": "Prevent onion fly infestations by using crop rotation and avoiding planting alliums in the same location consecutively. Cover crops with fine mesh netting to prevent egg-laying. Remove and destroy infested plants immediately. Beneficial nematodes can be applied to the soil to target larvae. Chemical insecticides may be used as a last resort following label instructions.",
                "photo": "https://www.azamsharp.com/images/onion_fly.png"
            }
            ,
            {
                "name": "Thrips",
                "description": "Thrips are tiny, slender insects that feed on plant cells by puncturing leaves, flowers, and fruits and sucking out the contents. They are common pests that affect a wide range of crops, including vegetables, fruits, and ornamental plants. Thrips are also known to spread plant viruses, making them a serious agricultural concern.",
                "symptoms": "Affected plants may exhibit silvery or stippled discoloration on leaves, distorted or deformed growth, and dark fecal spots on foliage. In severe infestations, flowers and fruits may appear scarred or damaged, and plant vigor may decline.",
                "treatment": "Control thrips by introducing natural predators like lacewings and minute pirate bugs. Use sticky traps to monitor and reduce adult populations. Apply insecticidal soaps or neem oil for organic pest control. Prune and destroy heavily infested parts of the plant. Maintain proper plant hygiene and avoid excessive nitrogen fertilization, which can attract thrips.",
                "photo": "https://www.azamsharp.com/images/thrips.png"
            }
            
        ]
    },
    {
        "VegetableId": 10,
        "VegetableCode": "005",
        "CatalogId": 2,
        "Name": "Tomato",
        "Description": "A juicy and flavorful fruit often mistaken for a vegetable, tomatoes come in many varieties and colors. They're rich in lycopene, an antioxidant, and add vibrant taste to salads, sauces, and more.",
        "ThumbnailImage": "https://www.azamsharp.com/images/tomato.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "80 F (27 C)",
        "DaysToGermination": 7,
        "SowIndoors": "7 weeks before frost",
        "SowOutdoors": "danger of frost is past",
        "PhRange": "5.8-7.0",
        "GrowingSoilTemp": "70F (21 C)",
        "SpacingBeds": "15\" (37.5 cm)",
        "Watering": "Moderate to high during growth, low during harvest",
        "Light": "Full sun",
        "GoodCompanions": "Basil, bush bean, cucumber",
        "BadCompanions": "Pole bean, dill, fennel, potato",
        "SowingDescription": "Cut the tomato in half and take out the seeds. Place the seeds in the container and put twice as much water as you have seeds. Rinse the seeds and make sure all pulp is removed. Once it removed the seeds are ready for planting.\r",
        "GrowingDescription": "Place the pots in a warm, sunny place. When the plants have ground several inches tall and have at least 3 leaves on each plant, they are ready for transplanting. Dig a small hole in the ground and put the plant in that hole. Make sure only 1/4 plant is sticking out of the ground. Immediately pour water in the hole. \r",
        "HarvestDescription": "When the fruit turns red (or whatever color you planted), pick and enjoy the fruits of your labor. When you do, you will know that it was all worth it.",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 80,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Rich in lycopene, tomatoes promote heart health, reduce inflammation, and support skin health.",
        "Pests": [
            {
                "name": "Tomato Hornworm",
                "description": "The tomato hornworm (Manduca quinquemaculata) is a large, green caterpillar with white V-shaped markings and a prominent horn-like projection on its rear. It is a destructive pest that feeds on the leaves, stems, and fruits of plants in the nightshade family, including tomatoes, peppers, and eggplants.",
                "symptoms": "Infested plants may have defoliated stems, chewed or missing leaves, and visible caterpillars. Dark green or black droppings (frass) on the foliage are a common sign of tomato hornworm activity.",
                "treatment": "Handpick hornworms from plants and drop them into soapy water for small-scale infestations. Introduce natural predators like parasitic wasps or birds to control populations. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic management. Maintain a clean garden by removing weeds and debris that may harbor hornworms.",
                "photo": "https://www.azamsharp.com/images/tomato_hornworm.png"
            }
            ,
            {
                "name": "Whitefly",
                "description": "Whiteflies are small, winged insects that resemble tiny white moths. They are sap-sucking pests that attack a wide variety of plants, including vegetables, fruits, and ornamentals. Whiteflies congregate on the undersides of leaves and are known to transmit plant diseases, further harming crops.",
                "symptoms": "Infested plants may exhibit yellowing, wilting, or stunted growth. The undersides of leaves may have clusters of tiny white insects. A sticky substance called honeydew is often present, which can lead to sooty mold development.",
                "treatment": "Introduce natural predators such as ladybugs and lacewings to control whitefly populations. Use yellow sticky traps to monitor and reduce their numbers. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves and maintain proper plant hygiene to prevent infestations.",
                "photo": "https://www.azamsharp.com/images/whitefly.png"
            }
            
        ]
    },
    {
        "VegetableId": 11,
        "VegetableCode": "006",
        "CatalogId": 2,
        "Name": "Radish",
        "Description": "Radishes (Raphanus sativus) are crisp root vegetables known for their peppery flavor and vibrant colors, ranging from red and pink to white and purple. Commonly used in salads, slaws, and as garnishes, radishes add a refreshing crunch to dishes. They are low in calories and high in vitamin C, supporting immunity and promoting healthy digestion. Radishes grow quickly and thrive in cool weather, making them a popular choice for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/radish.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "45 - 90 F (7-32 C)",
        "DaysToGermination": 10,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Early spring and fall",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65F (16-18 C)",
        "SpacingBeds": "1\" (2.5 cm)",
        "Watering": "Even and moderate",
        "Light": "Full sun",
        "GoodCompanions": "Bean, beet, carrot",
        "BadCompanions": "Fennel",
        "SowingDescription": "There are many different kind of radishes which can be planted. The easiest to grow radish is called Cherry Belle, they mature in just 22 days. Radishes should be planted to full sun or partial shade with well drained soil. Add compost to the soil to speed up the process. \r",
        "GrowingDescription": "Water the radishes daily as they are growing. The quick growth of radishes depends on evenly watering. ",
        "HarvestDescription": "Radishes are ready to harvest when their roots are about 1 inch (2.5 cm) in diameter. To harvest simply pull out the plant from the ground. \r",
        "Active": null,
        "Season": "Spring,Summer",
        "DaysToHarvestSeeds": 25,
        "DaysToHarvestSeedlings": 14,
        "HealthBenefits": "Radishes are low in calories and high in fiber, promoting digestion and hydration.",
        "Pests": [
            {
                "name": "Root Maggots",
                "description": "Root maggots are the larvae of various fly species, including cabbage flies and onion flies. These tiny, cream-colored maggots feed on the roots of plants, particularly cruciferous vegetables like cabbage, radishes, and turnips. Their feeding weakens the plant, making it susceptible to diseases and reducing crop yields.",
                "symptoms": "Plants infested with root maggots may show signs of wilting, yellowing leaves, stunted growth, and poor vigor. When roots are inspected, they often have small holes, tunnels, and evidence of larval feeding. Infested roots may rot over time.",
                "treatment": "Prevent root maggot infestations by using row covers to exclude adult flies from laying eggs near plants. Practice crop rotation to disrupt the life cycle of maggots. Apply beneficial nematodes to the soil to target larvae. Remove and destroy heavily infested plants and sanitize garden tools to prevent spread. Diatomaceous earth can also be sprinkled around plant bases to deter egg-laying.",
                "photo": "https://www.azamsharp.com/images/root_maggots.png"
            }
            ,
            {
                "name": "Cabbage Maggots",
                "description": "Cabbage maggots are the larvae of the cabbage fly (Delia radicum), which primarily affect cruciferous vegetables such as cabbage, broccoli, cauliflower, and radishes. The small white maggots burrow into the roots, causing significant damage to the plant's root system and leading to reduced growth and yield.",
                "symptoms": "Infested plants may wilt, yellow, and show stunted growth. Upon inspecting the roots, you may find small holes, tunnels, and rotting caused by maggot feeding. Severely damaged plants may die.",
                "treatment": "Prevent cabbage maggot infestations by using floating row covers to exclude flies from laying eggs. Practice crop rotation to avoid repeated infestations in the same area. Apply beneficial nematodes to the soil to target larvae. Mound soil around the plant base to deter egg-laying. Remove and destroy infested plants to reduce the spread.",
                "photo": "https://www.azamsharp.com/images/cabbage_maggots.png"
            }
            
        ]
    },
    {
        "VegetableId": 13,
        "VegetableCode": "007",
        "CatalogId": 13,
        "Name": "Arugula",
        "Description": "Arugula (Eruca vesicaria), also known as rocket, is a leafy green vegetable with a distinctive peppery flavor. Often used in salads, sandwiches, and as a topping for pizzas, arugula adds a zesty, refreshing bite to dishes. It is rich in vitamins A, C, and K, as well as antioxidants, supporting bone health, immunity, and overall well-being. Arugula thrives in cool climates and is a fast-growing crop, making it a favorite among home gardeners.",
        "ThumbnailImage": "https://www.azamsharp.com/images/arugula.png",
        "SeedDepth": "1/4\" (6 mm)",
        "GerminationSoilTemp": "40-55F (4-13 C)",
        "DaysToGermination": 6,
        "SowIndoors": "Late fall, early spring",
        "SowOutdoors": "On worked soil",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "50-65F (10-18 C)",
        "SpacingBeds": "1\" (2.5 cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, beet, carrot, celery, cucumber",
        "BadCompanions": "Green beans, strawberry",
        "SowingDescription": "Prepare the soil by pouring the compost into the top 3 inches (8 cm) of soil. Seeds can be planted in spring as soon as the soil can be worked. You can plant additional seeds every 3 weeks as long as the cool weather lasts. ",
        "GrowingDescription": "Please read the section on sowing. ",
        "HarvestDescription": "Harvest the leaves when they are 2 to 3 inches long. This will be achieved in 2 or 3 weeks after the plants germinate. Make sure to cut individual leaves or the the whole plant. You can also use the flowers in your salad. ",
        "Active": null,
        "Season": "Spring,Fall",
        "DaysToHarvestSeeds": 45,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Rich in antioxidants and vitamins, arugula supports bone health and boosts immunity.",
        "Pests": [
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping beetles that target a wide variety of plants, including vegetables like cabbage, eggplants, and tomatoes. They are named for their ability to jump like fleas when disturbed. These pests are known for chewing small holes in leaves, giving them a 'shot-hole' appearance.",
                "symptoms": "Plants infested with flea beetles exhibit small, round holes in leaves, often resembling shotgun damage. Seedlings and young plants are especially vulnerable and may wilt, become stunted, or even die under severe infestations.",
                "treatment": "Use floating row covers to protect young plants from flea beetles. Apply diatomaceous earth or neem oil to deter them. Plant trap crops like radishes to lure beetles away from main crops. Introducing natural predators, such as nematodes, and practicing crop rotation can help manage populations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            }
            ,
            {
                "name": "Cabbage Worms",
                "description": "Cabbage worms are the larvae of the small white butterfly (Pieris rapae), which are common pests of cruciferous vegetables like cabbage, broccoli, and kale. These green caterpillars have a velvety texture and are voracious feeders that can cause significant damage to plants.",
                "symptoms": "Infested plants exhibit holes in leaves, chewed edges, and frass (caterpillar droppings) on the foliage. Heavy infestations can lead to defoliation, reduced growth, and poor-quality crops.",
                "treatment": "Handpick cabbage worms from plants and dispose of them to control small infestations. Use floating row covers to prevent butterflies from laying eggs. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic control. Encourage natural predators such as birds or parasitic wasps in the garden.",
                "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
            }
            
        ]
    },
    {
        "VegetableId": 14,
        "VegetableCode": "008",
        "CatalogId": 7,
        "Name": "Corn",
        "Description": "Corn (Zea mays), also known as maize, is a versatile and widely cultivated cereal crop known for its sweet, tender kernels. It can be enjoyed fresh, grilled, boiled, or added to soups, salads, and casseroles. Rich in fiber, vitamins B and C, and antioxidants like lutein, corn supports healthy digestion, boosts immunity, and promotes eye health. Thriving in warm, sunny climates, corn is a staple in diets worldwide and a favorite crop among gardeners for its high yield and adaptability.",
        "ThumbnailImage": "https://www.azamsharp.com/images/corn.png",
        "SeedDepth": "1\" (2.5 cm)",
        "GerminationSoilTemp": "80F (27 C)",
        "DaysToGermination": 4,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "1 week after last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "65-75 F (18-24 C)",
        "SpacingBeds": "8\" (20 cm)",
        "Watering": "Moderate to heavy",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, beet, cabbage, cucumber, pea, squash",
        "BadCompanions": "Tomato",
        "SowingDescription": "Remove the mulch to allow the soil to begin heating and add some finished compost to the soil. To further heat the soil you can cover the soil with a black plastic. Seeds should be sowed 1 inch deep and 8 inches apart. \r",
        "GrowingDescription": "Space the seeds and rows correctly. Row spacing should be 36\", and seed spacing per row should be 36\" also. The spacing is critical because corn needs other plants to pollinate in order to produce ears of corn. Corn needs at least 4 to 6 rows for good pollination; 8 to 12 rows is better, even in a home garden, if possible.\r",
        "HarvestDescription": "Touch the kernels on the ears after 3 weeks. They should be filled with milky liquid. Push the kernel and the liquid will burst out. This is sign that the corn is ready for harvesting.",
        "Active": null,
        "Season": "Summer,Spring",
        "DaysToHarvestSeeds": 89,
        "DaysToHarvestSeedlings": 70,
        "HealthBenefits": "Corn provides energy, is rich in antioxidants, and supports healthy vision with its lutein content.",
        "Pests": [
            {
                "name": "Corn Earworm",
                "description": "The corn earworm (Helicoverpa zea) is a moth larva that is a common pest of corn and other crops, including tomatoes, peppers, and beans. The caterpillars vary in color from green to brown and can grow up to 2 inches long. They are known for burrowing into corn ears and feeding on kernels.",
                "symptoms": "Infested corn ears may have chewed kernels, silk damage, and the presence of frass (caterpillar droppings). Caterpillars can also cause damage to the tips of ears, leading to poor-quality harvests.",
                "treatment": "Plant resistant corn varieties and apply Bacillus thuringiensis (Bt) to control larvae. Use insecticidal sprays targeted at early stages of larval development. Encourage natural predators such as birds and parasitic wasps. Ensure proper crop rotation to disrupt the pest's lifecycle.",
                "photo": "https://www.azamsharp.com/images/corn_earworm.png"
            }
            ,
            {
                "name": "Armyworms",
                "description": "Armyworms are the larvae of moths belonging to the genus Spodoptera. They are named for their behavior of moving in large groups across fields, consuming crops in their path. These pests attack a wide variety of crops, including grains, corn, vegetables, and grasses. The caterpillars are greenish to brown with stripes and can grow up to 2 inches long.",
                "symptoms": "Infested plants show signs of chewed leaves, skeletonized foliage, and damaged stems. Large infestations can lead to defoliation and significant crop losses. Armyworms often create patches of destroyed vegetation as they move through fields.",
                "treatment": "Monitor fields regularly and handpick armyworms where possible. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic control. Use pheromone traps to monitor moth activity and disrupt their breeding. Encourage natural predators such as birds, parasitic wasps, and ground beetles to reduce populations.",
                "photo": "https://www.azamsharp.com/images/armyworms.png"
            }
            
        ]
    },
    {
        "VegetableId": 15,
        "VegetableCode": "009",
        "CatalogId": 13,
        "Name": "Beet",
        "Description": "Beets (Beta vulgaris) are nutrient-rich root vegetables prized for their sweet, earthy flavor and vibrant red or golden color. They can be enjoyed roasted, boiled, pickled, or raw in salads and juices. Beets are a rich source of dietary fiber, folate, and nitrates, which support heart health, improve blood flow, and boost stamina. The leafy greens are also edible and packed with vitamins A and K. Beets thrive in cool climates and are a versatile crop for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/beet.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "75-85 F (24-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "5 weeks before frost",
        "SowOutdoors": "4 weeks before frost",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "65-75 F (18-24 C)",
        "SpacingBeds": "2\" (5 cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, corn, leek, lettuce",
        "BadCompanions": "Green beans, mustard",
        "SowingDescription": "Beets are a cool weather vegetable hence they should be planted when the weather is cool. When growing beets, make sure you plant the seeds one to two inches apart in the row. You can cover the seeds lightly with loose soil, and then sprinkle it with water. You should see the plants start growing in seven to 14 days. If you want a continuous supply, plant your beets in several plantings, about three weeks apart from each other.\r",
        "GrowingDescription": "Include beets along with onions, lettuce, cabbage, broccoli and bush beans in your garden. These are all cool weather vegetables. Water the seedlings well. Keep the beets watered as they grow. Keep all grass cleaned out of the beet patch with a garden hoe.\r",
        "HarvestDescription": "Harvest the beets when they are 1 to 3 inches (1.5 to 4.5 cm) in diameter. Pull the beets gently from the soil. If you prefer to eat the beet tops, you will want to harvest the greens when the beets are much younger, so the greens will be tender.\r",
        "Active": null,
        "Season": "Spring,Summer",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 40,
        "HealthBenefits": "Beets are high in nitrates, which can improve blood flow and lower blood pressure.",
        "Pests": [
            {
                "name": "Leaf Miners",
                "description": "Leaf miners are the larvae of various insect species, including flies, beetles, and moths, that feed on the tissue between the upper and lower surfaces of leaves. They create distinctive, winding tunnels or blotches as they move through the leaf. Leaf miners are common pests of vegetables, ornamental plants, and fruit trees.",
                "symptoms": "Infested leaves exhibit winding, white or translucent trails (mines) that often turn brown over time. Leaves may become discolored, distorted, or drop prematurely, reducing the plant's vigor and photosynthetic ability.",
                "treatment": "Prune and destroy infested leaves to prevent the larvae from maturing. Apply neem oil or insecticidal soap to deter adult leaf miners from laying eggs. Introduce natural predators, such as parasitic wasps, to control populations. Use floating row covers to protect crops from adult insects.",
                "photo": "https://www.azamsharp.com/images/leaf_miners.png"
            }
            ,
            {
                "name": "Beet Armyworms",
                "description": "Beet armyworms (Spodoptera exigua) are the larvae of moths that attack a wide range of crops, including beets, tomatoes, peppers, and lettuce. These caterpillars are light green to black with pale stripes running along their bodies. Beet armyworms are highly destructive, feeding on leaves, stems, and fruits of plants.",
                "symptoms": "Infested plants exhibit skeletonized leaves, chewed foliage, and damage to stems or fruit. Severe infestations can result in defoliation and reduced crop yields. Egg clusters covered in a cottony material are often found on the undersides of leaves.",
                "treatment": "Monitor plants regularly and remove egg clusters and larvae by hand. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic control. Use pheromone traps to monitor and reduce adult moth populations. Encourage natural predators, such as parasitic wasps and birds, to help control infestations.",
                "photo": "https://www.azamsharp.com/images/beet_armyworms.png"
            }
            
        ]
    },
    {
        "VegetableId": 16,
        "VegetableCode": "010",
        "CatalogId": 2,
        "Name": "Cucumber",
        "Description": "Cucumbers (Cucumis sativus) are refreshing, crisp vegetables with a mild flavor, widely enjoyed raw in salads, sandwiches, and as a hydrating snack. Known for their high water content, cucumbers help promote hydration and support healthy skin. They are also a good source of vitamins K and C, as well as antioxidants, aiding digestion and reducing inflammation. Thriving in warm climates and well-drained soil, cucumbers are a popular and easy-to-grow choice for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/cucumber.png",
        "SeedDepth": "1/2-1\" (13-25 mm)",
        "GerminationSoilTemp": "80-95 F (27-35 C)",
        "DaysToGermination": 4,
        "SowIndoors": "3 weeks before frost",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "70-80 F (21-27 C)",
        "SpacingBeds": "36 \" (90 cm)",
        "Watering": "Start moderate end heavy",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, broccoli, cabbage family, eggplant",
        "BadCompanions": "Potato",
        "SowingDescription": "You can start planting cucumbers indoors. Cucumber plants are not fond of being transplanted. Take extreme caution and care when putting them into the outside soil. When cucumber planted in rows then seeds should be 2\" to 3\" apart. \r",
        "GrowingDescription": "Cucumber plants require well drained soil. Provide plenty of  high nitrogen fertilizer. Also make sure to provide lots of water, for fast growth.\r",
        "HarvestDescription": "Harvest cucumbers for fresh eating when they are between 7-9 inches long and have bright dark green color. Larger sizes of cucumbers have bitter taste. \r",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 45,
        "DaysToHarvestSeedlings": 30,
        "HealthBenefits": "Cucumbers are hydrating and rich in antioxidants, promoting healthy skin and digestion.",
        "Pests": [
            {
                "name": "Cucumber Beetles",
                "description": "Cucumber beetles are small, colorful beetles with either yellow and black stripes or spots, depending on the species. They are a significant pest for cucurbit plants like cucumbers, squash, melons, and pumpkins. In addition to feeding on plant foliage, flowers, and fruit, they can spread bacterial wilt and other plant diseases.",
                "symptoms": "Plants infested with cucumber beetles may show chewed leaves and flowers, scarring on fruit, and stunted growth. Signs of bacterial wilt, such as leaf wilting and eventual plant death, can also indicate cucumber beetle activity.",
                "treatment": "Use floating row covers to protect young plants from beetles. Apply neem oil or insecticidal soap to deter feeding. Introduce beneficial insects such as tachinid flies and soldier beetles to help control populations. Practice crop rotation and remove plant debris at the end of the growing season to reduce overwintering sites.",
                "photo": "https://www.azamsharp.com/images/cucumber_beetles.png"
            }
            ,
            {
                "name": "Squash Bugs",
                "description": "Squash bugs (Anasa tristis) are common pests that attack plants in the cucurbit family, including squash, pumpkins, and zucchini. They are shield-shaped, brownish-gray insects that feed on plant sap, causing significant damage to crops. Squash bugs are particularly harmful during the early growth stages of plants.",
                "symptoms": "Infested plants may show yellowing and wilting leaves, with browning or black spots at feeding sites. Severely affected plants may have dried, crispy leaves and stunted growth. Eggs can often be found in clusters on the undersides of leaves.",
                "treatment": "Handpick squash bugs and destroy them to reduce their population. Remove egg clusters from leaves and dispose of them. Use floating row covers to protect young plants. Apply neem oil or insecticidal soaps to manage infestations. Keep the garden clean by removing plant debris, which can harbor overwintering squash bugs.",
                "photo": "https://www.azamsharp.com/images/squash_bugs.png"
            }
            
        ]
    },
    {
        "VegetableId": 17,
        "VegetableCode": "011",
        "CatalogId": 2,
        "Name": "Eggplant",
        "Description": "Eggplants (Solanum melongena), also known as aubergines, are glossy, deep purple vegetables with a spongy texture and mild flavor. They are incredibly versatile in cooking, often used in dishes such as ratatouille, curries, and casseroles, or grilled and roasted. Eggplants are rich in fiber, antioxidants like nasunin, and vitamins B and K, supporting heart health, brain function, and digestion. Thriving in warm climates with full sunlight, eggplants are a staple in both home gardens and global cuisines.",
        "ThumbnailImage": "https://www.azamsharp.com/images/eggplant.png",
        "SeedDepth": "1/4 \" (6 mm)",
        "GerminationSoilTemp": "85 F (29 C)",
        "DaysToGermination": 7,
        "SowIndoors": "5 weeks before frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "5.5 - 7.0",
        "GrowingSoilTemp": "80-90 F (27-32 C)",
        "SpacingBeds": "18\" (45 cm)",
        "Watering": "Heavy",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, pea, pepper, potato",
        "BadCompanions": "Fennel",
        "SowingDescription": "Sow eggplant seeds in small pots 1/4 inch deep. Water the seeds well and make sure they remain moist. You can also cover the pots with plastic. This will allow you to monitor the moisture in the seeds. If you do not see moisture on the plastic then it is time to add more water. \r",
        "GrowingDescription": "After putting the plants in the garden use a row cover along side with mulch to provide steady heat and protection against the insects. Eggplant is one of the favorite plant for most of the insects. Make sure you protect it against the insects. This can be accomplished by growing the eggplant beneath the row covers. ",
        "HarvestDescription": "Harvest eggplants anytime they have reached half their mature size. This will provide tender and delicious eggplants. When cutting the eggplants leave some stem attached to the plant. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 80,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Eggplants contain antioxidants like nasunin, which protect brain function and reduce inflammation.",
        "Pests": [
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that attack a wide range of plants, including vegetables like tomatoes, potatoes, eggplants, and leafy greens. These beetles are named for their ability to jump like fleas when disturbed. Their feeding behavior creates small holes in leaves, giving them a 'shot-hole' appearance.",
                "symptoms": "Plants infested with flea beetles exhibit small, round holes in leaves, often resembling shotgun damage. Young seedlings are particularly vulnerable, and heavy infestations can lead to stunted growth, reduced vigor, and even plant death.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth around plants to deter them. Neem oil and insecticidal soaps are effective organic treatments. Plant trap crops like radishes to lure beetles away from main crops, and practice crop rotation to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            }
            ,
            {
                "name": "Spider Mites",
                "description": "Spider mites are tiny arachnids that feed on plant sap, often found on the undersides of leaves. They are particularly problematic in hot, dry conditions and can infest a wide range of plants, including vegetables, fruits, and ornamental plants. Spider mites are known for their ability to produce fine webbing on plants.",
                "symptoms": "Infested plants may exhibit stippled or yellowing leaves with a bronze or dusty appearance. In severe infestations, leaves may drop prematurely, and fine webbing can be found on the undersides of leaves or between plant stems.",
                "treatment": "Spray plants with a strong jet of water to dislodge spider mites. Introduce natural predators like ladybugs or predatory mites. Use horticultural oils, neem oil, or insecticidal soaps to control populations. Maintain adequate humidity levels and ensure proper watering to reduce infestations.",
                "photo": "https://www.azamsharp.com/images/spider_mites.png"
            }
            
        ]
    },
    {
        "VegetableId": 18,
        "VegetableCode": "012",
        "CatalogId": 12,
        "Name": "Celery",
        "Description": "Celery (Apium graveolens) is a crisp, fibrous vegetable known for its mild, refreshing flavor and versatility in cooking. Often enjoyed raw as a snack, added to salads, or used as a base in soups and stews, celery adds both flavor and texture to dishes. It is low in calories and high in antioxidants, vitamins K and C, and dietary fiber, supporting digestion, reducing inflammation, and promoting heart health. Celery thrives in cool, moist conditions, making it a rewarding crop for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/celery.png",
        "SeedDepth": "Just cover",
        "GerminationSoilTemp": "70 F (21 C)",
        "DaysToGermination": 7,
        "SowIndoors": "10 weeks before frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-70 F (16-21 C)",
        "SpacingBeds": "8\" (20 cm)",
        "Watering": "Heavy and even",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "Carrot, parsley, parsnip",
        "SowingDescription": "Prepare the soil by adding manure or compost. To give head start to celery soak the seeds in water for 2 days. Make sure that the outside temperature is at least 55 F. Plant the seeds and cover it with the soil. ",
        "GrowingDescription": "During germination period make sure that the soil is moist. Water lightly on the seeds as you do not want the seeds to wash away.  Use mulch around the plant to keep the moisture inside the soil. Mulch will also make sure that there are no weeds growing near the celery plant.",
        "HarvestDescription": "In about 5 months you will be ready to harvest the plant. You can harvest the complete plant right at the bottom. ",
        "Active": null,
        "Season": "Summer,Spring,Fall,Winter",
        "DaysToHarvestSeeds": 80,
        "DaysToHarvestSeedlings": 56,
        "HealthBenefits": "Celery is low in calories and high in antioxidants, supporting heart health and reducing inflammation.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that come in a variety of colors, including green, yellow, brown, red, and black. They feed on plant sap by piercing stems, leaves, and buds with their mouthparts. Aphids reproduce rapidly and are common pests on vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curling or yellowing leaves, stunted growth, and sticky honeydew on leaves and stems. This honeydew can lead to the development of sooty mold, which further hampers photosynthesis. Large colonies of aphids are often visible on new growth or the undersides of leaves.",
                "treatment": "Introduce natural predators such as ladybugs, lacewings, or parasitic wasps to control aphid populations. Spray plants with a strong jet of water to dislodge aphids. Apply neem oil or insecticidal soap as an organic treatment. Regularly inspect plants for early signs of infestation and remove heavily infested leaves or stems.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
            ,
            {
                "name": "Carrot Weevils",
                "description": "Carrot weevils (Listronotus oregonensis) are small, dark brown beetles that target carrots and other related plants, such as celery and parsley. The adults feed on foliage, while the larvae burrow into the roots, causing significant damage and reducing crop quality.",
                "symptoms": "Infested carrots may show small holes or tunnels in the roots, which can lead to discoloration, secondary infections, and rotting. Plants may appear stunted or wilted, especially in severe infestations.",
                "treatment": "Use floating row covers to prevent adult weevils from laying eggs near the plants. Remove plant debris and weeds in and around the garden to eliminate overwintering sites. Practice crop rotation to break the pest's life cycle. Beneficial nematodes can be applied to the soil to target larvae, and insecticides can be used if necessary.",
                "photo": "https://www.azamsharp.com/images/carrot_weevils.png"
            }
            
        ]
    },
    {
        "VegetableId": 19,
        "VegetableCode": "013",
        "CatalogId": 2,
        "Name": "Broccoli",
        "Description": "Broccoli (Brassica oleracea var. italica) is a nutrient-rich vegetable known for its tree-like florets and mild, slightly bitter flavor. A staple in healthy diets, broccoli can be enjoyed steamed, roasted, stir-fried, or raw in salads. It is packed with vitamins C and K, fiber, and antioxidants, supporting immune health, bone strength, and digestion. Thriving in cool climates and well-drained soil, broccoli is a favorite among gardeners for its high nutritional value and culinary versatility.",
        "ThumbnailImage": "https://www.azamsharp.com/images/brocalli.png",
        "SeedDepth": "1/4\" (6 mm)",
        "GerminationSoilTemp": "80 F (27 C)",
        "DaysToGermination": 7,
        "SowIndoors": "7 weeks before frost",
        "SowOutdoors": "Early summer",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "16\" (40 cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun or partial shade",
        "GoodCompanions": "Bush bean, beet, carrot, celery",
        "BadCompanions": "Pole and snap beans, strawberry",
        "SowingDescription": "Broccoli is not a fast grower. You can start broccoli indoors 4-6 weeks before transplanting. Broccoli does best in full sun. So pick an area which receives at least 8 hours of full sunlight. Add compost and manure in the garden bed. This will ensure that the soil is rich with nutrients. Plant broccoli in spring or fall. ",
        "GrowingDescription": "Broccoli plants love moisture so make sure that the soil is nice and moist. Look out for weeds and make sure that the plant is free of weeds and insects. ",
        "HarvestDescription": "Broccoli takes approximately 60-70 days to mature. Use a knife to cut the bud just below the head. ",
        "Active": null,
        "Season": "Fall,Spring,Summer,Winter",
        "DaysToHarvestSeeds": 75,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Broccoli is rich in vitamins C and K, as well as fiber and antioxidants that support immune health.",
        "Pests": [
            {
                "name": "Cabbage Worms",
                "description": "Cabbage worms are the larvae of the small white butterfly (Pieris rapae), a common pest of cruciferous vegetables like cabbage, broccoli, kale, and cauliflower. These green caterpillars have a velvety texture and are voracious feeders, causing significant damage to plants.",
                "symptoms": "Infested plants exhibit holes in leaves, chewed edges, and frass (caterpillar droppings) on the foliage. In severe cases, defoliation can occur, reducing plant growth and yield.",
                "treatment": "Handpick cabbage worms from plants and dispose of them to control small infestations. Use floating row covers to prevent butterflies from laying eggs. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic control. Encourage natural predators, such as birds or parasitic wasps, in the garden.",
                "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
            }
            ,
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds. They come in various colors, such as green, yellow, black, red, or brown, depending on the species. Aphids reproduce rapidly and can form large colonies, often causing significant damage to plants.",
                "symptoms": "Infested plants may show curling, yellowing, or distorted leaves, stunted growth, and sticky honeydew on foliage, which can attract ants and lead to the growth of sooty mold. Large colonies of aphids are often visible on new shoots or the undersides of leaves.",
                "treatment": "Introduce natural predators, such as ladybugs, lacewings, and parasitic wasps, to control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil or insecticidal soaps for organic management. Remove heavily infested parts of the plant to prevent the spread of aphids.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
            
        ]
    },
    {
        "VegetableId": 20,
        "VegetableCode": "014",
        "CatalogId": 2,
        "Name": "Potato",
        "Description": "Potatoes (Solanum tuberosum) are versatile root vegetables known for their starchy, earthy flavor and culinary adaptability. A staple food worldwide, potatoes can be baked, boiled, mashed, fried, or roasted to create a variety of dishes. They are rich in carbohydrates, fiber, potassium, and vitamin C, providing energy, supporting digestion, and promoting heart health. Thriving in well-drained soil and cool climates, potatoes are easy to grow and a favorite among home gardeners.",
        "ThumbnailImage": "https://www.azamsharp.com/images/potato.png",
        "SeedDepth": "3-4\" (7.5-10 cm)",
        "GerminationSoilTemp": "45 F (7 C)",
        "DaysToGermination": 0,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "3 weeks before frost",
        "PhRange": "5.0-6.5",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, corn, marigold, parsnip, pea",
        "BadCompanions": "Cucumber, tomato, turnip",
        "SowingDescription": "Potatoes can be grown in almost all the seasons since different varieties of potatoes require different climate. Potatoes require a deep, well-drained soil instead of rich, highly nutritious soil. Plant the potato 10-12 inches deep. This will make sure that the moisture is retained in the soil. ",
        "GrowingDescription": "Early spring is the best time to plant the potatoes. Small potatoes can be planted as a whole while the larger ones can be cut into pieces. Make sure you control the weeds around the potatoes. Add some mulch around the planted area which will not allow the weed to grow. ",
        "HarvestDescription": "Late summer or early fall you are ready to pull out a grown potato. Make sure to be extra careful when digging the potatoes as you do not want to slide through the buried tubers. ",
        "Active": null,
        "Season": "Summer,Spring,Fall,Winter",
        "DaysToHarvestSeeds": 120,
        "DaysToHarvestSeedlings": 90,
        "HealthBenefits": "Potatoes are a good source of potassium, vitamin C, and fiber, promoting heart health and digestion.",
        "Pests": [
            {
                "name": "Potato Beetle",
                "description": "The potato beetle, also known as the Colorado potato beetle (Leptinotarsa decemlineata), is a common pest of potatoes, tomatoes, and eggplants. These beetles are orange-yellow with black stripes on their wings, and their larvae are reddish with black spots. Both adults and larvae feed voraciously on plant foliage, leading to significant crop damage.",
                "symptoms": "Plants infested with potato beetles may exhibit defoliation, starting with small holes in leaves and progressing to complete leaf loss. Severe infestations can weaken plants, reduce yields, and even cause plant death. Clusters of orange eggs may be visible on the undersides of leaves.",
                "treatment": "Handpick beetles and larvae from plants and destroy them. Use floating row covers to prevent beetles from reaching plants. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic control. Introduce natural predators like ladybugs and lacewings to reduce beetle populations. Crop rotation and removing plant debris at the end of the season can help disrupt their lifecycle.",
                "photo": "https://www.azamsharp.com/images/potato_beetle.png"
            }
            ,
            {
                "name": "Wireworms",
                "description": "Wireworms are the larvae of click beetles and are known for their hard, elongated bodies that resemble wires. They primarily target the roots and underground stems of plants, including potatoes, carrots, corn, and wheat. Wireworms can survive in the soil for several years, making them a persistent pest in agricultural and garden settings.",
                "symptoms": "Plants infested with wireworms may exhibit poor germination, stunted growth, and wilting. Upon inspection, roots and tubers may have small, round holes caused by wireworm feeding. In severe cases, the damage can lead to secondary infections and plant death.",
                "treatment": "Practice crop rotation to reduce wireworm populations in the soil. Use bait traps, such as buried pieces of potato, to monitor and capture wireworms. Apply beneficial nematodes to the soil to target larvae. Avoid planting susceptible crops in fields with a known wireworm history, and consider soil treatments with approved insecticides for severe infestations.",
                "photo": "https://www.azamsharp.com/images/wireworms.png"
            }
            
        ]
    },
    {
        "VegetableId": 21,
        "VegetableCode": "015",
        "CatalogId": 2,
        "Name": "Lettuce",
        "Description": "Lettuce (Lactuca sativa) is a leafy green vegetable prized for its crisp texture and mild, refreshing flavor. Commonly used as the base for salads, it is also enjoyed in wraps, sandwiches, and as a garnish. Lettuce is low in calories and rich in vitamins A and K, as well as water content, promoting hydration, skin health, and bone strength. Thriving in cool climates and well-drained soil, lettuce is a quick-growing crop that is easy to cultivate in home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/lettuce.png",
        "SeedDepth": "1/4-1/2\" (6-13 mm)",
        "GerminationSoilTemp": "40-60 F (4-16 C)",
        "DaysToGermination": 14,
        "SowIndoors": "4 weeks before transplant",
        "SowOutdoors": "On worked soil",
        "PhRange": "6.5-7.0",
        "GrowingSoilTemp": "55-65 F (13-18 C)",
        "SpacingBeds": "1/2\" (1.3 cm)",
        "Watering": "Light to moderate",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, endive, artichoke",
        "BadCompanions": "None",
        "SowingDescription": "Lettuce is a cold temperature vegetable. You can buy lettuce plants at the nursery. Spring time is a the best time to plant vegetable seeds outdoors. Choose a site which gets full soon in cool weather. \r",
        "GrowingDescription": "Lettuce comes in many different varieties so make sure to the distance between each plant is dependent on the type of lettuce you planted. Make sure that the soil is moist but do not over water it. Over watering can easily cause fungus or the roots may die because of suffocation.",
        "HarvestDescription": "As soon as the leaves are big enough you can cut them for harvest. Harvest the lettuce when the heads are firm and fully formed. ",
        "Active": null,
        "Season": "Fall,Spring,Summer,Winter",
        "DaysToHarvestSeeds": 75,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Lettuce is low in calories and high in vitamins, supporting hydration and overall health.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are tiny, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They can range in color from green, yellow, black, and red to brown, depending on the species. Aphids reproduce quickly and often form large colonies, making them a persistent pest for many types of plants, including vegetables, fruits, and ornamentals.",
                "symptoms": "Infested plants may show signs of curling, yellowing, or distorted leaves, stunted growth, and the presence of sticky honeydew on the foliage. This honeydew can attract ants and lead to the growth of sooty mold, which blocks sunlight and reduces photosynthesis.",
                "treatment": "Introduce beneficial insects such as ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray infested plants with a strong stream of water to dislodge aphids. Apply neem oil or insecticidal soap for organic control. Remove heavily infested leaves or stems to prevent further spread, and practice regular monitoring to catch infestations early.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
            ,
            {
                "name": "Leaf Miners",
                "description": "Leaf miners are the larvae of various insect species, including flies, beetles, and moths. These pests feed between the upper and lower surfaces of leaves, creating distinctive winding tunnels or blotches. Leaf miners commonly infest vegetables, ornamental plants, and fruit trees.",
                "symptoms": "Infested leaves exhibit white or translucent, winding trails (mines) caused by the larvae feeding inside. Over time, these trails may turn brown, and leaves may become distorted, discolored, or drop prematurely. Severe infestations can reduce plant vigor and photosynthesis.",
                "treatment": "Remove and destroy infested leaves to prevent the larvae from maturing. Apply neem oil or insecticidal soap to deter adult leaf miners from laying eggs. Introduce beneficial insects such as parasitic wasps to control leaf miner populations. Use floating row covers to protect plants from adult insects.",
                "photo": "https://www.azamsharp.com/images/leaf_miners.png"
            }
            
        ]
    },
    {
        "VegetableId": 22,
        "VegetableCode": "016",
        "CatalogId": 13,
        "Name": "Cauliflower",
        "Description": "Cauliflower (Brassica oleracea var. botrytis) is a versatile cruciferous vegetable known for its compact white florets and mild, nutty flavor. It can be enjoyed roasted, steamed, mashed, or as a low-carb substitute for rice or pizza crust. Rich in vitamins C and K, fiber, and antioxidants, cauliflower supports immune health, bone strength, and digestion. Thriving in cool climates and fertile, well-drained soil, it is a popular choice for home gardeners and a staple in healthy cooking.",
        "ThumbnailImage": "https://www.azamsharp.com/images/cauliflower.png",
        "SeedDepth": "1/4-1/2\" (6-13 mm)",
        "GerminationSoilTemp": "80 F (27 C)",
        "DaysToGermination": 6,
        "SowIndoors": "4-6 weeks before frost",
        "SowOutdoors": "Frost to late spring",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "60-70 F (16-21 C)",
        "SpacingBeds": "15\" (37.f cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, beet, carrot, celery, cucumber, spinach",
        "BadCompanions": "Green beans, strawberry",
        "SowingDescription": "Cauliflower belongs to the cabbage family. Like other family members cauliflower relies on soil which is rich in nitrogen. Make sure to mix organic matter and compost with the soil which will provide nitrogen and additional nutrients to the plant. Plant the seeds 4-6 weeks before the last frost. The seeds needs to be planted 1/4 to 1/2 deep.  Make sure that the seeds are moist and not overwatered.  \r",
        "GrowingDescription": "Cauliflower requires constant moisture so make sure you water then according to their needs. Place mulch around the plant so that the moisture is kept inside the soil. The mulch will also make sure that the area is cleaned from weeds. To speed up the growing process you can also use fish fertilizer. \r",
        "HarvestDescription": "When the head of the cauliflower head reaches 6 inches to 12 inches then it is time to harvest. Cut buds just below the head and enjoy the tasty cauliflower.  ",
        "Active": null,
        "Season": "Fall",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 45,
        "HealthBenefits": "Cauliflower is rich in vitamins and antioxidants that promote digestion and reduce inflammation.",
        "Pests": [
            {
                "name": "Cabbage Worms",
                "description": "Cabbage worms are the larvae of the small white butterfly (Pieris rapae), a common pest of cruciferous vegetables such as cabbage, broccoli, kale, and cauliflower. These velvety green caterpillars are voracious feeders and can cause significant damage to crops.",
                "symptoms": "Infested plants exhibit holes in leaves, chewed edges, and the presence of frass (caterpillar droppings) on the foliage. Severe infestations can result in defoliation, reduced plant growth, and poor-quality harvests.",
                "treatment": "Handpick cabbage worms from plants and dispose of them to manage small infestations. Use floating row covers to prevent butterflies from laying eggs on plants. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic control. Encourage natural predators, such as birds or parasitic wasps, to help reduce cabbage worm populations.",
                "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
            }
            ,
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in a variety of colors, including green, yellow, black, red, and brown, depending on the species. Aphids reproduce quickly and can form large colonies, causing significant damage to many types of plants, including vegetables, fruits, and ornamentals.",
                "symptoms": "Infested plants may show curled, yellowed, or distorted leaves. Stunted growth and the presence of sticky honeydew on the foliage are common. This honeydew can attract ants and lead to the growth of sooty mold, which blocks sunlight and reduces photosynthesis. Large colonies of aphids are often visible on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to control aphid populations naturally. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil or insecticidal soaps for organic control. Regularly inspect plants for early signs of infestation and remove heavily infested leaves or stems to prevent further spread.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
            
        ]
    },
    {
        "VegetableId": 23,
        "VegetableCode": "017",
        "CatalogId": 2,
        "Name": "Asparagus",
        "Description": "Asparagus (Asparagus officinalis) is a tender, spear-like vegetable known for its earthy flavor and versatility in cooking. It can be enjoyed roasted, steamed, grilled, or added to soups and salads. Asparagus is rich in vitamins A, C, and K, as well as folate and antioxidants, supporting bone health, digestion, and immune function. Thriving in well-drained soil and sunny conditions, asparagus is a perennial crop that rewards gardeners with annual harvests for years.",
        "ThumbnailImage": "https://www.azamsharp.com/images/asparagus.png",
        "SeedDepth": "1/4-1/2\" (6-13 mm)",
        "GerminationSoilTemp": "77 F (25 C)",
        "DaysToGermination": 11,
        "SowIndoors": "8 weeks before frost",
        "SowOutdoors": "Spring",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "60-70 F (16-24 C)",
        "SpacingBeds": "18\" (45 cm)",
        "Watering": "Heavy",
        "Light": "Full sun",
        "GoodCompanions": "Basil, tomato",
        "BadCompanions": "Onion, garlic, leek",
        "SowingDescription": "Buy asparagus seeds. If growing asparagus from seed, you must wait 3 years before harvesting the plant.\r",
        "GrowingDescription": "Transplant the seedlings into the ground after all signs of frost have passed. Follow the same trench method of planting used for planting crowns. \r",
        "HarvestDescription": "Harvest the asparagus when the spears are six to ten inches above the soil line. Asparagus are not meant to be stored for later use. Harvest and consume them without storing.",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 750,
        "DaysToHarvestSeedlings": 690,
        "HealthBenefits": "Asparagus is high in folate and vitamins, supporting heart health and reducing oxidative stress.",
        "Pests": [
            {
                "name": "Asparagus Beetle",
                "description": "The asparagus beetle (Crioceris asparagi) is a small, brightly colored beetle that primarily targets asparagus plants. These beetles are orange or red with black and white spots, and their larvae are soft-bodied, dark-headed grubs. They feed on asparagus spears, foliage, and berries, causing significant damage to the plant.",
                "symptoms": "Infested plants may have chewed spears, which can become deformed or scarred. Foliage damage is common, with defoliated plants struggling to grow and store energy for the next season. Eggs may appear as small, dark dots on the spears or fronds.",
                "treatment": "Handpick beetles and larvae from plants and drop them into soapy water. Remove and destroy eggs to reduce populations. Apply neem oil or insecticidal soap to manage infestations. Encourage natural predators, such as ladybugs and parasitic wasps, to help control asparagus beetle populations. Cut and remove old asparagus ferns in the fall to reduce overwintering sites.",
                "photo": "https://www.azamsharp.com/images/asparagus_beetle.png"
            }
            ,
            {
                "name": "Cutworms",
                "description": "Cutworms are the larvae of several moth species, known for their habit of cutting down young plants at the soil level. These plump, smooth caterpillars are usually gray, brown, or green and curl into a C-shape when disturbed. They are active at night and feed on a wide variety of crops, including vegetables, flowers, and grasses.",
                "symptoms": "Young plants may be severed at the base, leaving them wilted or lying on the ground. Seedlings and transplants are particularly vulnerable. Feeding damage may also appear on leaves and stems, especially near the soil surface.",
                "treatment": "Place collars made of cardboard or plastic around the base of seedlings to protect them from cutworms. Handpick cutworms at night and destroy them. Use diatomaceous earth or other barriers around plants to deter movement. Apply Bacillus thuringiensis (Bt) or beneficial nematodes to the soil to target larvae. Keep the garden weed-free to eliminate shelter for cutworms.",
                "photo": "https://www.azamsharp.com/images/cutworms.png"
            }
            
        ]
    },
    {
        "VegetableId": 24,
        "VegetableCode": "018",
        "CatalogId": 13,
        "Name": "Garlic",
        "Description": "Garlic (Allium sativum) is a flavorful bulb vegetable renowned for its pungent aroma and distinctive taste. Widely used in cuisines around the world, garlic enhances the flavor of soups, sauces, marinades, and roasted dishes. Rich in compounds like allicin, garlic offers numerous health benefits, including boosting immunity, supporting heart health, and reducing inflammation. Thriving in well-drained soil and sunny conditions, garlic is a hardy crop that is easy to grow in home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/garlic.png",
        "SeedDepth": "2\" (5 cm)",
        "GerminationSoilTemp": "55 F (13 C)",
        "DaysToGermination": 0,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Late summer to fall",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "55-75 F (13-24 C)",
        "SpacingBeds": "6 inches (15 cm)",
        "Watering": "Low",
        "Light": "Full sun",
        "GoodCompanions": "Beet, lettuce",
        "BadCompanions": "Green beans, peas",
        "SowingDescription": "Buy fresh garlic from the store or, even better, a farm stand. If you have some garlic at home that has sprouted, use it. Break the head apart into cloves. In the fall, push the cloves into the ground. Point the tips upward and plant the cloves about 2 inches deep. Fertilize the cloves or top-dress with compost. Mulch the cloves with hay, dry leaves, or straw. Fertilize again in the spring but not after May.",
        "GrowingDescription": "In spring remove the mulch and spread some compost on the bed. Only water if you feel that the ground is very dry. Make sure you control the weeds near the garlic bed. ",
        "HarvestDescription": "In late summer note that if the bottom leaves have turned yellow. This is the sign that you are garlic needs to be harvested. Use garden fork to loosen the soil and then pull the bulbs. ",
        "Active": null,
        "Season": "Spring,Summer,Fall",
        "DaysToHarvestSeeds": 210,
        "DaysToHarvestSeedlings": 190,
        "HealthBenefits": "Garlic boosts the immune system and may help lower blood pressure and cholesterol levels.",
        "Pests": [
            {
                "name": "Nematodes",
                "description": "Nematodes are microscopic roundworms that live in soil and water. While many nematodes are beneficial and help with pest control and nutrient cycling, plant-parasitic nematodes feed on roots, causing damage to crops. Common pest species include root-knot nematodes, lesion nematodes, and cyst nematodes, which target a variety of plants such as vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit stunted growth, yellowing or wilting leaves, and reduced vigor. Roots often show swelling, knots, or galls caused by root-knot nematodes. Lesions or dead patches on roots are common with other types of nematodes, leading to poor nutrient uptake and susceptibility to secondary infections.",
                "treatment": "Plant nematode-resistant crop varieties when available. Rotate crops to disrupt nematode lifecycles. Add organic matter like compost or manure to improve soil health and encourage beneficial microbes that suppress nematodes. Solarize soil by covering it with clear plastic during the hot season to kill nematodes. Use nematicides or beneficial nematodes as biological controls to reduce populations.",
                "photo": "https://www.azamsharp.com/images/nematodes.png"
            }
            ,
            {
                "name": "Onion Maggots",
                "description": "Onion maggots (Delia antiqua) are the larvae of small gray flies that primarily attack onion plants but can also infest garlic, shallots, and leeks. These maggots feed on the bulbs and roots of plants, causing significant damage to crops and reducing yields.",
                "symptoms": "Infested plants may exhibit yellowing and wilting leaves, stunted growth, and rotting bulbs. When bulbs are inspected, small tunnels or holes caused by maggot feeding may be visible. Severe infestations can lead to plant death.",
                "treatment": "Use floating row covers to prevent flies from laying eggs near plants. Practice crop rotation to avoid planting onions or related crops in the same area consecutively. Remove and destroy infested plants immediately to reduce the spread of maggots. Apply beneficial nematodes to the soil to target larvae, and consider using insecticides labeled for onion maggots if necessary.",
                "photo": "https://www.azamsharp.com/images/onion_maggots.png"
            }
            
        ]
    },
    {
        "VegetableId": 25,
        "VegetableCode": "019",
        "CatalogId": 2,
        "Name": "Green Onions",
        "Description": "Green onions (Allium fistulosum), also known as scallions, are mild-flavored onions with long, slender green stalks and small white bulbs. They are commonly used as a garnish, in salads, stir-fries, and soups, adding a fresh and slightly tangy flavor. Green onions are rich in vitamins A and C, supporting vision, immunity, and overall health. Easy to grow, they thrive in a variety of climates and are a favorite among home gardeners for their quick harvest and versatility.",
        "ThumbnailImage": "https://www.azamsharp.com/images/greenonions.png",
        "SeedDepth": "1/4\"-1/2\" (.65 - 1.3 cm)",
        "GerminationSoilTemp": "65-85F (18-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "2 months before frost",
        "SowOutdoors": "Spring",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "55-75 F (13-24 C)",
        "SpacingBeds": "3-4\" (7.5 - 10 cm)",
        "Watering": "Medium and even",
        "Light": "Full sun",
        "GoodCompanions": "Beet, cabbage family, carrot, spinach",
        "BadCompanions": "Asparagus, bean, pea",
        "SowingDescription": "Green onions also known as scallions should be planted in the soil when the soil can be worked on. Onion require a temperature of 65 to 86 F to germinate. \r",
        "GrowingDescription": "Onions require at least 1 inch of water per week. Make sure that the soil is not too dry and not too wet. Over watering can cause the plant roots to suffocate and die. \r",
        "HarvestDescription": "Usually onions take 70-90 days to reach the harvesting stage. If the stalks have reaches 6-8 inches in height then you can pull out the onions.  ",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 125,
        "DaysToHarvestSeedlings": 90,
        "HealthBenefits": "Green onions are rich in vitamins A and C, supporting vision and immunity.",
        "Pests": [
            {
                "name": "Thrips",
                "description": "Thrips are tiny, slender insects that feed on plants by piercing their surfaces and sucking out the contents of cells. They are a common pest of vegetables, fruits, and ornamental plants, causing significant damage. In addition to physical damage, thrips are known to transmit plant viruses, making them a serious agricultural concern.",
                "symptoms": "Infested plants may show silvery or stippled discoloration on leaves, distorted or deformed growth, and dark fecal spots on foliage. In severe infestations, flowers and fruits may be scarred or damaged, and plant vigor may decline.",
                "treatment": "Introduce natural predators like lacewings and minute pirate bugs to control thrip populations. Use sticky traps to monitor and reduce adult populations. Apply neem oil, insecticidal soaps, or horticultural oils to affected plants. Remove and destroy heavily infested plant parts. Maintain proper plant hygiene and avoid over-fertilizing, as excessive nitrogen can attract thrips.",
                "photo": "https://www.azamsharp.com/images/thrips.png"
            }
            ,
            {
                "name": "Onion Fly",
                "description": "The onion fly (Delia antiqua) is a small gray fly that resembles a housefly. It is a significant pest for onions and other alliums, including garlic, shallots, and leeks. The larvae, also known as maggots, feed on the roots and bulbs of these plants, causing extensive damage and reducing crop yields.",
                "symptoms": "Infested plants may exhibit yellowing and wilting of leaves, stunted growth, and rotting bulbs. Upon inspection, small tunnels or feeding damage caused by the maggots can be found inside the bulbs. Severely affected plants may die.",
                "treatment": "Prevent onion fly infestations by using floating row covers to exclude adult flies. Practice crop rotation and avoid planting onions or related crops in the same location consecutively. Remove and destroy infested plants immediately to prevent further spread. Applying beneficial nematodes to the soil can target larvae effectively. If necessary, use insecticides labeled for onion flies, following the product's instructions.",
                "photo": "https://www.azamsharp.com/images/onion_fly.png"
            }
            
        ]
    },
    {
        "VegetableId": 67,
        "VegetableCode": "020",
        "CatalogId": 2,
        "Name": "Parsley",
        "Description": "Parsley (Petroselinum crispum) is a vibrant, aromatic herb widely used as a garnish and flavor enhancer in a variety of dishes, from soups and salads to sauces and stews. Known for its fresh, slightly peppery taste, parsley is rich in vitamins A, C, and K, as well as antioxidants, supporting bone health, immunity, and digestion. This hardy herb thrives in well-drained soil and sunny or partially shaded areas, making it a popular choice for culinary and medicinal gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/parsley.png",
        "SeedDepth": "1/4\" (6 cm)",
        "GerminationSoilTemp": "65-85 F (18-29 C)",
        "DaysToGermination": 21,
        "SowIndoors": "Late winter or spring",
        "SowOutdoors": "Spring before frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "6\" (15 cm)",
        "Watering": "Light",
        "Light": "Full sun to light shade",
        "GoodCompanions": "Asparagus, corn, pepper, tomato",
        "BadCompanions": "None",
        "SowingDescription": "Parsley usually takes 3-4 weeks to germinate and require warm temperatures. After 6-8 weeks you can start transplanting it outside. Parsley requires at least 6 hours of direct sunlight. Make sure you place parsley in a location which meet this requirement.  ",
        "GrowingDescription": "Make sure that the soil is well drained and keep the soil moist. You can speed up the process by mixing compost and manure in the soil. Every now and then ensure that the soil is not dried. You can easily check the moisture in the soil by sticking your finger in it. If you feel that the soil is bone dry then add some water. ",
        "HarvestDescription": "To harvest cut the leaves starting from the outermost. This will result in growth of the other leaves. ",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 90,
        "DaysToHarvestSeedlings": 75,
        "HealthBenefits": "Parsley is high in vitamins K and C, promoting bone health and reducing oxidative stress.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. These pests come in various colors, such as green, yellow, black, red, and brown, and are known for reproducing rapidly. Aphids infest many types of plants, including vegetables, fruits, and ornamentals, often forming large colonies that cause significant damage.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and the presence of sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to control aphid populations naturally. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Regularly inspect plants for early signs of infestation and remove heavily infested parts to prevent further spread.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
            ,
            {
                "name": "Leaf Miners",
                "description": "Leaf miners are the larvae of various insect species, including flies, beetles, and moths. They burrow between the upper and lower layers of leaves, feeding on plant tissues and creating distinctive winding trails or blotches. Leaf miners commonly infest vegetables, ornamental plants, and fruit trees.",
                "symptoms": "Infested leaves show winding, translucent trails or blotches that turn brown over time. The damage reduces photosynthesis and can lead to weakened plants. In severe infestations, leaves may become distorted, discolored, or drop prematurely.",
                "treatment": "Remove and destroy infested leaves to prevent larvae from maturing. Use neem oil or insecticidal soap to deter adult insects from laying eggs. Introduce beneficial insects, such as parasitic wasps, to control leaf miner populations. Employ floating row covers to protect plants from adult insects. Maintaining proper plant health and avoiding over-fertilization can also reduce susceptibility.",
                "photo": "https://www.azamsharp.com/images/leaf_miners.png"
            }
            
        ]
    },
    {
        "VegetableId": 68,
        "VegetableCode": "021",
        "CatalogId": 2,
        "Name": "Cilantro",
        "Description": "Cilantro (Coriandrum sativum), also known as coriander leaves, is a flavorful herb with a bright, citrusy aroma widely used in cuisines around the world. It enhances the taste of salsas, curries, soups, and salads. Rich in vitamins A, C, and K, cilantro supports immunity, bone health, and digestion. This fast-growing herb thrives in cool climates and well-drained soil, making it a popular choice for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/greencoriander.png",
        "SeedDepth": "1/4 - 1/2\" (6-13 mm) ",
        "GerminationSoilTemp": "55-65 F (13-18 C)",
        "DaysToGermination": 8,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "50-75 F (10-24 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Tomato",
        "BadCompanions": "Fennel",
        "SowingDescription": "A few weeks before the last frost sow 13-16 seeds in a 5-6 inch pot. Water the seeds and in 7-10 they should germinate. You can transplant the whole pot outside 2 weeks after the last frost. ",
        "GrowingDescription": "Cilantro requires a well-draining soil. Also make sure that the soil stays moist. You can put mulch around the plant. This will ensure that the moisture stays in the soil. ",
        "HarvestDescription": "You can harvest the entire plant when it is 8 inches tall. Make sure you only harvest what you need. Cilantro is best when eaten fresh. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 45,
        "HealthBenefits": "Cilantro is rich in antioxidants and supports detoxification and digestive health.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Leaf Miners",
                "description": "Leaf miners are the larvae of various insect species, including flies, beetles, and moths. These pests feed between the upper and lower layers of leaves, creating distinctive winding trails or blotches. Leaf miners commonly infest vegetables, ornamental plants, and fruit trees, causing visible damage and reducing plant vigor.",
                "symptoms": "Infested leaves show winding, translucent trails or blotches that eventually turn brown. Severe infestations may cause leaves to become distorted, discolored, or drop prematurely. The damage reduces photosynthesis, leading to weakened plants.",
                "treatment": "Remove and destroy infested leaves to prevent larvae from maturing. Use neem oil or insecticidal soap to deter adult insects from laying eggs. Introduce beneficial insects, such as parasitic wasps, to control leaf miner populations. Employ floating row covers to protect plants from adult insects. Maintain proper plant health and avoid over-fertilization to reduce susceptibility.",
                "photo": "https://www.azamsharp.com/images/leaf_miners.png"
            }
        ]
        
    },
    {
        "VegetableId": 69,
        "VegetableCode": "022",
        "CatalogId": 2,
        "Name": "Basil",
        "Description": "Basil (Ocimum basilicum) is a fragrant herb with vibrant green leaves and a sweet, slightly peppery flavor. Widely used in Italian, Mediterranean, and Southeast Asian cuisines, basil enhances dishes such as pasta, salads, soups, and sauces. Rich in antioxidants, vitamins A and K, and essential oils, basil supports heart health, reduces inflammation, and promotes digestion. Thriving in warm, sunny climates with well-drained soil, basil is a favorite among home gardeners for its culinary and aromatic uses.",
        "ThumbnailImage": "https://www.azamsharp.com/images/sweetbasil.png",
        "SeedDepth": "Just cover",
        "GerminationSoilTemp": "75-85 F (24-29 C)",
        "DaysToGermination": 7,
        "SowIndoors": "5 weeks before frost",
        "SowOutdoors": "Spring, late summer",
        "PhRange": "5.5-7.5",
        "GrowingSoilTemp": "75-85 F (24-29 C)",
        "SpacingBeds": "4-8\"",
        "Watering": "Light and even",
        "Light": "Full sun",
        "GoodCompanions": "Pepper, tomato",
        "BadCompanions": "Beans, cabbage, cucumber",
        "SowingDescription": "Basil loves heat and it is very sensitive to cold weather. Although you can easily start the basil plant by planting outdoors but it is recommended that you start indoors two or three weeks before the last frost. \r",
        "GrowingDescription": "Basil needs heat to grow so make sure it is getting enough sunlight. Basil does not require a lot of water but make sure that the roots are not dried out.",
        "HarvestDescription": "Harvest the leaves anytime they are large enough to use. You can also harvest the whole plant before frost arrives. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 85,
        "DaysToHarvestSeedlings": 68,
        "HealthBenefits": "Basil contains antioxidants and essential oils that support heart health and reduce inflammation.",
        "Pests": [
            {
                "name": "Japanese Beetles",
                "description": "Japanese beetles (Popillia japonica) are metallic green and bronze beetles that are highly destructive pests of many plants, including roses, grapes, fruit trees, and vegetables. They feed on foliage, flowers, and fruit, leaving skeletonized leaves and damaged crops in their wake.",
                "symptoms": "Infested plants show skeletonized leaves, with only the veins remaining. Flowers and fruits may have chewed edges or holes. Large numbers of beetles can strip plants of their foliage, severely weakening them.",
                "treatment": "Handpick beetles from plants and place them in soapy water to kill them. Use floating row covers to protect plants during peak beetle activity. Apply neem oil or insecticidal soaps for organic control. Consider using milky spore powder or beneficial nematodes in the soil to target Japanese beetle larvae (grubs). Avoid planting highly attractive plants near susceptible crops to reduce infestations.",
                "photo": "https://www.azamsharp.com/images/japanese_beetles.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
        ]
        
    },
    {
        "VegetableId": 70,
        "VegetableCode": "023",
        "CatalogId": 13,
        "Name": "Radicchio",
        "Description": "Radicchio (Cichorium intybus) is a leafy vegetable with striking red and white leaves and a slightly bitter flavor. Often used in salads, grilled dishes, or risottos, radicchio adds a vibrant color and unique taste to meals. It is rich in antioxidants, vitamins K and C, and dietary fiber, supporting digestion, bone health, and immune function. Thriving in cool climates and well-drained soil, radicchio is a popular choice for home gardens and gourmet cooking.",
        "ThumbnailImage": "https://www.azamsharp.com/images/redcabbage.png",
        "SeedDepth": "1/4\" (6 mm)",
        "GerminationSoilTemp": "60-65 F (16-18 C)",
        "DaysToGermination": 6,
        "SowIndoors": "8 weeks before frost",
        "SowOutdoors": "2 weeks before frost",
        "PhRange": "5.5-6.8",
        "GrowingSoilTemp": "45-65 F (7-18 C)",
        "SpacingBeds": "8-10\" (20-25 cm)",
        "Watering": "Moderate",
        "Light": "Fun sun",
        "GoodCompanions": "Lettuce",
        "BadCompanions": "None",
        "SowingDescription": "Radicchio requires cold weather to grow. It tolerates cold and frost very well. To harvest in winter make sure you begin sowing in midsummer. ",
        "GrowingDescription": "See sowing",
        "HarvestDescription": "Radicchio can be harvested as soon as the head is firm. ",
        "Active": null,
        "Season": "Fall",
        "DaysToHarvestSeeds": 80,
        "DaysToHarvestSeedlings": 65,
        "HealthBenefits": "Radicchio is rich in antioxidants and vitamins, promoting digestion and reducing inflammation.",
        "Pests": [
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of various crops, including tomatoes, potatoes, eggplants, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles create distinctive 'shot-hole' damage, making them a significant pest for young plants.",
                "symptoms": "Infested plants exhibit small, round holes in leaves, giving them a perforated appearance. Severe infestations can stunt plant growth, reduce vigor, and even kill seedlings. The damage may lead to reduced photosynthesis and weakened plants.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as parasitic wasps and tachinid flies to reduce populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and keep the garden free of debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
        ]
        
    },
    {
        "VegetableId": 71,
        "VegetableCode": "024",
        "CatalogId": 2,
        "Name": "Dill",
        "Description": "Dill (Anethum graveolens) is a feathery, aromatic herb known for its distinct, slightly tangy flavor. It is widely used in pickling, as well as to enhance the taste of soups, salads, seafood, and sauces. Rich in vitamins A and C, as well as antioxidants, dill supports immune health, digestion, and overall well-being. Thriving in well-drained soil and sunny conditions, dill is a fast-growing herb that is easy to cultivate in home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/dill.png",
        "SeedDepth": "Just cover",
        "GerminationSoilTemp": "60-70 F (16-21 C)",
        "DaysToGermination": 21,
        "SowIndoors": "5 weeks before transplant",
        "SowOutdoors": "Spring to summer",
        "PhRange": "5.5-6.5",
        "GrowingSoilTemp": "60-80 F (16-27 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Heavy",
        "Light": "Full sun",
        "GoodCompanions": "Cabbage ",
        "BadCompanions": "Carrot",
        "SowingDescription": "Dill is one of those plants that grows by itself. Just sprinkle the seeds on a well worked soil and cover them up lightly with soil and water. ",
        "GrowingDescription": "Once the plant is few inches tall add mulch to prevent the weeds from growing near it. Also the mulch will make sure that the moisture stays in the soil. ",
        "HarvestDescription": "You can begin to harvest as soon as the plant is large enough. ",
        "Active": null,
        "Season": "Spring,Fall",
        "DaysToHarvestSeeds": 115,
        "DaysToHarvestSeedlings": 100,
        "HealthBenefits": "Dill is rich in antioxidants and supports digestion and bone health.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the growth of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Caterpillars",
                "description": "Caterpillars are the larvae of moths and butterflies, and they feed voraciously on leaves and other plant parts. Depending on the species, caterpillars can cause extensive damage to a wide variety of plants, including vegetables, fruits, and ornamental flowers. Some caterpillars can grow large and are easily visible, while others remain small and more difficult to spot.",
                "symptoms": "Plants infested with caterpillars may show signs of chewed or eaten leaves, holes in foliage, and frass (droppings) on the plants. Larger infestations can result in significant defoliation and stunted plant growth. Some caterpillars may also feed on fruits and flowers, causing damage to the crop.",
                "treatment": "Handpick caterpillars from plants and place them in soapy water for disposal. Apply Bacillus thuringiensis (Bt) or spinosad for organic control of caterpillar populations. Use floating row covers to prevent adult moths or butterflies from laying eggs. Encourage natural predators, such as birds and parasitic wasps, to help manage caterpillar populations.",
                "photo": "https://www.azamsharp.com/images/caterpillars.png"
            }
        ]
        
    },
    {
        "VegetableId": 73,
        "VegetableCode": "025",
        "CatalogId": 13,
        "Name": "Brussels Sprouts",
        "Description": "Brussels sprouts (Brassica oleracea var. gemmifera) are small, leafy green buds that grow along a tall stalk, prized for their slightly nutty and earthy flavor. They can be roasted, steamed, sautéed, or added to salads and casseroles. Rich in vitamins C and K, fiber, and antioxidants, Brussels sprouts support immune health, bone strength, and digestion. Thriving in cool climates and fertile, well-drained soil, they are a rewarding crop for home gardeners and a staple in healthy cooking.",
        "ThumbnailImage": "https://www.azamsharp.com/images/brusselssprouts.png",
        "SeedDepth": "1/4\" (6 mm)",
        "GerminationSoilTemp": "75-80 F (24-27 C)",
        "DaysToGermination": 7,
        "SowIndoors": "5 weeks before frost",
        "SowOutdoors": "Early summer",
        "PhRange": "6.0-6.8",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "16-18\" (40-45 cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, carrot, celery, cucumber, lettuce",
        "BadCompanions": "Strawberry",
        "SowingDescription": "Brussels takes a long time to grow. It is recommended that you start indoors about a month before the last frost. Usually the seeds takes 1 week to germinate. You can transplant the seedlings when they are about four to six weeks old. ",
        "GrowingDescription": "Brussels love cool weather and moist soil. Apply compost layer on the bed. This will build up nutrients. You can also put mulch on the top of the plant soil to make sure that the soil stay moist. ",
        "HarvestDescription": "Harvest when you find that the buds are firm. Make sure you do not leave the plant out in below freezing temperatures. If that is the case then cut the whole plant. ",
        "Active": null,
        "Season": "Fall,Winter",
        "DaysToHarvestSeeds": 95,
        "DaysToHarvestSeedlings": 78,
        "HealthBenefits": "Brussels sprouts are high in vitamins C and K, supporting immunity and bone health.",
        "Pests": [
            {
                "name": "Cabbage Worms",
                "description": "Cabbage worms are the larvae of the small white butterfly (Pieris rapae), a common pest of cruciferous vegetables like cabbage, broccoli, kale, and cauliflower. These green caterpillars have a velvety texture and are voracious feeders, causing significant damage to plants.",
                "symptoms": "Infested plants exhibit holes in leaves, chewed edges, and the presence of frass (caterpillar droppings) on the foliage. Severe infestations can result in defoliation, reduced plant growth, and poor-quality harvests.",
                "treatment": "Handpick cabbage worms from plants and dispose of them to manage small infestations. Use floating row covers to prevent butterflies from laying eggs. Apply Bacillus thuringiensis (Bt) or spinosad-based insecticides for organic control. Encourage natural predators, such as birds or parasitic wasps, in the garden.",
                "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the growth of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
        ]
        
    },
    {
        "VegetableId": 74,
        "VegetableCode": "026",
        "CatalogId": 2,
        "Name": "Mustard Green",
        "Description": "Mustard greens (Brassica juncea) are leafy vegetables with a peppery, slightly spicy flavor, commonly used in salads, stir-fries, and soups. Packed with vitamins A, C, and K, as well as antioxidants, they support immune health, bone strength, and digestion. These hardy greens thrive in cool climates and well-drained soil, making them a nutritious and easy-to-grow choice for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/mustardgreen.png",
        "SeedDepth": "1/4\" (6 mm)",
        "GerminationSoilTemp": "65-70 F (18-21 C)",
        "DaysToGermination": 5,
        "SowIndoors": "2 weeks before frost",
        "SowOutdoors": "Spring to summer",
        "PhRange": "5.5-7.0",
        "GrowingSoilTemp": "50-70 F (10-21 C)",
        "SpacingBeds": "6-15\" (15-37.5 cm)",
        "Watering": "Moderate",
        "Light": "Full sun to partial shade",
        "GoodCompanions": "Bush bean, beet, carrot, celery",
        "BadCompanions": "Strawberry",
        "SowingDescription": "Prepare a well worked soil by adding compost and other organic matter to it. Although mustard needs a full sun but it can be grown few weeks before the last frost. ",
        "GrowingDescription": "Mustard plant loves moisture so make sure the soil is moist. Fish and seaweed fertilizers can be given to the plant every few weeks. This will encourage the overall growth of the plant.",
        "HarvestDescription": "Begin the harvest as soon as the leaves are big enough for your liking. If the plant has reached the height of 6-8 inches then you can cut the whole plant. ",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 36,
        "DaysToHarvestSeedlings": 18,
        "HealthBenefits": "Mustard greens are rich in antioxidants and vitamins, promoting heart and bone health.",
        "Pests": [
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of various crops, including tomatoes, potatoes, eggplants, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles create distinctive 'shot-hole' damage, making them a significant pest for young plants.",
                "symptoms": "Infested plants exhibit small, round holes in leaves, often resembling shotgun damage. Severe infestations can stunt plant growth, reduce vigor, and even kill seedlings. The damage may lead to reduced photosynthesis and weakened plants.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as parasitic wasps and tachinid flies to reduce populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and keep the garden free of debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in a variety of colors, such as green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the growth of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
        ]
        
    },
    {
        "VegetableId": 75,
        "VegetableCode": "027",
        "CatalogId": 2,
        "Name": "Orach",
        "Description": "Orach (Atriplex hortensis), also known as mountain spinach, is a leafy vegetable with vibrant green, red, or purple leaves and a mild, slightly salty flavor. It is often used as a substitute for spinach in salads, soups, and sautés. Orach is rich in vitamins A and C, iron, and antioxidants, supporting immune health, blood health, and overall vitality. Thriving in warm climates and well-drained soil, orach is a hardy and visually striking addition to home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/orach.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "50-65 F (10-18 C)",
        "DaysToGermination": 10,
        "SowIndoors": "3 weeks before frost",
        "SowOutdoors": "At germination temperature",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "50-75 F (10-24 C)",
        "SpacingBeds": "2\" (5 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Cabbage family, celery, onion, radish",
        "BadCompanions": "Potato",
        "SowingDescription": "Orach like spinach loves cool weather. Make sure the soil is fertile and contains some organic matter. ",
        "GrowingDescription": "Although orach can tolerate warm weather but it taste best in cool weather. ",
        "HarvestDescription": "You can start harvesting the leaves as soon as they are 1 to 2 inches long. ",
        "Active": null,
        "Season": "Spring,Fall",
        "DaysToHarvestSeeds": 40,
        "DaysToHarvestSeedlings": 30,
        "HealthBenefits": "Orach is high in iron and antioxidants, supporting blood health and reducing inflammation.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They can be green, yellow, black, red, or brown, and they reproduce rapidly, forming large colonies. Aphids are common pests on many types of plants, including vegetables, fruits, and ornamental plants. Their feeding weakens plants, and they can transmit plant viruses.",
                "symptoms": "Infested plants often show curled, yellowed, or distorted leaves. There may also be stunted growth and sticky honeydew on foliage, which attracts ants and promotes the growth of sooty mold. Aphids are usually visible in clusters on the undersides of leaves and new growth.",
                "treatment": "To manage aphid infestations, encourage natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soap, or horticultural oils for organic control. Regularly inspect plants for aphids and remove heavily infested leaves or stems.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of a wide variety of crops, including tomatoes, potatoes, and leafy greens. These beetles get their name from their ability to jump like fleas when disturbed. Flea beetles create distinctive shot-hole damage to leaves, making them a serious pest for young plants.",
                "symptoms": "Infested plants show small, round holes in the leaves, giving them a perforated appearance. Flea beetles can cause stunted plant growth, reduced vigor, and even kill seedlings under heavy infestations. The damage weakens the plant and may lead to secondary infections.",
                "treatment": "To control flea beetles, use floating row covers to protect seedlings. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as tachinid flies and parasitic wasps to reduce populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and remove plant debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            }
        ]
        
    },
    {
        "VegetableId": 79,
        "VegetableCode": "028",
        "CatalogId": 13,
        "Name": "Sweet Potato",
        "Description": "Sweet potatoes (Ipomoea batatas) are nutrient-dense root vegetables known for their naturally sweet flavor and versatility in cooking. They can be baked, mashed, roasted, or used in desserts and savory dishes. Rich in beta-carotene, vitamins A and C, and dietary fiber, sweet potatoes support eye health, immunity, and digestion. Thriving in warm climates with well-drained soil, sweet potatoes are a resilient crop and a favorite for home gardeners.",
        "ThumbnailImage": "https://www.azamsharp.com/images/sweetpotato.png",
        "SeedDepth": "Not applicable",
        "GerminationSoilTemp": "Not applicable",
        "DaysToGermination": 0,
        "SowIndoors": "Not applicable",
        "SowOutdoors": "2 weeks before frost",
        "PhRange": "5.6-6.5",
        "GrowingSoilTemp": "65-90F (18-32 C)",
        "SpacingBeds": "14-18\" (35-45 cm)",
        "Watering": "Low",
        "Light": "Full sun",
        "GoodCompanions": "None",
        "BadCompanions": "Beet, carrot, potato",
        "SowingDescription": "You can start the process of planted sweet potatoes by putting them in a glass half filled with water. This step makes sure that the roots are developed correctly so that it can be planted outside. Every few days replace the water in the glass with fresh water. The fresh water will ensure the continuous growth of the roots.\r",
        "GrowingDescription": "Water the slips throughly so that they can easily get established. In summer season make sure the plant gets enough supply of water. Keep the plant free of weeds, this will also ensure that all the nutrients are consumed by the plant and not the weeds.",
        "HarvestDescription": "In the fall weather when the top of the plant is turning black then start harvesting. Be careful when digging for the potatoes as you do not want to cut the slips from the potatoes that can be used for future plants.",
        "Active": null,
        "Season": "Fall",
        "DaysToHarvestSeeds": 115,
        "DaysToHarvestSeedlings": 90,
        "HealthBenefits": "Sweet potatoes are rich in beta-carotene and fiber, promoting eye health and digestion.",
        "Pests": [
            {
                "name": "Sweet Potato Weevil",
                "description": "The sweet potato weevil (Cylas formicarius) is a significant pest that attacks sweet potatoes and other root vegetables. These beetles are small, with reddish-brown bodies and long snouts. The larvae feed inside the tubers, causing damage to the flesh and creating tunnels, which can lead to decay and poor-quality crops.",
                "symptoms": "Infested sweet potatoes may show signs of tunneling and small holes in the tubers. The leaves may yellow and wilt prematurely. In severe infestations, the tubers may rot, and the plants can die. Infested crops may also emit a distinctive, unpleasant odor.",
                "treatment": "Use crop rotation to prevent build-up of sweet potato weevils in the soil. Apply floating row covers to protect young plants from adult beetles. Remove and destroy infested tubers immediately after harvest. Consider using insecticides labeled for use on sweet potatoes to target adult weevils and larvae, following safety guidelines.",
                "photo": "https://www.azamsharp.com/images/sweet_potato_weevil.png"
            },
            {
                "name": "Wireworms",
                "description": "Wireworms are the larvae of click beetles and are known for their hard, elongated bodies that resemble wires. They primarily target the roots and underground stems of plants, including potatoes, carrots, corn, and wheat. Wireworms can survive in the soil for several years, making them a persistent pest in agricultural and garden settings.",
                "symptoms": "Plants infested with wireworms may exhibit poor germination, stunted growth, and wilting. Upon inspection, roots and tubers may have small, round holes caused by wireworm feeding. In severe cases, the damage can lead to secondary infections and plant death.",
                "treatment": "Practice crop rotation to reduce wireworm populations in the soil. Use bait traps, such as buried pieces of potato, to monitor and capture wireworms. Apply beneficial nematodes to the soil to target larvae. Avoid planting susceptible crops in fields with a known wireworm history, and consider soil treatments with approved insecticides for severe infestations.",
                "photo": "https://www.azamsharp.com/images/wireworms.png"
            }
        ]
        
    },
    {
        "VegetableId": 80,
        "VegetableCode": "029",
        "CatalogId": 13,
        "Name": "Artichoke",
        "Description": "Artichokes (Cynara scolymus) are edible flower buds prized for their tender hearts and slightly nutty, earthy flavor. They can be steamed, roasted, grilled, or used in dips and salads. Rich in fiber, antioxidants, and vitamins C and K, artichokes support digestion, liver health, and immunity. Thriving in warm climates with well-drained soil, artichokes are a perennial plant that adds both culinary value and ornamental beauty to gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/artichoke.png",
        "SeedDepth": "1/4\" (6 cm)",
        "GerminationSoilTemp": "70-80 F (21-27 C)",
        "DaysToGermination": 12,
        "SowIndoors": "Winter, early spring",
        "SowOutdoors": "Not recommended",
        "PhRange": "6.5-8.0",
        "GrowingSoilTemp": "60-75 F (16-24 C)",
        "SpacingBeds": "24\" (60 cm)",
        "Watering": "Heavy",
        "Light": "8 hours a day",
        "GoodCompanions": "Sunflowers",
        "BadCompanions": "None",
        "SowingDescription": "Make sure that all dangers of frost has passed. Artichokes requires good amount of sunlight so make sure that the plant is in a location that gets at least 8 hours of sunlight. Mix organic matter and manure with the soil and make sure that the soil is well drained.",
        "GrowingDescription": "Make sure that the soil around the plant is moist. You can also put some mulch around the plant which will keep the soil moist and make sure no weeds are growing near your plant.",
        "HarvestDescription": "When the buds have begun to flower, pick them. Enjoy your freshly cut/picked artichokes.",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 150,
        "DaysToHarvestSeedlings": 110,
        "HealthBenefits": "Artichokes are high in fiber and antioxidants, supporting liver health and digestion.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in a variety of colors, such as green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests on many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the growth of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Cutworms",
                "description": "Cutworms are the larvae of several moth species that attack seedlings by cutting them off at the soil level. These caterpillars are typically gray, brown, or green and are known for their destructive feeding habits. They can cause significant damage to young plants, particularly in the early stages of growth.",
                "symptoms": "Plants infested by cutworms often show signs of wilting, with the base of stems cut cleanly through. Seedlings may be completely severed, leaving them lying flat on the ground. In some cases, leaves may also be damaged or partially eaten.",
                "treatment": "Place collars made of cardboard or plastic around the base of seedlings to protect them from cutworms. Handpick cutworms at night and destroy them. Use diatomaceous earth or other barriers around plants to deter movement. Apply Bacillus thuringiensis (Bt) or beneficial nematodes to the soil to target larvae. Keep the garden weed-free to eliminate shelter for cutworms.",
                "photo": "https://www.azamsharp.com/images/cutworms.png"
            }
        ]
        
    },
    {
        "VegetableId": 81,
        "VegetableCode": "030",
        "CatalogId": 13,
        "Name": "Chard",
        "Description": "Chard (Beta vulgaris subsp. cicla), also known as Swiss chard, is a leafy green vegetable with vibrant stems in shades of red, yellow, or white. Known for its mild, slightly earthy flavor, chard is versatile and can be sautéed, added to soups, or used in salads. Packed with vitamins A, C, and K, as well as iron and magnesium, chard supports bone health, immunity, and overall vitality. Thriving in cool climates and well-drained soil, chard is a resilient crop and a favorite among gardeners.",
        "ThumbnailImage": "https://www.azamsharp.com/images/chard.png",
        "SeedDepth": "1/4\" (6 cm)",
        "GerminationSoilTemp": "40-95 F",
        "DaysToGermination": 6,
        "SowIndoors": "4 weeks before frost",
        "SowOutdoors": "Spring",
        "PhRange": "5.5-6.5",
        "GrowingSoilTemp": "75-85 F",
        "SpacingBeds": "6-12\" apart",
        "Watering": "Medium to heavy",
        "Light": "Full sun",
        "GoodCompanions": "Beet, carrot",
        "BadCompanions": "None",
        "SowingDescription": "In spring you can start working on the soil. Mix compost and manure to make sure that the soil is rich with nutrition. Dig rows that are 3\" deep and a foot apart. Fill your soil mixed with compost into that row making sure not to fill it completely since the seeds needs to go in too. Place the seeds in the row and then cover them with soil.",
        "GrowingDescription": "Water the seeds and keep the soil moist. In about 2 weeks you will notice that seedlings are appearing. Continue to keep the soil moist and wet.",
        "HarvestDescription": "Start harvesting the leaves when they are at least 6-7 inches long. Start picking the leaves from the outside. Make sure to leave few leaves behind as they will grow continuously.",
        "Active": null,
        "Season": "Spring,Fall",
        "DaysToHarvestSeeds": 70,
        "DaysToHarvestSeedlings": 50,
        "HealthBenefits": "Chard is rich in vitamins A and K, promoting eye and bone health.",
        "Pests": [
            {
                "name": "Leaf Miners",
                "description": "Leaf miners are the larvae of various insect species, including flies, beetles, and moths. These pests burrow between the upper and lower layers of leaves, feeding on plant tissues and creating distinctive winding trails or blotches. Leaf miners commonly infest vegetables, ornamental plants, and fruit trees, reducing the plant's ability to photosynthesize.",
                "symptoms": "Infested leaves show winding, translucent trails or blotches that turn brown over time. In severe cases, leaves may become distorted, discolored, or drop prematurely. The damage reduces photosynthesis and can lead to weakened plants.",
                "treatment": "Remove and destroy infested leaves to prevent larvae from maturing. Use neem oil or insecticidal soap to deter adult insects from laying eggs. Introduce beneficial insects such as parasitic wasps to control leaf miner populations. Employ floating row covers to protect plants from adult insects. Maintaining plant health through proper irrigation and fertilization can also help reduce susceptibility.",
                "photo": "https://www.azamsharp.com/images/leaf_miners.png"
            },
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of a wide range of crops, including tomatoes, potatoes, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles cause significant damage to young plants by creating small, round holes in leaves, often giving them a perforated or 'shot-hole' appearance.",
                "symptoms": "Infested plants exhibit small, round holes in leaves, which appear like shot holes. Flea beetles can stunt plant growth, reduce vigor, and even kill seedlings under heavy infestations. The damage can reduce photosynthesis, weaken the plant, and make it more susceptible to other diseases.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as tachinid flies and parasitic wasps to reduce flea beetle populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and remove plant debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            }
        ]
        
    },
    {
        "VegetableId": 82,
        "VegetableCode": "031",
        "CatalogId": 2,
        "Name": "Fennel",
        "Description": "Fennel (Foeniculum vulgare) is a perennial herb with feathery green leaves and a mild, licorice-like flavor. It is versatile in cooking, used fresh in salads, roasted as a side dish, or as an aromatic in soups and stews. Rich in fiber, vitamins C and A, and essential nutrients, fennel supports digestion, immunity, and eye health. Thriving in sunny conditions and well-drained soil, fennel is a beautiful and functional addition to home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/fennel.png",
        "SeedDepth": "1/4\" (6 cm)",
        "GerminationSoilTemp": "65-75 F (18-24 C)",
        "DaysToGermination": 10,
        "SowIndoors": "4 weeks before frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "65-80 F (18-27 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Mint",
        "BadCompanions": "Everything",
        "SowingDescription": "You can start the fennel seeds indoors 2-3 weeks before the last frost. Sow the seeds in small pots filled with potting soil. Fennel seeds require moist soil so make sure that you are giving adequate water to the seeds. ",
        "GrowingDescription": "When the seeds are showing the signs of germination transplant them outside in 1/2 inch deep soil. Keep the seeds moist by watering them. Make sure you are keeping weed away from the plant. You may require to remove the weeds using stake.  ",
        "HarvestDescription": "harvesting season. Pick the leaves throughout the growing season and use them in our cooking. ",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 118,
        "DaysToHarvestSeedlings": 100,
        "HealthBenefits": "Fennel is rich in antioxidants and fiber, supporting digestion and reducing inflammation.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They can vary in color, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests that affect a wide variety of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce natural predators like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Carrot Weevils",
                "description": "Carrot weevils (Listronotus oregonensis) are small, dark brown beetles that primarily target carrots but can also infest other root crops like parsnips, celery, and parsley. These weevils cause damage by laying eggs in the soil near plant roots, and their larvae burrow into the roots, causing tunneling and decay.",
                "symptoms": "Infested plants may show signs of damaged or hollowed-out roots, which may appear discolored or rotting. Above-ground symptoms include yellowing leaves and stunted plant growth. Severe infestations can lead to reduced crop yields and poor-quality root vegetables.",
                "treatment": "To prevent carrot weevil infestations, practice crop rotation and avoid planting carrots in the same soil for multiple years. Use row covers to keep adult beetles from laying eggs on the plants. Remove and destroy infected plants immediately after harvest. Consider using organic insecticides such as neem oil or spinosad, and incorporate beneficial nematodes into the soil to target larvae.",
                "photo": "https://www.azamsharp.com/images/carrot_weevils.png"
            }
        ]
        
    },
    {
        "VegetableId": 83,
        "VegetableCode": "032",
        "CatalogId": 13,
        "Name": "Leeks",
        "Description": "Leeks (Allium ampeloprasum) are a mild, onion-like vegetable known for their sweet, subtle flavor. They are commonly used in soups, stews, and sautés, adding depth and richness to dishes. Leeks are rich in vitamins A, K, and C, as well as antioxidants, promoting heart health and supporting the immune system. Thriving in cool climates, leeks are a hardy crop that rewards gardeners with a versatile kitchen ingredient.",
        "ThumbnailImage": "https://www.azamsharp.com/images/leeks.png",
        "SeedDepth": "1/4\" (6 cm)",
        "GerminationSoilTemp": "75 F (24 C)",
        "DaysToGermination": 6,
        "SowIndoors": "4 weeks before frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "60 F (16 C)",
        "SpacingBeds": "6\" (15 cm) in rows",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, carrot, beet",
        "BadCompanions": "Peas, green beans",
        "SowingDescription": "Leeks require a nice mild climate. Before planting check that if the temperature falls in the range of 55-75F. Add organic matter and compost to prepare the soil. Leeks work wonders in raised beds. If you started the seeds indoors then you can transplant in about 8-10 weeks before last frost. Sow the seeds 1/2 inch deep and about 1/4 inch apart. ",
        "GrowingDescription": "Leeks needs constant moisture so make sure you are given them adequate amount of water. You should also put much around the plant to make sure that the moisture is well contained. The mulch will also prevent weeds from growing near the plant.",
        "HarvestDescription": "During late summer or early autumn the leeks plants should be ready for harvest. Usually it takes 60 days for leeks to reach the harvesting condition. Leeks should be removed as a whole plant. Dig your fingers into the soil and pull out the complete plant.",
        "Active": null,
        "Season": "Spring,Fall,Summer,Winter",
        "DaysToHarvestSeeds": 90,
        "DaysToHarvestSeedlings": 80,
        "HealthBenefits": "Leeks are high in vitamins and antioxidants, promoting heart health and reducing inflammation.",
        "Pests": [
    {
        "name": "Onion Maggots",
        "description": "Onion maggots (Delia antiqua) are the larvae of small gray flies that infest onions and other allium plants, such as garlic, shallots, and leeks. The larvae feed on the roots and bulbs, causing significant damage to the plants. Onion maggots thrive in moist, cool conditions and are particularly problematic during the early stages of growth.",
        "symptoms": "Infested plants may show yellowing and wilting of leaves, stunted growth, and rotting bulbs. Upon inspection, small tunnels or feeding damage caused by the larvae can be found inside the bulbs. In severe cases, the plants may die prematurely.",
        "treatment": "To manage onion maggot infestations, use floating row covers to prevent flies from laying eggs near the plants. Practice crop rotation to avoid planting onions or related crops in the same location year after year. Remove and destroy infested plants immediately after harvest. Consider using insecticides labeled for use on onions or applying beneficial nematodes to the soil to target larvae.",
        "photo": "https://www.azamsharp.com/images/onion_maggots.png"
    },
    {
        "name": "Thrips",
        "description": "Thrips are tiny, slender insects that feed on plants by piercing the surfaces and sucking out cell contents. They are a common pest of vegetables, fruits, and ornamental plants, causing both direct damage to the plant tissues and potentially transmitting plant viruses.",
        "symptoms": "Infested plants may show silvery or stippled discoloration on leaves, distorted or deformed growth, and dark fecal spots on foliage. In severe infestations, flowers and fruits may be scarred, damaged, or prematurely drop. Thrips are often difficult to spot due to their small size.",
        "treatment": "Introduce natural predators such as lacewings and minute pirate bugs to reduce thrip populations. Use sticky traps to monitor and control adult thrips. Apply neem oil, insecticidal soap, or horticultural oils to affected plants. Regularly inspect plants and remove heavily infested leaves or flowers. Maintaining proper plant health can also reduce the risk of thrip infestations.",
        "photo": "https://www.azamsharp.com/images/thrips.png"
    }
]
    },
    {
        "VegetableId": 84,
        "VegetableCode": "033",
        "CatalogId": 11,
        "Name": "Mint",
        "Description": "Mint (Mentha) is a refreshing herb known for its cool, sweet aroma and flavor. It is widely used in teas, desserts, and savory dishes, as well as for its medicinal properties. Mint is rich in antioxidants, vitamins A and C, and essential oils, supporting digestion, soothing headaches, and promoting overall wellness. Thriving in moist soil and partial sunlight, mint is a fast-growing herb perfect for container gardens or outdoor spaces.",
        "ThumbnailImage": "https://www.azamsharp.com/images/mint.png",
        "SeedDepth": "1/4 inch (6.25 mm)",
        "GerminationSoilTemp": "65 - 70 F",
        "DaysToGermination": 12,
        "SowIndoors": "4 weeks before planting outside",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "55 - 80 F (13-27 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "Nothing",
        "SowingDescription": "Mint plants are available in almost all the nurseries and we highly recommend from planting mints from already grown plants instead of seeds. When picking a mint plant make sure that it is not infected with insects and bugs. Give special attention to the mint leaves. That is the first place where you will see damage (if any). ",
        "GrowingDescription": "A mature mint place requires more space to grow. Make sure there is adequate space in the pot when planting mint plant. Make sure the pot has holes at the bottom. This will make sure that the plant root do not rot. Make sure to give mint enough sunlight and water. In some areas which gets over 100 F temperature in summer it is recommended that you put the plant in a shady region. Extreme heat can kill the plant. ",
        "HarvestDescription": "The great thing about mint is that you will now when to harvest. The leaves will be full and the minty aroma will fill your room. Harvest mint by removing the fully grown leaves. ",
        "Active": null,
        "Season": "Spring,Summer,Fall,Winter",
        "DaysToHarvestSeeds": 100,
        "DaysToHarvestSeedlings": 70,
        "HealthBenefits": "Mint aids digestion, reduces nausea, and provides a refreshing flavor.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in a variety of colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Spider Mites",
                "description": "Spider mites are tiny arachnids that feed on plant sap, causing damage by piercing the plant cells with their sharp mouthparts. These pests thrive in hot, dry conditions and can infest a wide variety of plants, including vegetables, fruits, and ornamentals. They are often difficult to detect because of their small size, but the damage they cause is noticeable.",
                "symptoms": "Infested plants may exhibit stippling or speckled discoloration on leaves, followed by yellowing and eventual leaf drop. Spider mites may also produce fine webbing on the undersides of leaves and stems. In severe cases, plant growth is stunted, and plants can die prematurely.",
                "treatment": "Use a strong stream of water to wash off spider mites from infested plants. Apply miticides or insecticidal soaps labeled for spider mites. Encourage natural predators, such as predatory mites and ladybugs, to reduce populations. Maintain optimal humidity and watering to prevent spider mite infestations, as they thrive in dry conditions. Regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/spider_mites.png"
            }
        ]
        
    },
    {
        "VegetableId": 85,
        "VegetableCode": "034",
        "CatalogId": 13,
        "Name": "Spinach",
        "Description": "Spinach (Spinacia oleracea) is a nutrient-packed leafy green with a tender texture and mild flavor. It is enjoyed fresh in salads, cooked in soups, or blended into smoothies. Rich in iron, vitamins A and C, and antioxidants, spinach supports energy levels, immunity, and eye health. Thriving in cool climates and well-drained soil, spinach is an easy-to-grow and highly versatile crop.",
        "ThumbnailImage": "https://www.azamsharp.com/images/spinach.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "50-75 F (10-24 C)",
        "DaysToGermination": 10,
        "SowIndoors": "3-4 weeks before frost",
        "SowOutdoors": "Early spring",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Light but even",
        "Light": "Full sun",
        "GoodCompanions": "Celery, lettuce, onion, radish",
        "BadCompanions": "Potato",
        "SowingDescription": "Spinach loves cool weather and is frost tolerant. You can directly sow into the outside soil in spring when the soil can be worked on. Stop planting when the weather is warm. As described earlier Spinach germinates the best in cool weather. ",
        "GrowingDescription": "Make sure that the soil is rich with organic matter and compost. Keep the balance between adding the organic matter to the soil as too much nitrogen can affect the taste of the Spinach when harvested. ",
        "HarvestDescription": "You can harvest as soon as the leaves are big enough. You can even cut the entire plant from the root. This is the good option when you are approaching warm weather. ",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 55,
        "DaysToHarvestSeedlings": 38,
        "HealthBenefits": "Spinach is high in iron, vitamins, and antioxidants, supporting bone and eye health.",
        "Pests": [
            {
                "name": "Leaf Miners",
                "description": "Leaf miners are the larvae of various insect species, including flies, beetles, and moths, that feed between the upper and lower layers of leaves. They create distinctive winding trails or blotches on the surface of the leaves. Leaf miners infest many types of plants, including vegetables, fruits, and ornamental plants, reducing the plant's ability to photosynthesize.",
                "symptoms": "Infested leaves exhibit winding, translucent trails or irregular blotches, which eventually turn brown. Over time, the affected leaves may become distorted, discolored, or drop prematurely. Severe infestations can weaken plants and reduce crop yields.",
                "treatment": "Remove and destroy infested leaves to prevent larvae from maturing. Use neem oil or insecticidal soap to deter adult leaf miners from laying eggs. Introduce natural predators, such as parasitic wasps, to control populations. Floating row covers can be used to protect plants from adult insects. Maintaining healthy plants through proper watering and fertilization can help prevent infestations.",
                "photo": "https://www.azamsharp.com/images/leaf_miners.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly. Aphids are common pests of many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
        ]
        
    },
    {
        "VegetableId": 86,
        "VegetableCode": "035",
        "CatalogId": 2,
        "Name": "Sweet Pepper",
        "Description": "Sweet peppers (Capsicum annuum), also known as bell peppers, are vibrant vegetables that come in a range of colors, including red, yellow, orange, and green. Their crisp texture and sweet flavor make them ideal for raw snacks, salads, stir-fries, and grilling. Packed with vitamins C and A, as well as antioxidants, sweet peppers boost immunity and promote skin and eye health. They thrive in warm climates with full sunlight, making them a garden favorite.",
        "ThumbnailImage": "https://www.azamsharp.com/images/sweetpepper.png",
        "SeedDepth": "1/4 \" (6 mm)",
        "GerminationSoilTemp": "80-85 F (27-29 C)",
        "DaysToGermination": 7,
        "SowIndoors": "8 weeks before frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "5.5 - 7.0",
        "GrowingSoilTemp": "70 - 85 F (21-29 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, onion, parsnip, pea",
        "BadCompanions": "Fennel, kohlrabi",
        "SowingDescription": "When planting peppers make sure that the all the dangers of the frost has passed. If there are implications of frost then you can start indoors. \r",
        "GrowingDescription": "Make sure that the soil is evenly moist. Pepper plants require at least 1.5 inch of water a week. You can conserve the moisture by putting mulch on the top of the soil.",
        "HarvestDescription": "When the pepper has grown to a large size then it is time to harvest. The more you harvest the more peppers will be produced by the plants.",
        "Active": null,
        "Season": "Summer,Spring,Fall,Winter",
        "DaysToHarvestSeeds": 79,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Sweet peppers are rich in vitamin C and antioxidants, boosting immunity and promoting skin health.",
        "Pests": [
            {
                "name": "Pepper Weevils",
                "description": "Pepper weevils (Anthonomus eugenii) are small, dark beetles that infest pepper plants. These pests cause damage by feeding on the buds, flowers, and young fruit of peppers. The adult beetles lay eggs in the flower buds, and when the larvae hatch, they feed on the developing fruit, leading to deformed or rotting peppers.",
                "symptoms": "Infested pepper plants may show signs of deformed or damaged buds, flowers, and fruits. In severe cases, entire crops can be destroyed. You may also see small holes in the buds and premature dropping of the fruit. Larvae may be found inside the fruit, causing further decay.",
                "treatment": "To manage pepper weevil infestations, remove and destroy infected fruit and flowers to reduce the pest population. Use floating row covers to protect plants from adult beetles. Apply neem oil or insecticidal soap to control larvae and adults. Practice crop rotation and remove any plant debris to prevent overwintering of the pest.",
                "photo": "https://www.azamsharp.com/images/pepper_weevils.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the growth of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            }
        ]
        
    },
    {
        "VegetableId": 87,
        "VegetableCode": "036",
        "CatalogId": 2,
        "Name": "Okra",
        "Description": "Okra (Abelmoschus esculentus), also known as lady's fingers, is a warm-season vegetable known for its tender pods and mild flavor. Often used in soups, stews, and fried dishes, okra adds texture and nutrients to meals. It is high in fiber, vitamins C and K, and antioxidants, supporting digestion and bone health. Thriving in warm climates, okra is a resilient crop for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/okra.png",
        "SeedDepth": "3/4\" (19 mm)",
        "GerminationSoilTemp": "80-95 F (27-35 C)",
        "DaysToGermination": 10,
        "SowIndoors": "5 weeks before frost",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-8.0",
        "GrowingSoilTemp": "70-90 F (21-32 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Low",
        "Light": "Full sun",
        "GoodCompanions": "Basil, eggplant, pepper",
        "BadCompanions": "None",
        "SowingDescription": "Okra requires a rich, well drained soil. To get a head start you can also pre-soak the seeds the night before planting. Okra can be planted indoors 6-8 weeks before transplant date. Okra loves heat so make sure that the temperature outside is warm and it is 2 weeks past the last frost date. Okra does really when when the temperature is in the range of 80 F - 90 F. Even at 90 F okra keeps growing. \r",
        "GrowingDescription": "Okra requires rich, organic soil to grow the best. This can be accomplished by adding compost and manure in the soil. Seaweed/fish fertilizer can also be used to provide extra kick. Okra does not require that much water and they do pretty good when watered every 7-10 days. \r",
        "HarvestDescription": "Okra can be picked when the fruits are 2-4 inches long and as wide as your pinkie. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 65,
        "DaysToHarvestSeedlings": 48,
        "HealthBenefits": "Okra is high in fiber and antioxidants, supporting digestion and reducing inflammation.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests on many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which can attract ants and lead to the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce beneficial insects like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of various crops, including tomatoes, potatoes, eggplants, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles create distinctive 'shot-hole' damage, making them a significant pest for young plants.",
                "symptoms": "Infested plants exhibit small, round holes in leaves, giving them a perforated appearance. Severe infestations can stunt plant growth, reduce vigor, and even kill seedlings. The damage may lead to reduced photosynthesis and weakened plants.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as parasitic wasps and tachinid flies to reduce populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and keep the garden free of debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            }
        ]
        
    },
    {
        "VegetableId": 88,
        "VegetableCode": "037",
        "CatalogId": 2,
        "Name": "Oregano",
        "Description": "Oregano (Origanum vulgare) is a fragrant herb with a bold, earthy flavor commonly used in Italian, Greek, and Mediterranean cuisines. It enhances dishes such as pizzas, pastas, and roasted meats. Rich in antioxidants and essential oils, oregano supports immune health and may have antibacterial properties. Thriving in sunny, well-drained soil, oregano is a hardy perennial herb that is easy to grow.",
        "ThumbnailImage": "https://www.azamsharp.com/images/oregano.png",
        "SeedDepth": "Just cover",
        "GerminationSoilTemp": "60 F (16 C)",
        "DaysToGermination": 10,
        "SowIndoors": "8 weeks before frost",
        "SowOutdoors": "2 weeks before frost",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "55-80 F (13-27 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Low",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "Nothing",
        "SowingDescription": "Although oregano is available in the form of seeds most gardeners prefer to purchase in the form of plants so they can get a taste of the vegetable before the crop gets established in the garden. If you do decide to grow from seed then sow it indoors about two months before the last frost. ",
        "GrowingDescription": "When the seedlings are growing transplant them into the garden. Space plant about a foot (30 cm) apart. For excellent flavor do not fertilize, do not over water and harvest before the plants flower. ",
        "HarvestDescription": "You can harvest the leaves as soon as they are large enough to use. ",
        "Active": null,
        "Season": "Spring,Fall",
        "DaysToHarvestSeeds": 115,
        "DaysToHarvestSeedlings": 100,
        "HealthBenefits": "Oregano is rich in antioxidants and essential oils, supporting immune health, reducing inflammation, and promoting digestive well-being.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They can be green, yellow, black, red, or brown, and reproduce rapidly, often forming large colonies. Aphids are a common pest on many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth, sticky honeydew on foliage, which can attract ants, and the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "To manage aphid infestations, encourage natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Spider Mites",
                "description": "Spider mites are tiny arachnids that feed on plant sap, causing damage by piercing the plant cells with their sharp mouthparts. They thrive in hot, dry conditions and can infest a variety of plants, including vegetables, fruits, and ornamental plants. Spider mites are often difficult to spot because of their small size, but the damage they cause is noticeable.",
                "symptoms": "Infested plants may show stippling or speckled discoloration on leaves, followed by yellowing and eventual leaf drop. You may also notice fine webbing on the undersides of leaves and stems. In severe infestations, plant growth is stunted, and plants can die prematurely.",
                "treatment": "To manage spider mites, wash off the mites with a strong stream of water. Apply miticides or insecticidal soaps that are labeled for spider mites. Introduce natural predators, such as predatory mites and ladybugs, to help control the population. Maintain optimal humidity and watering, as spider mites thrive in dry conditions. Regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/spider_mites.png"
            }
        ]
        
    },
    {
        "VegetableId": 89,
        "VegetableCode": "038",
        "CatalogId": 13,
        "Name": "Strawberry",
        "Description": "Strawberries (Fragaria × ananassa) are sweet, juicy berries known for their vibrant red color and refreshing flavor. They can be enjoyed fresh, in desserts, or as a topping for cereals and salads. Rich in vitamin C, fiber, and antioxidants, strawberries support heart health, skin health, and immunity. Thriving in sunny conditions with fertile soil, strawberries are a popular and rewarding crop for home gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/strawberry.png",
        "SeedDepth": "1/8-1/4\"  (3-6 mm)",
        "GerminationSoilTemp": "65-75 F (18-24 C)",
        "DaysToGermination": 10,
        "SowIndoors": "Early spring or fall",
        "SowOutdoors": "Not recommended",
        "PhRange": "5.5-7.0",
        "GrowingSoilTemp": "60-80 F (16-27 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Melons",
        "BadCompanions": "Broccoli",
        "SowingDescription": "Plant strawberries as soon as the ground can be worked in spring. This usually falls between the month of March and April. If the soil is wet then wait until it dries. ",
        "GrowingDescription": "Plant the strawberries in the soil so that the roots are inside the soil and the remainder of the plant is visible above the ground. Within 3-5 weeks you will see more plants growing on the sides of your strawberry plant. \r",
        "HarvestDescription": "Strawberries can be harvested when they have turned a strong, bright, deep reddish purple color.",
        "Active": null,
        "Season": "Spring",
        "DaysToHarvestSeeds": 70,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Strawberries are rich in vitamin C, antioxidants, and dietary fiber, supporting immune health, promoting heart health, and improving skin vitality.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors, such as green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are common pests of many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth, sticky honeydew on foliage, which can attract ants and lead to the growth of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce natural predators like ladybugs, lacewings, and parasitic wasps to naturally control aphid populations. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Spider Mites",
                "description": "Spider mites are tiny arachnids that feed on plant sap, causing damage by piercing the plant cells with their sharp mouthparts. They thrive in hot, dry conditions and can infest a wide variety of plants, including vegetables, fruits, and ornamental plants. Spider mites are often difficult to detect due to their small size, but the damage they cause is noticeable.",
                "symptoms": "Infested plants may show stippling or speckled discoloration on leaves, followed by yellowing and eventual leaf drop. You may also notice fine webbing on the undersides of leaves and stems. In severe infestations, plant growth is stunted, and plants can die prematurely.",
                "treatment": "To manage spider mites, wash off the mites with a strong stream of water. Apply miticides or insecticidal soaps that are labeled for spider mites. Introduce natural predators, such as predatory mites and ladybugs, to help control the population. Maintain optimal humidity and watering conditions, as spider mites thrive in dry environments. Regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/spider_mites.png"
            }
        ]
        
    },
    {
        "VegetableId": 90,
        "VegetableCode": "039",
        "CatalogId": 2,
        "Name": "Summer Squash",
        "Description": "Summer squash (Cucurbita pepo) includes a variety of tender, mild-flavored vegetables such as zucchini and yellow squash. These versatile vegetables can be grilled, roasted, sautéed, or used in soups and salads. Packed with vitamins A and C, fiber, and antioxidants, summer squash supports digestion and overall health. Thriving in warm climates, summer squash is a high-yielding crop that is easy to grow.",
        "ThumbnailImage": "https://www.azamsharp.com/images/summersquash.png",
        "SeedDepth": "1/2-1\" (1.2 - 2.5 cm)",
        "GerminationSoilTemp": "70-95 F (21-35 C)",
        "DaysToGermination": 8,
        "SowIndoors": "3-4 weeks before frost",
        "SowOutdoors": "70 F soil temperature",
        "PhRange": "6.0-6.5",
        "GrowingSoilTemp": "65-75 F (18-24 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Heavy and even",
        "Light": "Full sun",
        "GoodCompanions": "Celery, corn, onion, raddish",
        "BadCompanions": "Potato",
        "SowingDescription": "As the name implies summer squashes love the summer weather. In fall make sure to prepare the site for summer squashes. Place compost and leaves in the worked soil. In spring make sure the soil is warm for transplanting. You can keep the soil warm by covering it with plastic throughout the fall weather. \r",
        "GrowingDescription": "When the temperature falls below 65 F make sure to cover the plants. The covering will also ensure that the plant is protected against the insects and weeds. ",
        "HarvestDescription": "Make sure to pick squash when they are young and small. The most squash you pick the more the plant will product. You can start picking the squash when they are 4-5 inches tall. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 36,
        "HealthBenefits": "Summer squash is low in calories and high in vitamins A, C, and potassium, supporting eye health, boosting immunity, and promoting healthy digestion.",
        "Pests": []
    },
    {
        "VegetableId": 91,
        "VegetableCode": "040",
        "CatalogId": 2,
        "Name": "Winter Squash",
        "Description": "Winter squash (Cucurbita maxima and Cucurbita moschata) includes hearty varieties such as butternut, acorn, and spaghetti squash. Known for their sweet, nutty flavors and firm textures, winter squash is ideal for roasting, soups, and casseroles. Rich in vitamins A and C, potassium, and fiber, they support immunity and heart health. Thriving in warm climates, winter squash is a long-lasting crop often harvested in late autumn.",
        "ThumbnailImage": "https://www.azamsharp.com/images/wintersquash.png",
        "SeedDepth": "1/2-1\" (1.3-2.5 cm)",
        "GerminationSoilTemp": "70-90 F (21-32 C)",
        "DaysToGermination": 8,
        "SowIndoors": "3-4 weeks before frost",
        "SowOutdoors": "70 F soil temperature",
        "PhRange": "5.5-6.5",
        "GrowingSoilTemp": "65-75 F (18-24 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Heavy and even",
        "Light": "Full sun",
        "GoodCompanions": "Celery, corn, onion, radish",
        "BadCompanions": "Potato",
        "SowingDescription": "Winter squash can be performed in winter hence the name. Make sure that the danger of frost is over when planting winter squash. Just like summer squash winter squash needs a well drained soil. Make sure the soil is rich, this can be accomplished by adding compost and fertilizer to the soil. \r",
        "GrowingDescription": "Create small hills of soil and then plant the seeds into the hills. Once the plants are growing to few inches in height separate them out and plant to three plants per hill and put the plants three feet apart. ",
        "HarvestDescription": "Winter squash can last a long time indoors when placed in a dry, cool place. The technique to make sure that if the squash is ready to harvest is to tap the squash. It is sounds hollow then it means it is ready for harvest. ",
        "Active": null,
        "Season": "Fall",
        "DaysToHarvestSeeds": 80,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Winter squash is rich in beta-carotene, fiber, and vitamin C, supporting eye health, boosting immunity, and improving digestion.",
        "Pests": []
    },
    {
        "VegetableId": 92,
        "VegetableCode": "041",
        "CatalogId": 3,
        "Name": "Peas",
        "Description": "Peas (Pisum sativum) are sweet, tender legumes that grow in pods and are enjoyed fresh, steamed, or added to soups and salads. High in protein, fiber, and vitamins A and K, peas support digestion, bone health, and overall vitality. Thriving in cool climates and well-drained soil, peas are a rewarding crop for gardeners.",
        "ThumbnailImage": "https://www.azamsharp.com/images/greenpeas.png",
        "SeedDepth": "1\" (2.5 cm)",
        "GerminationSoilTemp": "40-75 F (4-24 C)",
        "DaysToGermination": 14,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Late summer or fall",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "1\" (2.5 cm)",
        "Watering": "Moderate then low",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, celery, chicory, corn",
        "BadCompanions": "Onion",
        "SowingDescription": "You can start planting peas as soon as the ground can be worked but peas actually germinate much more slowly in cold soil. Instead of planting early make sure that the soil is warm enough and the seeds spends less time in the ground.  ",
        "GrowingDescription": "Although peas get nitrogen right from the air but it takes a few weeks for this to happen. In the meanwhile make sure that the soil is well fertilized with organic matter and fertilizer. ",
        "HarvestDescription": "When picking up peas timing is everything. If you pick them at the right time then they are sweet but they turn starchy if you do not. \r",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 43,
        "HealthBenefits": "Peas are a good source of protein, fiber, and vitamins A, C, and K, promoting healthy digestion, supporting immunity, and improving bone health.",
        "Pests": []
    },
    {
        "VegetableId": 93,
        "VegetableCode": "042",
        "CatalogId": 3,
        "Name": "Kale",
        "Description": "Kale (Brassica oleracea) is a leafy green vegetable known for its slightly bitter flavor and hardy texture. It can be eaten raw in salads, cooked in soups, or baked into chips. Packed with vitamins A, C, and K, as well as antioxidants and fiber, kale supports immunity, digestion, and bone health. Thriving in cool climates, kale is a resilient and nutritious addition to any garden.",
        "ThumbnailImage": "https://www.azamsharp.com/images/kale.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "45-95 F (7-35 C)",
        "DaysToGermination": 7,
        "SowIndoors": "6 weeks before frost",
        "SowOutdoors": "Spring or Fall",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "16\" (40 cm)",
        "Watering": "Heavy",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, beet, celery",
        "BadCompanions": "Pole bean, tomato",
        "SowingDescription": "Kale requires a well fertilized soil so make sure to enrich the soil with compost at least a month before sowing. Kale loves cool, moist soil so be sure to keep the soil well watered from germination through the growing season. ",
        "GrowingDescription": "Kales is heavy feeder so make sure to fertilize the plant with organic fertilizer. You can also use the fish fertilizer which gives an extra kick. Also, make sure to keep all the weeds away from the kale plant.",
        "HarvestDescription": "You can start harvesting kale leaves as soon as they are large enough to be used in a salad. Use knife or scissors to cut the plant an inch above the ground. Kale leaves when stored in refrigerator are good for two weeks to about a month.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 45,
        "DaysToHarvestSeedlings": 30,
        "HealthBenefits": "Kale is packed with vitamins A, C, and K, as well as antioxidants and fiber, supporting bone health, boosting immunity, and reducing inflammation.",
        "Pests": []
    },
    {
        "VegetableId": 94,
        "VegetableCode": "043",
        "CatalogId": 4,
        "Name": "Cabbage",
        "Description": "Cabbage (Brassica oleracea) is a compact leafy vegetable with a mild, slightly sweet flavor. It is used in salads, slaws, stir-fries, and fermented into sauerkraut. Rich in vitamins C and K, as well as antioxidants, cabbage promotes heart health and supports digestion. Thriving in cool climates, cabbage is a high-yield crop suitable for diverse culinary uses.",
        "ThumbnailImage": "https://www.azamsharp.com/images/cabbage.png",
        "SeedDepth": "1/4\" (6mm)",
        "GerminationSoilTemp": "75-85 F (24-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "5 weeks before frost",
        "SowOutdoors": "9 weeks before frost",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Heavy",
        "Light": "Full sun",
        "GoodCompanions": "Bush bean, beet, carrot",
        "BadCompanions": "Pole bean, strawberry, tomato",
        "SowingDescription": "Cabbage grows well when planted 12-24 inches apart. The distance between the cabbages allow them to fully form the head. The cabbage seeds should be planted 1/4 to 1/2 inch deep. Cabbage loves moist soil so make sure the soil is moist throughout the germination period.  ",
        "GrowingDescription": "Make sure you fertilize your plants when growing cabbage, especially after transplanting. Then add nitrogen as well when the cabbage is half grown. This helps them mature better. Make sure the soil is moist throughout the growing season so your cabbage produces better heads.",
        "HarvestDescription": "Cabbages are ready to harvest when their head is fully formed.\r",
        "Active": null,
        "Season": "Spring,Summer,Fall,Winter",
        "DaysToHarvestSeeds": 75,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Cabbage is rich in vitamins C and K, fiber, and antioxidants, supporting digestion, boosting immunity, and promoting heart health.",
        "Pests": []
    },
    {
        "VegetableId": 95,
        "VegetableCode": "044",
        "CatalogId": 4,
        "Name": "Melons",
        "Description": "Melons (Cucumis melo) are sweet, juicy fruits that include varieties such as cantaloupe and honeydew. Known for their refreshing flavor, melons are enjoyed fresh, in salads, or as a dessert. They are rich in vitamins A and C, promoting hydration, skin health, and immunity. Thriving in warm climates, melons are a rewarding crop for gardeners seeking a taste of summer.",
        "ThumbnailImage": "https://www.azamsharp.com/images/melons.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "80-90 F (27-32 C)",
        "DaysToGermination": 4,
        "SowIndoors": "3 weeks before frost",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "70-85 F (21-29 C)",
        "SpacingBeds": "16\" (40 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Corn",
        "BadCompanions": "Potato",
        "SowingDescription": "You can start melons indoor with seeds three weeks before the last frost. Seeds can be grown in 3 inch pots. Melon seeds require a steady temperature of 80 to 90 F (27 to 32 C). When the leaves start to appear thin to one plant per pot. Lower the temperature to 65 - 70 F (18-21 C). Also, make sure to reduce the watering to one week.",
        "GrowingDescription": "Melons need moderately hot soil to grow. Make sure that the soil temperature is at least 70 F before transplanting. Plant melons 16-18 inches apart of each other. Be extremely careful when transplanting. Melons like to be treated with comfort and requires extra attention. To keep the soil warm you can use row covers on top of your soil. The cover will also work as a barrier against pests. When the plant begin to bloom remove the row covers. ",
        "HarvestDescription": "To pick out the perfect melon it requires practice and experience. Usually, when one melon plant is ripe it is an indication that other melon plants are not far behind. Melons are ripe when their rind changes from gray-green to yellow. \r",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 90,
        "DaysToHarvestSeedlings": 75,
        "HealthBenefits": "Melons are hydrating and rich in vitamins A and C, supporting skin health, boosting immunity, and promoting hydration.",
        "Pests": []
    },
    {
        "VegetableId": 96,
        "VegetableCode": "045",
        "CatalogId": 4,
        "Name": "Zucchini",
        "Description": "Zucchini (Cucurbita pepo) is a versatile summer squash known for its mild flavor and tender texture. It can be grilled, roasted, baked, or spiralized into noodles. Rich in vitamins C and A, as well as fiber, zucchini supports digestion and overall health. Thriving in warm, sunny conditions, zucchini is a high-yield crop that is easy to grow.",
        "ThumbnailImage": "https://www.azamsharp.com/images/zucchini.png",
        "SeedDepth": "1/2\" (1.3-2.5 cm)",
        "GerminationSoilTemp": "70-95 F",
        "DaysToGermination": 8,
        "SowIndoors": "3 weeks before frost",
        "SowOutdoors": "70 F temperature",
        "PhRange": "6.0-6.5",
        "GrowingSoilTemp": "65-75 F (18-24 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Heavy",
        "Light": "Full sun",
        "GoodCompanions": "Celery, corn, radish",
        "BadCompanions": "Potato",
        "SowingDescription": "Zucchini prefers well-drained, fertile, loose soil which is rich in organic matter. The soil needs to be moist for the zucchini seeds to develop into seedlings. Zucchini like warm soil and are very sensitive to frost. So make sure that there is no danger of frost and the soil temperature is about 70 F. Sow the seed 1/2 to 1 inch deep into the hills. Sow 4 to 5 seeds per hill and make sure the hills are 3 to 4 feet apart. ",
        "GrowingDescription": "Zucchini loves warm soil so make sure to conserve the heat by putting mulch on top of the soil. You can also use row covers to heat the soil. Row covers will also make sure that the plant is free from any pests. ",
        "HarvestDescription": "Zucchini grows very quickly after it blooms so make sure to check your garden every day. The more you pick the more it will produce. Zucchini can be harvested when it is 6 inches long and 2 inches in diameter. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 50,
        "DaysToHarvestSeedlings": 38,
        "HealthBenefits": "Zucchini is low in calories and high in vitamins A and C, supporting eye health, boosting immunity, and aiding digestion.",
        "Pests": []
    },
    {
        "VegetableId": 97,
        "VegetableCode": "046",
        "CatalogId": 13,
        "Name": "Sunflowers",
        "Description": "Sunflowers (Helianthus annuus) are tall, vibrant plants known for their large yellow blooms and edible seeds. Sunflower seeds are rich in healthy fats, vitamin E, and magnesium, supporting heart health and reducing inflammation. Thriving in sunny, well-drained conditions, sunflowers are a beautiful and functional addition to gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/sunflower.png",
        "SeedDepth": "1/8-1/4\" (3-6 cm)",
        "GerminationSoilTemp": "65-75 F (18-24 C)",
        "DaysToGermination": 10,
        "SowIndoors": "8 weeks before spring",
        "SowOutdoors": "Not recommended",
        "PhRange": "5.5-7.0",
        "GrowingSoilTemp": "60-80 F (16-27 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Melons",
        "BadCompanions": "Broccoli",
        "SowingDescription": "Sunflower seeds can be grown in spring when the danger of frost is past. Like corn sunflower seeds perform best when planted in hills in rows. ",
        "GrowingDescription": "See harvesting",
        "HarvestDescription": "Sunflowers generally take from three to four months to produce seeds. The seed becomes ripe when the back of the seed head turns from green to brown. At that point you can cut the head from the stalk and put it in a warm dry room for about 7 days until the hulls are dry and hard. ",
        "Active": null,
        "Season": "Spring,Summer",
        "DaysToHarvestSeeds": 75,
        "DaysToHarvestSeedlings": 110,
        "HealthBenefits": "Sunflower seeds are rich in healthy fats, protein, and vitamin E, supporting heart health, improving skin vitality, and boosting immunity.",
        "Pests": []
    },
    {
        "VegetableId": 98,
        "VegetableCode": "047",
        "CatalogId": 6,
        "Name": "Raspberry",
        "Description": "Raspberries (Rubus idaeus) are sweet, tart berries enjoyed fresh, in desserts, or as jams and preserves. They are rich in fiber, vitamins C and K, and antioxidants, supporting heart health, digestion, and overall wellness. Thriving in sunny locations with fertile soil, raspberries are a rewarding crop for fruit enthusiasts.",
        "ThumbnailImage": "https://www.azamsharp.com/images/raspberry.png",
        "SeedDepth": "1/4 \"",
        "GerminationSoilTemp": "75 F",
        "DaysToGermination": 30,
        "SowIndoors": "Late summer",
        "SowOutdoors": "Fall",
        "PhRange": "5.6 - 6.2",
        "GrowingSoilTemp": "70 F ",
        "SpacingBeds": "6 feet apart",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Turnip, yarrow, garlic",
        "BadCompanions": "Blackberry, potato",
        "SowingDescription": "Raspberry planting site should be chosen carefully. Raspberries perform best in full sunlight and well-drained soil. In order to get best results make sure that the soil contains organic matter. Make sure your plant is 500 feet away from wild raspberry and blackberry to reduce the possibility of virus diseases. ",
        "GrowingDescription": "Make sure that the raspberry site is free of weeds and the plant gets one to two inches of water a week for best growth. Mulch and organic matter can be used to conserve moisture in the soil.                       \r",
        "HarvestDescription": "Raspberries are ready for harvesting when they can easily be separated from the core. Raspberry should be harvested frequently. The more you harvest the more fruit it will generate. After harvesting raspberries should be stored at 33 F temperature as soon as possible. ",
        "Active": null,
        "Season": "Fall,Winter",
        "DaysToHarvestSeeds": 210,
        "DaysToHarvestSeedlings": 180,
        "HealthBenefits": "Raspberries are rich in antioxidants, fiber, and vitamin C, supporting heart health, boosting immunity, and promoting healthy digestion.",
        "Pests": []
    },
    {
        "VegetableId": 99,
        "VegetableCode": "048",
        "CatalogId": 10,
        "Name": "Turnip",
        "Description": "Turnips (Brassica rapa) are root vegetables with a mild, slightly sweet flavor and a crisp texture. Both the roots and leafy greens are edible, making them a versatile crop. Turnips are rich in vitamins C and K, fiber, and antioxidants, supporting immunity and digestion. Thriving in cool climates, turnips are easy to grow and suitable for diverse culinary uses.",
        "ThumbnailImage": "https://www.azamsharp.com/images/turnip.png",
        "SeedDepth": "1/4-1/2\" (6-13 mm)",
        "GerminationSoilTemp": "50-95 F (10-35 C)",
        "DaysToGermination": 4,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Spring to midsummer",
        "PhRange": "5.5-6.8",
        "GrowingSoilTemp": "40-75 F (4-24 C)",
        "SpacingBeds": "4\" (10 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Onion, peas",
        "BadCompanions": "Potato",
        "SowingDescription": "Turnips are fond of cool weather so they are an excellent vegetable for the spring season. Remarkably turnips perform best when planted with peas.  ",
        "GrowingDescription": "Turnips have large root system which need deep, loose soil with lots of organic matter. Turnips are not thirsty vegetables and require only moderate amount of water.",
        "HarvestDescription": "You can start harvesting turnips when they are young but be careful of not taking many as this will slow down the root growth. Roots can be harvested when they are between 1 inches and 3 inches in diameter. ",
        "Active": null,
        "Season": "Spring,Summer,Fall,Winter",
        "DaysToHarvestSeeds": 56,
        "DaysToHarvestSeedlings": 40,
        "HealthBenefits": "Turnips are rich in fiber, vitamins C and K, and antioxidants, supporting digestion, boosting immunity, and promoting bone health.",
        "Pests": []
    },
    {
        "VegetableId": 100,
        "VegetableCode": "049",
        "CatalogId": 15,
        "Name": "Marjoram",
        "Description": "Marjoram (Origanum majorana) is a fragrant herb with a sweet, delicate flavor often used to season meats, soups, and sauces. It is rich in antioxidants and essential oils, supporting digestion and boosting immunity. Thriving in sunny, well-drained conditions, marjoram is a popular choice for culinary herb gardens.",
        "ThumbnailImage": "https://www.azamsharp.com/images/marjoram.png",
        "SeedDepth": "Just cover",
        "GerminationSoilTemp": "60 F (16 C)",
        "DaysToGermination": 12,
        "SowIndoors": "4 weeks before frost",
        "SowOutdoors": "After last frost",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "55-80 F (13-27 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "Nothing",
        "SowingDescription": "Marjoram prefers a slightly acidic soil to slightly alkaline soil. Good companions include the vegetables from the cabbage family. These include broccoli and brussels sprouts. Marjoram likes hot weather and does not do well in cold weather specially in frost. To keep the moisture in the soil be sure to cover the soil with mulch. ",
        "GrowingDescription": "Same as sowing.",
        "HarvestDescription": "Marjoram can be harvested when the leaves are 4-6 inches tall. You can either pick out individual leaves or snip the entire stem for drying and storage. Marjoram can also be dried and stored in the jar for later use. ",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 115,
        "DaysToHarvestSeedlings": 95,
        "HealthBenefits": "Marjoram is rich in antioxidants and essential oils, supporting digestive health, reducing inflammation, and promoting a healthy immune system.",
        "Pests": []
    },
    {
        "VegetableId": 101,
        "VegetableCode": "050",
        "CatalogId": 16,
        "Name": "Pumpkin",
        "Description": "Pumpkin is Pumpkin differs from summer squash in that it is harvested and eaten in the mature fruit stage, when the seeds within have matured fully and the skin has hardened into a tough rind.",
        "ThumbnailImage": "https://www.azamsharp.com/images/pumpkin.png",
        "SeedDepth": "1/2-1\" (1.3-2.5 cm)",
        "GerminationSoilTemp": "70-90 F (21-32 C)",
        "DaysToGermination": 8,
        "SowIndoors": "3-4 weeks before frost",
        "SowOutdoors": "70 F soil temperature",
        "PhRange": "5.5-6.5",
        "GrowingSoilTemp": "65-75 F (18-24 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Heavy and even",
        "Light": "Full sun",
        "GoodCompanions": "Celery, corn, onion, radish",
        "BadCompanions": "Potato",
        "SowingDescription": "Make sure that the danger of frost is over when planting winter squash. Just like summer squash pumpkins needs a well drained soil. Make sure the soil is rich, this can be accomplished by adding compost and fertilizer to the soil.",
        "GrowingDescription": "Create small hills of soil and then plant the seeds into the hills. Once the plants are growing to few inches in height separate them out and plant to three plants per hill and put the plants three feet apart.",
        "HarvestDescription": "Pumpkin can last a long time indoors when placed in a dry, cool place. The technique to make sure that if the pumpkin is ready to harvest is to tap it. It is sounds hollow then it means it is ready for harvest.",
        "Active": null,
        "Season": "Fall",
        "DaysToHarvestSeeds": 80,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Pumpkin is rich in beta-carotene, fiber, and vitamin A, supporting eye health, boosting immunity, and promoting healthy digestion.",
        "Pests": []
    },
    {
        "VegetableId": 102,
        "VegetableCode": "051",
        "CatalogId": 18,
        "Name": "Parsnips",
        "Description": "Parsnips is The parsnip is a root vegetable closely related to the carrot.",
        "ThumbnailImage": "https://www.azamsharp.com/images/parsnips.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "65-75 F (18-24 C)",
        "DaysToGermination": 13,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "On worked soil",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "4\" (10 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Green beans, garlic, onion, peas, hot pepper, potato, radish",
        "BadCompanions": "Carrot, celery",
        "SowingDescription": "Parsnips as compared to carrots takes longer. Parsnips seeds should be planted 1/2 inch deep and 1 inch apart in rows. Parsnips loves moist soil so make sure that the soil is moist. You can keep the moisture in the soil by applying mulch. ",
        "GrowingDescription": "See sowing description.",
        "HarvestDescription": "Parsnips can be harvested at the end of the growing season. Usually it takes around 16 weeks for parsnips to reach maturity. The frost gives a sweet flavor to parsnips. When leaving them in ground for winter make sure to cover them up with mulch.\r",
        "Active": null,
        "Season": "spring, summer, fall, winter",
        "DaysToHarvestSeeds": 90,
        "DaysToHarvestSeedlings": 75,
        "HealthBenefits": "Parsnips are high in fiber, vitamins C and K, and antioxidants, supporting digestion, boosting immunity, and promoting heart health.",
        "Pests": []
    },
    {
        "VegetableId": 103,
        "VegetableCode": "052",
        "CatalogId": 19,
        "Name": "Thyme",
        "Description": "Thyme is Thyme is one of the best herbs for making delicious service.",
        "ThumbnailImage": "https://www.azamsharp.com/images/thyme.png",
        "SeedDepth": "1/4 \" - 1/2\"",
        "GerminationSoilTemp": "55-65 F (13-18 C)",
        "DaysToGermination": 8,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "65-85 F (10-24 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Tomato",
        "BadCompanions": "Fennel",
        "SowingDescription": "Thyme seeds are slow and they germinate uneven. Most people just buy a small thyme plant instead of using seeds. Thyme requires a well drained soil. It can grow up to 6-12 inches in height.\r",
        "GrowingDescription": "See sowing",
        "HarvestDescription": "Thyme leaves can be harvested at any time in summer. You can dry the leaves by putting them on the tray. Once, dried you can store them in a container.",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 115,
        "DaysToHarvestSeedlings": 95,
        "HealthBenefits": "Thyme is rich in antioxidants and vitamin C, supporting immune health, improving respiratory function, and reducing inflammation.",
        "Pests": []
    },
    {
        "VegetableId": 104,
        "VegetableCode": "053",
        "CatalogId": 20,
        "Name": "Jalapeno",
        "Description": "Jalapeno is The jalapeño is a medium-sized chili pepper.",
        "ThumbnailImage": "https://www.azamsharp.com/images/jalapeno.png",
        "SeedDepth": "1/4 \" (6 mm)",
        "GerminationSoilTemp": "80-85 F (27-29 C)",
        "DaysToGermination": 7,
        "SowIndoors": "8 weeks before frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "5.5 - 7.0",
        "GrowingSoilTemp": "70 - 85 F (21-29 C)",
        "SpacingBeds": "12\" (30 cm)",
        "Watering": "Moderate and even",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, onion, parsnip, pea",
        "BadCompanions": "Fennel, kohlrabi",
        "SowingDescription": "When planting peppers make sure that the all the dangers of the frost has passed. If there are implications of frost then you can start indoors. \r",
        "GrowingDescription": "Make sure that the soil is evenly moist. Pepper plants require at least 1.5 inch of water a week. You can conserve the moisture by putting mulch on the top of the soil.",
        "HarvestDescription": "When the pepper has grown to a large size then it is time to harvest. The more you harvest the more peppers will be produced by the plants.",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 85,
        "DaysToHarvestSeedlings": 64,
        "HealthBenefits": "Jalapenos are rich in capsaicin, vitamin C, and antioxidants, boosting metabolism, supporting immunity, and reducing inflammation.",
        "Pests": []
    },
    {
        "VegetableId": 105,
        "VegetableCode": "054",
        "CatalogId": 20,
        "Name": "Rosemary",
        "Description": "Rosemary is Rosemary is a woody, perennial herb with fragrant, evergreen, needle-like leaves and white, pink, purple, or blue flowers, native to the Mediterranean region.",
        "ThumbnailImage": "https://www.azamsharp.com/images/rosemary.png",
        "SeedDepth": "1-2\" ",
        "GerminationSoilTemp": "60-70 F",
        "DaysToGermination": 25,
        "SowIndoors": "4 weeks before last frost",
        "SowOutdoors": "After last frost",
        "PhRange": "4.5-8.7",
        "GrowingSoilTemp": "65 - 75 F",
        "SpacingBeds": "3\"",
        "Watering": "Average",
        "Light": "Full sun",
        "GoodCompanions": "Cabbage, green beans, carrot",
        "BadCompanions": "None",
        "SowingDescription": "Rosemary seeds can be started indoors four to six weeks before the last frost. Make sure to transplant them 2 weeks after the last frost. Rosemary does best in full sun and well drained soil.",
        "GrowingDescription": "You can start harvesting rosemary from stem. The more you harvest the quickly it will grow again for future harvesting. ",
        "HarvestDescription": "See growing",
        "Active": null,
        "Season": "Spring, fall",
        "DaysToHarvestSeeds": 100,
        "DaysToHarvestSeedlings": 85,
        "HealthBenefits": "Rosemary is rich in antioxidants and anti-inflammatory compounds, supporting memory, boosting immunity, and promoting digestion.",
        "Pests": []
    },
    {
        "VegetableId": 106,
        "VegetableCode": "055",
        "CatalogId": 20,
        "Name": "Savory",
        "Description": "Winter savory (Satureja montana) is a perennial herb native to the warm temperate regions of southern Europe. Known for its robust, peppery flavor, winter savory is a versatile culinary herb often used to season meats, beans, soups, and stuffing. It features small, dark green leaves and produces delicate white or pale lavender flowers, which can add visual appeal to gardens and dishes alike. In addition to its culinary uses, winter savory has been valued for its medicinal properties, including its potential to aid digestion and reduce inflammation. This hardy herb thrives in well-drained soil and full sunlight, making it an excellent choice for rock gardens, herb beds, or container planting.",
        "ThumbnailImage": "https://www.azamsharp.com/images/savory.png",
        "SeedDepth": "1/8 \"",
        "GerminationSoilTemp": "70 - 85 F",
        "DaysToGermination": 14,
        "SowIndoors": "7 weeks before transplanting",
        "SowOutdoors": "After last frost ",
        "PhRange": "6-7",
        "GrowingSoilTemp": "50-70",
        "SpacingBeds": "10-12\"",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "None",
        "SowingDescription": "In spring sow seeds 1/8 inches deep in dry, well-drained soil. ",
        "GrowingDescription": "Seeds should be sowed once the soil has warmed up. Place the seeds 10-12 inches apart. Cuttings can also be used in late spring. Tips from the new shoots can be cut and places in small pots. When you see roots forming transplant them in the garden.",
        "HarvestDescription": "Savory can be harvest fresh as need. The great thing about winter savory is that it can be harvested throughout the year. For the regions where the growing season is long you can cut back the savory at the beginning of spring.",
        "Active": null,
        "Season": "Spring,summer,fall,winter",
        "DaysToHarvestSeeds": 75,
        "DaysToHarvestSeedlings": 65,
        "HealthBenefits": "Savory contains antioxidants and has antimicrobial properties, supporting digestive health and reducing inflammation.",
        "Pests": []
    },
    {
        "VegetableId": 107,
        "VegetableCode": "056",
        "CatalogId": 21,
        "Name": "Chives",
        "Description": "Chives are the smallest species of edible onions, scientifically known as Allium schoenoprasum. They are perennial plants that grow in clusters of slender, green, hollow stems. Renowned for their mild, onion-like flavor with subtle hints of garlic, chives are a popular herb in culinary applications, often used fresh to garnish or enhance the taste of soups, salads, omelets, and sauces. In addition to their culinary value, chives are rich in vitamins A and C, and contain antioxidants that support overall health. Their vibrant purple flowers are also edible and can add a decorative touch to dishes. Easy to grow in gardens or pots, chives thrive in well-drained soil and full sunlight, making them a favorite among both home gardeners and professional chefs.",
        "ThumbnailImage": "https://www.azamsharp.com/images/chives.png",
        "SeedDepth": "Just cover",
        "GerminationSoilTemp": "60-85 F (16 - 29 C)",
        "DaysToGermination": 10,
        "SowIndoors": "Spring",
        "SowOutdoors": "Spring or fall",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "55-70 F (13-21 C)",
        "SpacingBeds": "6-8 \"",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, tomato",
        "BadCompanions": "Green beans, peas",
        "SowingDescription": "Sow plants in soil with compost or rotted manure. Chives also make a very nice edging for your flower garden.",
        "GrowingDescription": "Chives are slow to grow. If grown from seeds it takes chives around 1 year to reach the maturity. That is why most people prefer growing chives from plants rather than seeds. ",
        "HarvestDescription": "Chive leaves can be harvested whenever the leaves are large. You can pick out individual leaves. Chives can be used in fresh in salads. ",
        "Active": null,
        "Season": "Spring, fall",
        "DaysToHarvestSeeds": 140,
        "DaysToHarvestSeedlings": 100,
        "HealthBenefits": "Chives are rich in vitamins A and C, supporting eye health, boosting immunity, and aiding digestion.",
        "Pests": []
    },
    {
        "VegetableId": 108,
        "VegetableCode": "057",
        "CatalogId": 21,
        "Name": "Sage",
        "Description": "Sage is Sage is a perennial, evergreen shrub, with woody stems, grayish leaves, and blue to purplish flowers.",
        "ThumbnailImage": "https://www.azamsharp.com/images/sage.png",
        "SeedDepth": "Light cover",
        "GerminationSoilTemp": "65 - 70 F (18-21 C)",
        "DaysToGermination": 16,
        "SowIndoors": "7 weeks before last frost",
        "SowOutdoors": "Not recommended",
        "PhRange": "5.5 - 7.0",
        "GrowingSoilTemp": "55-80 F (13 - 27 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Light",
        "Light": "Full sun",
        "GoodCompanions": "Broccoli, cabbage, carrot, cauliflower, kale",
        "BadCompanions": "Cucumber",
        "SowingDescription": "Sage is usually grown from plants instead of the seeds. Usually sage seeds take a long time to reach maturity and that is why it is recommended to get starter plants. ",
        "GrowingDescription": "Sage does best in cool and warm temperatures. If you live in area where the heat is extreme then it is best to cover the sage plants during the hot months. ",
        "HarvestDescription": "Sage leaves can be harvested anytime of the growing season. Harvest the purple leaves and green leaves and use them in your fresh salad. ",
        "Active": null,
        "Season": "Spring, summer, fall",
        "DaysToHarvestSeeds": 100,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Sage contains antioxidants and compounds that support brain health, reduce inflammation, and improve digestion.",
        "Pests": []
    },
    {
        "VegetableId": 109,
        "VegetableCode": "058",
        "CatalogId": 22,
        "Name": "Red Onion",
        "Description": "Red onions are a versatile and flavorful variety of onion, easily grown in home gardens. Known for their vibrant purple-red skin and mildly sweet flavor, red onions add a pop of color and taste to a variety of dishes. Whether chopped and used raw in salads, salsas, or sandwiches, or cooked to enhance their sweetness in soups, stir-fries, and roasted dishes, red onions are a culinary staple. They thrive in well-drained soil and full sunlight, making them a great choice for gardeners of all skill levels. In addition to their culinary uses, red onions are rich in antioxidants and essential nutrients, contributing to a healthy diet.",
        "ThumbnailImage": "https://www.azamsharp.com/images/redonion.png",
        "SeedDepth": "1/4\"-1/2\" (.65 - 1.3 cm)",
        "GerminationSoilTemp": "65-85F (18-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "2 months before frost",
        "SowOutdoors": "Spring",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "55-75 F (13-24 C)",
        "SpacingBeds": "3-4\" (7.5 - 10 cm)",
        "Watering": "Medium and even",
        "Light": "Full sun",
        "GoodCompanions": "Beet, cabbage family, carrot, spinach",
        "BadCompanions": "Asparagus, bean, pea",
        "SowingDescription": "Onions should be planted in full sun. Make sure to loosen the soil and remove all the rocks. Work hard to make the soil firm. Making the soil firm and loose will allow the onions to grow much better.",
        "GrowingDescription": "When choosing onions set make sure the onions are firm and plump. Dig a small hole only enough so that the tip of the onion is exposed outside.",
        "HarvestDescription": "Harvest the onions in late Spring.",
        "Active": null,
        "Season": "Spring,Fall,Summer,Winter",
        "DaysToHarvestSeeds": 139,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Red onions are rich in antioxidants and flavonoids, supporting heart health and reducing inflammation.",
        "Pests": []
    },
    {
        "VegetableId": 110,
        "VegetableCode": "059",
        "CatalogId": 23,
        "Name": "Lemon Grass",
        "Description": "Lemongrass (Cymbopogon citratus) is a fragrant perennial herb native to India and tropical Asia, widely valued for its citrusy aroma and flavor. It is a staple in many Asian cuisines, particularly in Thai, Vietnamese, and Indian dishes, where it is used to infuse soups, curries, teas, and marinades with its refreshing, lemon-like essence. Lemongrass grows in tall, slender stalks and thrives in warm, sunny climates with well-drained soil. Beyond its culinary uses, lemongrass is also known for its medicinal properties, including its potential to aid digestion, reduce stress, and boost immunity. It is a versatile herb that can be grown in gardens or pots, making it a popular choice for both home cooks and herbalists.",
        "ThumbnailImage": "https://www.azamsharp.com/images/lemongrass.png",
        "SeedDepth": "1/4\"",
        "GerminationSoilTemp": "70 - 75 F",
        "DaysToGermination": 30,
        "SowIndoors": "Recommended",
        "SowOutdoors": "After last frost",
        "PhRange": "5.5 - 7.5",
        "GrowingSoilTemp": "65 - 95 F",
        "SpacingBeds": "3 feet",
        "Watering": "Even",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "None",
        "SowingDescription": "Most gardeners do not start the lemon grass from seeds but instead seedlings. You can even find fresh stalks of lemon grass from a grocery store. Cut 1 or 2 inches from the end of the leaves and put the other end in water. After a while you will notice the roots growing.\r",
        "GrowingDescription": "Lemon grass requires nitrogen to grow so you should fertilize on a monthly schedule. In hot regions make sure to water your plant daily. \r",
        "HarvestDescription": "You can trim the leaves of lemon grass once it reaches a mature height of at least one foot. You can also take out the whole stalks at  ground level. Be extra careful when cutting the stalks. Do not try to break them off or it can damage the rest of the plant.",
        "Active": null,
        "Season": "Spring, summer, fall, winter",
        "DaysToHarvestSeeds": 100,
        "DaysToHarvestSeedlings": 75,
        "HealthBenefits": "Lemongrass has antimicrobial properties and supports digestion, reduces stress, and boosts immunity.",
        "Pests": []
    },
    {
        "VegetableId": 111,
        "VegetableCode": "060",
        "CatalogId": 24,
        "Name": "Bush Beans",
        "Description": "Bush beans are one of the most popular vegetables grown in home gardens, second only to tomatoes. These compact, self-supporting plants are known for their ease of cultivation and high yields, making them an excellent choice for gardeners of all experience levels. Bush beans produce tender, flavorful pods that can be harvested over several weeks, and they are perfect for fresh eating, canning, or freezing. They thrive in full sunlight and well-drained soil, maturing quickly, often within 50-60 days. With their rich source of vitamins, minerals, and dietary fiber, bush beans are both a nutritious and delicious addition to a variety of dishes, from salads and stir-fries to casseroles and side dishes.",
        "ThumbnailImage": "https://www.azamsharp.com/images/bushbean.png",
        "SeedDepth": "1\" (2.5 cm)",
        "GerminationSoilTemp": "40-75 F (4-24 C)",
        "DaysToGermination": 14,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Late summer",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "1\" (2.5 cm)",
        "Watering": "Moderate then low",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, celery, chicory, corn, cucumber, eggplant, parsley, early potato, radish, spinach, turnip",
        "BadCompanions": "Onion, late potato",
        "SowingDescription": "First make sure there is no danger of frost. Frost can easily kill bush beans. Bury 4-6 seeds 2 inches deep from each other in rows. Cover each seed with soil and then water them. When you plant bush beans, you want to water them right away.",
        "GrowingDescription": "Make sure the area is clean and there are no weeds growing. Weeds can steal all nutrients from the green beans and this can result in killing of the bush beans plant. Water your bush beans every day. You can also include a layer of mulch to help control the weeds and make sure that the ground is moist.",
        "HarvestDescription": "You can start harvesting bush beans when they are long and firm. The more bush beans you will pick the more it will produce.",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 50,
        "DaysToHarvestSeedlings": 35,
        "HealthBenefits": "Bush beans are high in fiber, vitamins, and antioxidants, promoting digestion and supporting heart health.",
        "Pests": []
    },
    {
        "VegetableId": 112,
        "VegetableCode": "061",
        "CatalogId": 24,
        "Name": "Pole Beans",
        "Description": "Pole beans are a highly productive and versatile vegetable, often considered magical due to their ability to produce two to three times more pods than bush beans. These climbing plants grow vertically with the help of poles, trellises, or other supports, making them an excellent space-saving option for home gardens. Known for their tender, flavorful pods, pole beans are ideal for fresh eating, cooking, or preserving through canning and freezing. They thrive in full sunlight and well-drained soil, continuing to produce throughout the growing season when regularly harvested. In addition to their abundant yield, pole beans are a rich source of vitamins, minerals, and dietary fiber, making them a nutritious addition to meals such as salads, stir-fries, and soups.",
        "ThumbnailImage": "https://www.azamsharp.com/images/polebeans.png",
        "SeedDepth": "1\" (2.5 cm)",
        "GerminationSoilTemp": "40-75 F (4-24 C)",
        "DaysToGermination": 14,
        "SowIndoors": "Not Recommended",
        "SowOutdoors": "Late summer",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "1\" (2.5 cm)",
        "Watering": "Moderate then low",
        "Light": "Full sun",
        "GoodCompanions": "Carrot, celery, chicory, corn, cucumber, eggplant, parsley, early potato, radish, spinach, turnip",
        "BadCompanions": "Onion, late potato",
        "SowingDescription": "You can start pole beans by seeds. Make sure to start the seeds outside since pole beans seeds are not fond of being transplanted.Germination usually takes two weeks or more. \r",
        "GrowingDescription": "Make sure to weed your pole beans regularly. Weeds take away the essential nutrients from the plants which is essential for the plant growth. Pole beans require water every day so make sure you obey the watering requirements. Add a layer of mulch to contain the moisture in the ground. ",
        "HarvestDescription": "Start harvesting pole beans that are long and firm right away. When you are growing pole beans, they will produce more flowers that will turn into beans if you pick them every day. Do not pick wet beans and be careful not to break stems and branches.",
        "Active": null,
        "Season": "Summer",
        "DaysToHarvestSeeds": 50,
        "DaysToHarvestSeedlings": 35,
        "HealthBenefits": "Pole beans are rich in fiber and vitamins A and C, supporting healthy digestion and boosting immunity.",
        "Pests": []
    },
    {
        "VegetableId": 113,
        "VegetableCode": "062",
        "CatalogId": 25,
        "Name": "Lemon",
        "Description": "The lemon (Citrus limon) is a small evergreen tree native to Asia, renowned for its bright yellow, ellipsoidal fruit. Lemons are prized for their tangy, acidic juice, fragrant zest, and versatile culinary uses, ranging from flavoring beverages and desserts to enhancing savory dishes. The tree thrives in warm, sunny climates and well-drained soil, making it a popular choice for orchards and home gardens alike. Beyond their culinary applications, lemons are a rich source of vitamin C and antioxidants, contributing to a healthy diet. The fruit and its extracts are also widely used in cleaning, aromatherapy, and natural remedies, making lemons one of the most versatile fruits in the world.",
        "ThumbnailImage": "https://www.azamsharp.com/images/lemon.png",
        "SeedDepth": "1/2 inch",
        "GerminationSoilTemp": "70-80 F",
        "DaysToGermination": 35,
        "SowIndoors": "Before winter begins",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "70-80 F",
        "SpacingBeds": "N/A",
        "Watering": "Evenly",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "Nothing",
        "SowingDescription": "You can start the lemon plant indoors in a small pot. Lemon trees can easily be started using the seeds from the lemon you bought from the store. Before planting the seeds in pot make sure to sow them in water for at least 8 hours. This will speed up the germination process. \r",
        "GrowingDescription": "Make sure to keep the soil moist throughout the germination period. If needed you can cover the seeds with a plastic wrap to promote the soil moisture. Lemon seeds needs warm temperature to germinate and it usually takes about three to six weeks to germinate. \r",
        "HarvestDescription": "Harvest the fruit by cutting them off with pruning shears or by pulling the fruit stalk from the tree.",
        "Active": null,
        "Season": "Spring, summer, fall, winter",
        "DaysToHarvestSeeds": 2555,
        "DaysToHarvestSeedlings": 1460,
        "HealthBenefits": "Lemons are high in vitamin C and antioxidants, boosting immunity, supporting skin health, and aiding digestion.",
        "Pests": []
    },
    {
        "VegetableId": 114,
        "VegetableCode": "063",
        "CatalogId": 25,
        "Name": "Lime",
        "Description": "Lime refers to a small citrus fruit, typically round and green, measuring 3–6 cm in diameter. Known for its sour and acidic pulp, lime is a staple in many cuisines around the world, adding a refreshing tartness to beverages, marinades, dressings, and dishes. Limes are rich in vitamin C and antioxidants, making them not only a flavorful but also a nutritious addition to the diet. The lime tree thrives in warm, tropical to subtropical climates, requiring well-drained soil and plenty of sunlight. In addition to its culinary uses, lime juice and zest are commonly used in cleaning products, natural remedies, and aromatherapy for their fresh, invigorating scent and antibacterial properties.",
        "ThumbnailImage": "https://www.azamsharp.com/images/lime.png",
        "SeedDepth": "1/2 inch",
        "GerminationSoilTemp": "70-80 F",
        "DaysToGermination": 35,
        "SowIndoors": "Before winter",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "70-80 F",
        "SpacingBeds": "N/A",
        "Watering": "Evenly",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "Nothing",
        "SowingDescription": "You can start the lime plant indoors in a small pot. lime trees can easily be started using the seeds from the lime you bought from the store. Before planting the seeds in pot make sure to sow them in water for at least 8 hours. This will speed up the germination process. \r",
        "GrowingDescription": "Make sure to keep the soil moist throughout the germination period. If needed you can cover the seeds with a plastic wrap to promote the soil moisture. lime seeds needs warm temperature to germinate and it usually takes about three to six weeks to germinate. \r",
        "HarvestDescription": "Harvest the fruit by cutting them off with pruning shears or by pulling the fruit stalk from the tree.",
        "Active": null,
        "Season": "Spring,Fall,Summer,Winter",
        "DaysToHarvestSeeds": 2555,
        "DaysToHarvestSeedlings": 1460,
        "HealthBenefits": "Limes are rich in vitamin C and antioxidants, promoting immunity, aiding digestion, and supporting healthy skin.",
        "Pests": []
    },
    {
        "VegetableId": 115,
        "VegetableCode": "064",
        "CatalogId": 25,
        "Name": "Orange",
        "Description": "The orange (Citrus sinensis) is the fruit of a citrus tree species known for its sweet and juicy flavor. With its vibrant orange color and refreshing taste, it is one of the most widely cultivated fruits in the world. Oranges are an excellent source of vitamin C, dietary fiber, and antioxidants, contributing to a healthy diet and boosting immunity. They can be enjoyed fresh, juiced, or used in a variety of culinary applications, including desserts, salads, and savory dishes. Orange trees thrive in warm, sunny climates with well-drained soil and are a popular choice in both commercial orchards and home gardens. Beyond their culinary value, oranges are also used in skincare products, cleaning solutions, and essential oils for their zesty aroma and beneficial properties.",
        "ThumbnailImage": "https://www.azamsharp.com/images/orange.png",
        "SeedDepth": "1/2 inch",
        "GerminationSoilTemp": "70-80 F",
        "DaysToGermination": 35,
        "SowIndoors": "Before winter",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "70-80 F",
        "SpacingBeds": "N/A",
        "Watering": "Heavy and even",
        "Light": "Full",
        "GoodCompanions": "Everything",
        "BadCompanions": "Nothing",
        "SowingDescription": "Orange trees require full sun so make sure the location in your yard gets a good amount of sunlight. Once you find the perfect site make sure there is no weeds or rocks. Remove all debris and weed from the site. \r",
        "GrowingDescription": "See sowing",
        "HarvestDescription": "Depending on the size of the orange tree you planted it might take few years to see the first harvest. Simply, pull down the orange from the tree and enjoy!",
        "Active": null,
        "Season": "Spring, summer, fall",
        "DaysToHarvestSeeds": 2555,
        "DaysToHarvestSeedlings": 1460,
        "HealthBenefits": "Oranges are packed with vitamin C and fiber, boosting immunity, supporting heart health, and promoting skin vitality.",
        "Pests": []
    },
    {
        "VegetableId": 116,
        "VegetableCode": "065",
        "CatalogId": 26,
        "Name": "Blueberry",
        "Description": "Blueberries are perennial flowering plants that produce small, indigo-colored berries known for their sweet and slightly tangy flavor. These nutrient-rich fruits are celebrated for their high levels of antioxidants, vitamins C and K, and dietary fiber, making them a popular choice for promoting overall health. Blueberries are versatile in the kitchen, often enjoyed fresh, dried, or frozen, and used in smoothies, baked goods, salads, and desserts. The plants thrive in acidic, well-drained soil and full sunlight, making them a favorite among home gardeners. In addition to their culinary and nutritional value, blueberries are prized for their vibrant color and ability to enhance the visual appeal of any dish.",
        "ThumbnailImage": "https://www.azamsharp.com/images/blueberry.png",
        "SeedDepth": "3-4\" ",
        "GerminationSoilTemp": "60 - 70 F",
        "DaysToGermination": 90,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "After last frost",
        "PhRange": "5.0 - 6.0",
        "GrowingSoilTemp": "60 - 70 F",
        "SpacingBeds": "2 feet apart",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Bush beans, lettuce, onions",
        "BadCompanions": "Cabbage",
        "SowingDescription": "Make sure to start the blueberry plant with seedlings that are at least 2 to 3 years old. Blueberry bushes usually cover a lot of area with an average space of 4 to 6 feet. \r",
        "GrowingDescription": "If you like you can pick the blueberries as soon as the plant can make them, but it would be better if you wait a while so the blueberry plant can establish a mature root system. Usually, it takes 3 years before you can start picking the blueberries. \r",
        "HarvestDescription": "After harvesting your blueberries you can save them inside the zip lock bag and it will stay fresh the whole winter. ",
        "Active": null,
        "Season": "Spring, summer, fall",
        "DaysToHarvestSeeds": 1000,
        "DaysToHarvestSeedlings": 1000,
        "HealthBenefits": "Blueberries are rich in antioxidants, vitamin C, and fiber, supporting brain health, boosting immunity, and improving digestion.",
        "Pests": []
    },
    {
        "VegetableId": 117,
        "VegetableCode": "066",
        "CatalogId": 26,
        "Name": "Blackberry",
        "Description": "Blackberries are dark, juicy fruits that, despite their name, are not true berries in the botanical sense but are instead classified as aggregate fruits, formed from multiple smaller drupelets. Known for their sweet yet slightly tart flavor, blackberries are highly versatile and can be enjoyed fresh, in jams, desserts, smoothies, or baked goods. They are a rich source of vitamins C and K, fiber, and powerful antioxidants, contributing to numerous health benefits. Blackberry plants are hardy and thrive in a variety of climates, often found growing in both wild and cultivated settings. With their deep black color and glossy appearance, blackberries are not only delicious but also visually striking additions to any dish.",
        "ThumbnailImage": "https://www.azamsharp.com/images/blackberry.png",
        "SeedDepth": "2-3\"",
        "GerminationSoilTemp": "70 - 80 F",
        "DaysToGermination": 21,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "After last frost",
        "PhRange": "5.0 - 6.0",
        "GrowingSoilTemp": "65 - 75 F",
        "SpacingBeds": "3 - 4 feet",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Blueberry",
        "BadCompanions": "Cabbage",
        "SowingDescription": "Make sure that the ground is well fertilized before planting blackberry. Planting should be done in late fall but before spring. Make sure to plant the blackberry plants 4-5 feet apart.",
        "GrowingDescription": "Mulching is important for blackberry plants so make sure you create a schedule for mulching. Mulching will also prevent any weeds from growing near the plant. Make sure to water one inch per week.",
        "HarvestDescription": "Pick fruits regularly and often. The more fruits you will pick the more it will produce. Blackberries are best when eaten fresh. ",
        "Active": null,
        "Season": "Fall, spring, summer",
        "DaysToHarvestSeeds": 730,
        "DaysToHarvestSeedlings": 730,
        "HealthBenefits": "Blackberries are high in fiber, vitamins C and K, and antioxidants, promoting heart health and supporting digestion.",
        "Pests": []
    },
    {
        "VegetableId": 118,
        "VegetableCode": "067",
        "CatalogId": 28,
        "Name": "Siam Queen",
        "Description": "Siam Queen, commonly known as Thai Basil, is a fragrant and flavorful herb belonging to the Ocimum genus in the mint family (Lamiaceae). Renowned for its distinct anise and licorice-like aroma with a hint of spice, Thai Basil is a staple in Southeast Asian cuisines, especially in Thai, Vietnamese, and Cambodian dishes. Its vibrant green leaves and striking purple stems not only add a unique flavor but also enhance the visual appeal of culinary creations. Siam Queen thrives in warm climates and well-drained soil, making it a popular choice for herb gardens. In addition to its culinary uses, it is valued for its potential health benefits, including antioxidant properties and support for digestion.",
        "ThumbnailImage": "https://www.azamsharp.com/images/mint.png",
        "SeedDepth": "1/4 inch (6.25 mm)",
        "GerminationSoilTemp": "65 - 70 F",
        "DaysToGermination": 12,
        "SowIndoors": "4 weeks before planting outside",
        "SowOutdoors": "After last frost",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "55 - 80 F (13-27 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Everything",
        "BadCompanions": "None",
        "SowingDescription": "Siam Queen plants are available in almost all the nurseries and we highly recommend from planting Siam Queen from already grown plants instead of seeds. When picking a Siam Queen plant make sure that it is not infected with insects and bugs. Give special attention to the leaves. That is the first place where you will see damage (if any).",
        "GrowingDescription": "A mature Siam Queen place requires more space to grow. Make sure there is adequate space in the pot when planting mint plant. Make sure the pot has holes at the bottom. This will make sure that the plant root do not rot. Make sure to give Siam Queen enough sunlight and water. In some areas which gets over 100 F temperature in summer it is recommended that you put the plant in a shady region. Extreme heat can kill the plant.",
        "HarvestDescription": "The great thing about Siam Queen is that you will now when to harvest. Harvest Siam Queen by removing the fully grown leaves.",
        "Active": null,
        "Season": "Spring,Summer,Fall,Winter",
        "DaysToHarvestSeeds": 100,
        "DaysToHarvestSeedlings": 70,
        "HealthBenefits": "Siam Queen (Thai basil) contains essential oils and antioxidants, reducing inflammation and supporting digestion.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on the sap of plants by piercing stems, leaves, and buds with their mouthparts. They reproduce rapidly and form large colonies, often weakening the plant and transmitting diseases.",
                "symptoms": "Leaves may become curled, yellowed, or distorted. Aphids excrete honeydew, which can lead to the growth of sooty mold. Infested plants may exhibit stunted growth.",
                "treatment": "Introduce natural predators like ladybugs, lacewings, and parasitic wasps. Apply insecticidal soap or neem oil for organic control. Regularly check the undersides of leaves and remove aphids manually if necessary.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Whiteflies",
                "description": "Whiteflies are small, winged insects that feed on the underside of leaves, sucking out plant juices. They can also transmit plant viruses.",
                "symptoms": "Yellowing of leaves, wilting, and a sticky residue (honeydew) on the foliage. Whiteflies can also cause distorted growth and reduced yield.",
                "treatment": "Use yellow sticky traps to catch adult whiteflies. Apply insecticidal soap or neem oil for organic control. Encourage natural predators like ladybugs and parasitic wasps.",
                "photo": "https://www.azamsharp.com/images/whiteflies.png"
            },
            {
                "name": "Spider Mites",
                "description": "Spider mites are tiny arachnids that feed on the sap of plants, causing damage to the leaves. They are more likely to appear in dry, hot conditions.",
                "symptoms": "Speckled or stippled discoloration on leaves, with webbing appearing on the undersides. The plant may become stunted and show signs of stress, such as yellowing and leaf drop.",
                "treatment": "Spray with water to reduce mite populations. Use miticides or neem oil for control. Introduce natural predators like predatory mites to help reduce spider mite numbers.",
                "photo": "https://www.azamsharp.com/images/spider_mites.png"
            },
            {
                "name": "Leafhoppers",
                "description": "Leafhoppers are small insects that feed on plant sap. They can also transmit plant viruses, causing significant damage to basil plants.",
                "symptoms": "Yellowing and curling of leaves. The plant may exhibit stunted growth and may also attract ants due to the honeydew they excrete.",
                "treatment": "Apply insecticidal soap or neem oil for control. Encourage natural predators like birds and beneficial insects. Use row covers to protect plants from infestation.",
                "photo": "https://www.azamsharp.com/images/leafhoppers.png"
            },
            {
                "name": "Slugs",
                "description": "Slugs are mollusks that feed on leaves, especially during wet and rainy conditions. They are known to cause significant damage to young plants and seedlings.",
                "symptoms": "Irregular holes or ragged edges on leaves. Slug trails, which are slimy and shiny, may also be visible on plants and surrounding areas.",
                "treatment": "Handpick slugs during the night or early morning. Use copper tape or crushed eggshells around the base of plants to deter them. Set up beer traps or use iron phosphate-based slug baits.",
                "photo": "https://www.azamsharp.com/images/slugs.png"
            }
        ]
        
    },
    {
        "VegetableId": 119,
        "VegetableCode": "068",
        "CatalogId": 29,
        "Name": "Avocado",
        "Description": "The avocado (Persea americana) is a fruit-bearing tree native to Mexico and Central America, prized for its nutrient-rich and creamy-textured fruit. Often referred to as a superfood, avocados are an excellent source of healthy fats, particularly monounsaturated fats, along with vitamins C, E, K, and B6, potassium, and fiber. The fruit’s mild, buttery flavor makes it a versatile ingredient in a wide range of dishes, from guacamole and salads to smoothies and spreads. Avocado trees thrive in warm, tropical to subtropical climates with well-drained soil and adequate sunlight. Beyond their culinary appeal, avocados are also valued for their use in natural skincare products due to their moisturizing and antioxidant properties.",
        "ThumbnailImage": "https://www.azamsharp.com/images/avocado.png",
        "SeedDepth": "1/2 below seed height",
        "GerminationSoilTemp": "60-85F",
        "DaysToGermination": 60,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "Moderately Warm",
        "PhRange": "6.5 - 7.0",
        "GrowingSoilTemp": "60 - 85F",
        "SpacingBeds": "N/A",
        "Watering": "2/3 times per week",
        "Light": "Full",
        "GoodCompanions": "N/A",
        "BadCompanions": "N/A",
        "SowingDescription": "Put a tooth pick in Avocado seem and suspend upside down in a glass of water. Make sure the glass gets direct sunlight. The roots will start to appear in 2-6 weeks. When the roots are thick then plant it in the rich soil.",
        "GrowingDescription": "Avocado trees usually requires water 2-3 times per week. Put mulch around the trees to make sure that the moisture stays inside the soil. Nitrogen rich fertilizers can also be applied to the tree in batches of 1/2 - 1 pound.  ",
        "HarvestDescription": "You can pick the Avocados when they are green and the right size. Store them in a dark place for few more extra days to make sure they are soft. ",
        "Active": null,
        "Season": "Spring,Summer",
        "DaysToHarvestSeeds": 3652,
        "DaysToHarvestSeedlings": 1826,
        "HealthBenefits": "Avocados are rich in healthy fats, fiber, and vitamins, promoting heart health, supporting digestion, and improving skin health.",
        "Pests": [
            {
                "name": "Avocado Thrips",
                "description": "Avocado thrips (Scirtothrips perseae) are small, slender insects that feed on the leaves of avocado trees, causing damage by sucking the plant's sap. They are especially problematic in warmer climates and during the growing season.",
                "symptoms": "Infested leaves may show silvering or stippling, and in severe cases, the leaves become curled or distorted. Heavy infestations can stunt the growth of the tree and reduce the quality of the fruit.",
                "treatment": "Apply insecticidal soap, neem oil, or introduce natural predators such as predatory mites. Regularly inspect the undersides of leaves for thrips presence. Avoid excessive irrigation, as it can worsen infestations.",
                "photo": "https://www.azamsharp.com/images/avocado_thrips.png"
            },
            {
                "name": "Avocado Root Weevil",
                "description": "The avocado root weevil (Copturus aguacatae) is a pest that attacks the roots of avocado trees, causing them to rot. The larvae feed on the roots, weakening the tree and making it more susceptible to diseases.",
                "symptoms": "Trees may exhibit stunted growth, yellowing leaves, and a general decline in health. Infested trees may also have a poor root system, which results in poor fruit production.",
                "treatment": "Use nematicides or introduce beneficial nematodes to target the larvae in the soil. Proper irrigation practices and avoiding waterlogging are important to prevent exacerbating the damage.",
                "photo": "https://www.azamsharp.com/images/avocado_root_weevil.png"
            },
            {
                "name": "Leafhoppers",
                "description": "Leafhoppers (Empoasca spp.) are small, jumping insects that suck sap from avocado leaves and cause damage through feeding. They can also transmit plant diseases such as the avocado sunblotch viroid.",
                "symptoms": "Yellowing and curling of leaves, sometimes with a stippled appearance. If left untreated, leafhoppers can lead to significant damage to both the foliage and fruit.",
                "treatment": "Use insecticidal soaps, neem oil, or introduce natural predators such as lacewings and ladybugs to manage leafhopper populations. Regularly check for these pests on new growth.",
                "photo": "https://www.azamsharp.com/images/leafhoppers.png"
            },
            {
                "name": "Spider Mites",
                "description": "Spider mites (Tetranychus spp.) are tiny arachnids that feed on the sap of avocado trees, causing damage to the leaves. They thrive in hot, dry conditions and can multiply quickly.",
                "symptoms": "Speckled or stippled discoloration on leaves, webbing on the underside of leaves, and eventual leaf drop. In severe cases, the trees growth is stunted, and fruit quality is compromised.",
                "treatment": "Use miticides, insecticidal soap, or neem oil to control spider mites. Keep the foliage moist, as high humidity can reduce mite populations. Introduce natural predators such as predatory mites to help control the infestation.",
                "photo": "https://www.azamsharp.com/images/spider_mites.png"
            }
        ]
        
    },
    {
        "VegetableId": 94,
        "VegetableCode": "043",
        "CatalogId": 3,
        "Name": "Rutabaga",
        "Description": "Rutabaga (Brassica napus), also known as Swedish turnip or swede, is a nutritious root vegetable that is a hybrid between cabbage and turnip. It is easily recognizable by its round shape, thick skin, and yellow or orange flesh with a slightly sweet and earthy flavor. Rutabagas are incredibly versatile in the kitchen, commonly used in soups, stews, mashes, or roasted as a hearty side dish. They are a rich source of vitamins C and E, potassium, and dietary fiber, making them a healthy addition to any diet. This cool-season crop thrives in well-drained soil and is particularly popular in northern climates for its hardiness and long storage life.",
        "ThumbnailImage": "https://www.azamsharp.com/images/rutabaga.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "50-85 F (10-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "4-6 weeks before last frost",
        "SowOutdoors": "Early spring or late summer",
        "PhRange": "5.5-7.0",
        "GrowingSoilTemp": "60-70 F (16-21 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Moderate",
        "Light": "Full sun to partial shade",
        "GoodCompanions": "Carrot, pea, onion",
        "BadCompanions": "Broccoli, turnip",
        "SowingDescription": "Rutabagas prefer rich, well-drained soil with consistent moisture. Sow seeds directly into the soil or start indoors for transplanting. Thin seedlings to avoid overcrowding.",
        "GrowingDescription": "Keep the soil consistently moist but not waterlogged. Rutabagas are heavy feeders, so supplement with compost or balanced fertilizer throughout the growing season.",
        "HarvestDescription": "Harvest rutabagas when roots are 3-5 inches in diameter. Larger roots can become woody. Store in a cool, dark place for several weeks.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 90,
        "DaysToHarvestSeedlings": 70,
        "HealthBenefits": "Rutabagas are high in fiber, vitamin C, and potassium, supporting digestion, boosting immunity, and promoting heart health.",
        "Pests": [
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of various crops, including tomatoes, potatoes, eggplants, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles create small, round holes in the leaves, causing 'shot-hole' damage.",
                "symptoms": "Infested plants exhibit small, round holes in leaves that resemble shot holes. Flea beetles can stunt plant growth, reduce vigor, and even kill seedlings under heavy infestations. The damage reduces photosynthesis and weakens the plant.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as parasitic wasps and tachinid flies to reduce flea beetle populations. Plant trap crops like radishes to lure beetles away from main crops. Practice crop rotation and remove plant debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            },
            {
                "name": "Root Maggots",
                "description": "Root maggots are the larvae of certain species of flies, including the onion fly (Delia antiqua). These maggots infest the roots of plants, particularly onions, garlic, and other root vegetables. The larvae feed on the roots, causing rot and decay.",
                "symptoms": "Plants infested with root maggots may show signs of yellowing, wilting, or stunted growth. The roots may be soft, decayed, or discolored. Severe infestations can cause plants to die prematurely due to the inability to absorb nutrients and water.",
                "treatment": "To control root maggots, practice crop rotation and avoid planting susceptible crops in the same soil each year. Use floating row covers to protect plants from adult flies. Remove and destroy infested plants immediately. Soil solarization, using plastic to trap heat, can also help reduce maggot populations in the soil.",
                "photo": "https://www.azamsharp.com/images/root_maggots.png"
            }
        ]
        
    },
    {
        "VegetableId": 95,
        "VegetableCode": "044",
        "CatalogId": 3,
        "Name": "Endive",
        "Description": "Endive (Cichorium endivia) is a leafy vegetable known for its crisp texture and slightly bitter flavor, making it a popular addition to salads, appetizers, and garnishes. It comes in two main varieties: curly endive, with frilly leaves, and Belgian endive, featuring tightly packed, smooth leaves. Endive is low in calories and rich in vitamins A, C, and K, as well as dietary fiber, promoting overall health and digestion. Its slightly bitter taste pairs well with tangy dressings, sweet fruits, or creamy cheeses. This cool-weather crop thrives in well-drained soil and partial shade, making it a favorite among home gardeners and chefs alike.",
        "ThumbnailImage": "https://www.azamsharp.com/images/endive.png",
        "SeedDepth": "1/4\" (6 mm)",
        "GerminationSoilTemp": "60-75 F (15-24 C)",
        "DaysToGermination": 7,
        "SowIndoors": "4-6 weeks before last frost",
        "SowOutdoors": "Spring or late summer",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "60-65 F (16-18 C)",
        "SpacingBeds": "10-12\" (25-30 cm)",
        "Watering": "Moderate",
        "Light": "Full sun to partial shade",
        "GoodCompanions": "Carrot, onion, radish",
        "BadCompanions": "Fennel",
        "SowingDescription": "Endive grows best in cool weather. Prepare soil with compost or well-rotted manure, sow seeds thinly in rows, and thin seedlings to appropriate spacing.",
        "GrowingDescription": "Keep the soil evenly moist but not soggy. Mulch around plants to retain moisture and prevent weeds. Blanch the leaves for a milder taste by tying them together 2-3 weeks before harvest.",
        "HarvestDescription": "Harvest when the leaves form a tight head or are 6-8 inches tall. Cut at the base, and store in the refrigerator for up to a week.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 40,
        "HealthBenefits": "Endive is low in calories and high in fiber and vitamins, promoting digestion and supporting immune health.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in various colors such as green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are a common pest on vegetables, fruits, and ornamental plants, and can transmit plant viruses.",
                "symptoms": "Infested plants may show curled, yellowed, or distorted leaves. Other signs include stunted growth, sticky honeydew on foliage, which attracts ants, and the development of sooty mold. Aphids are typically visible in clusters on the undersides of leaves or on new shoots.",
                "treatment": "To manage aphid infestations, introduce natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Slugs",
                "description": "Slugs are slow-moving mollusks that feed on plants, causing significant damage to leaves, stems, and roots. They are particularly active in wet, rainy weather, and leave a silvery slime trail behind as they move. Slugs feed on a wide range of plants, including vegetables, fruits, and flowers.",
                "symptoms": "Slugs cause irregular holes or ragged edges in leaves. They also consume stems and roots, which can lead to plant defoliation. Slugs leave behind visible slime trails on plants and surrounding areas. In severe cases, they can cause significant damage and weaken plants.",
                "treatment": "To control slugs, use physical barriers such as copper tape or crushed eggshells around plants. Handpick slugs during the evening or early morning when they are most active. Apply organic slug and snail baits, or create traps using beer to attract and kill slugs. Ensure proper garden hygiene by removing plant debris and keeping areas dry to discourage slug infestations.",
                "photo": "https://www.azamsharp.com/images/slugs.png"
            },
            {
                "name": "Snails",
                "description": "Snails are slow-moving mollusks that cause damage by feeding on plant leaves, stems, and roots. They are particularly active during damp, rainy weather, leaving behind slime trails as they move. Snails are a common pest in gardens, consuming a variety of plants, including vegetables, fruits, and flowers.",
                "symptoms": "Snail damage typically includes irregular holes or ragged edges in leaves, as well as eaten stems and roots. Snails also leave slime trails visible on plants and surrounding areas. In severe infestations, snails can lead to plant defoliation and significantly weaken plant health.",
                "treatment": "To manage snail populations, use physical barriers like copper tape or eggshells. Handpick snails during the night or early morning when they are most active. Apply slug and snail baits, or set traps using beer to attract and kill snails. Remove plant debris and keep garden areas dry to prevent future infestations.",
                "photo": "https://www.azamsharp.com/images/snails.png"
            }
        ]
        
    },
    {
        "VegetableId": 96,
        "VegetableCode": "045",
        "CatalogId": 3,
        "Name": "Collard Greens",
        "Description": "Collard greens (Brassica oleracea), a member of the cabbage family, are a leafy green vegetable celebrated for their large, dark green leaves and mildly bitter flavor. A staple in Southern cuisine, collard greens are often slow-cooked with smoked meats, garlic, and spices to create hearty, flavorful dishes. Rich in vitamins A, C, and K, as well as calcium and fiber, collard greens are a nutritional powerhouse that supports bone health, immunity, and digestion. These hardy greens thrive in cool weather and are well-suited for home gardens, where their resilience and high yield make them a favorite for gardeners and cooks alike.",
        "ThumbnailImage": "https://www.azamsharp.com/images/collard_greens.png",
        "SeedDepth": "1/2\" (13 mm)",
        "GerminationSoilTemp": "45-85 F (7-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "6-8 weeks before last frost",
        "SowOutdoors": "Early spring or late summer",
        "PhRange": "6.0-6.8",
        "GrowingSoilTemp": "60-75 F (16-24 C)",
        "SpacingBeds": "18-24\" (45-60 cm)",
        "Watering": "Moderate to heavy",
        "Light": "Full sun to partial shade",
        "GoodCompanions": "Beets, onions, potatoes",
        "BadCompanions": "Strawberries, pole beans",
        "SowingDescription": "Collard greens grow best in fertile, well-drained soil enriched with compost. Sow seeds directly or start indoors and transplant once seedlings are sturdy.",
        "GrowingDescription": "Keep the soil consistently moist but avoid waterlogging. Apply mulch to retain soil moisture and prevent weeds. Fertilize periodically for optimal growth.",
        "HarvestDescription": "Harvest leaves as needed by cutting them from the outer part of the plant. Younger leaves are tender and less bitter. Plants can continue producing until the first hard frost.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 70,
        "DaysToHarvestSeedlings": 55,
        "HealthBenefits": "Collard greens are rich in vitamins A, C, and K, supporting bone health, boosting immunity, and aiding digestion.",
        "Pests":[
            {
                "name": "Cabbage Worms",
                "description": "Cabbage worms are the larvae of several species of butterflies, particularly the large white butterfly (Pieris brassicae). These worms are notorious pests of cabbage, kale, and other cruciferous vegetables. They feed on the leaves of plants, causing significant damage and reducing the quality of the crops.",
                "symptoms": "Cabbage worms leave behind large, irregular holes in leaves. The plants may also appear chewed or shredded. Heavy infestations can result in significant defoliation, stunted plant growth, and reduced yield.",
                "treatment": "To manage cabbage worm infestations, manually remove and destroy worms or use floating row covers to prevent butterflies from laying eggs on the plants. Apply organic treatments such as Bacillus thuringiensis (Bt) to target larvae. Encourage natural predators like birds, spiders, and beneficial insects to control populations.",
                "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They can be green, yellow, black, red, or brown, and reproduce rapidly, often forming large colonies. Aphids are a common pest on many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth, sticky honeydew on foliage, which attracts ants, and the growth of sooty mold. Aphids are typically visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of various crops, including tomatoes, potatoes, eggplants, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles create distinctive 'shot-hole' damage, making them a significant pest for young plants.",
                "symptoms": "Infested plants exhibit small, round holes in leaves, which appear like shot holes. Severe infestations can stunt plant growth, reduce vigor, and even kill seedlings. The damage may lead to reduced photosynthesis and weaken the plant.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as parasitic wasps and tachinid flies to reduce flea beetle populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and remove plant debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            }
        ]
        
    },
    {
        "VegetableId": 97,
        "VegetableCode": "046",
        "CatalogId": 3,
        "Name": "Watercress",
        "Description": "Watercress (Nasturtium officinale) is a fast-growing aquatic or semi-aquatic leafy green vegetable known for its vibrant green leaves and distinct peppery flavor. Often enjoyed raw in salads and sandwiches or as a garnish, watercress also adds a refreshing kick to soups and smoothies. Packed with nutrients, watercress is an excellent source of vitamins A, C, and K, as well as antioxidants and minerals like calcium and iron, making it a powerful addition to a healthy diet. This versatile plant thrives in clean, slow-moving water or moist soil, making it an ideal crop for hydroponic systems or garden beds with consistent moisture.",
        "ThumbnailImage": "https://www.azamsharp.com/images/watercress.png",
        "SeedDepth": "1/8\" (3 mm)",
        "GerminationSoilTemp": "50-60 F (10-16 C)",
        "DaysToGermination": 5,
        "SowIndoors": "6-8 weeks before last frost",
        "SowOutdoors": "After last frost in cool climates",
        "PhRange": "6.5-7.5",
        "GrowingSoilTemp": "55-70 F (13-21 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "High (constant moisture or shallow water)",
        "Light": "Partial shade to full sun",
        "GoodCompanions": "Mint, lettuce, chives",
        "BadCompanions": "None noted",
        "SowingDescription": "Watercress thrives in nutrient-rich, constantly moist soil or shallow water. Sow seeds directly or start indoors for transplanting. Ensure consistent moisture for optimal germination.",
        "GrowingDescription": "Watercress prefers cool temperatures and plenty of moisture. Grow in containers submerged in water or in very damp soil. Fertilize with a balanced liquid fertilizer as needed.",
        "HarvestDescription": "Harvest watercress when the stems are 4-6 inches long. Cut above the growing point to allow for regrowth. Best used fresh, but can be stored in the refrigerator for up to a week.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 40,
        "HealthBenefits": "Watercress is packed with vitamins A and C, supporting immunity, improving bone health, and promoting skin vitality.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in a variety of colors, including green, yellow, black, red, and brown, and reproduce rapidly, often forming large colonies. Aphids are a common pest on many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth, sticky honeydew on foliage, which attracts ants, and the growth of sooty mold. Aphids are typically visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Snails",
                "description": "Snails are slow-moving mollusks that can cause significant damage to plants by feeding on their leaves, stems, and roots. They are particularly active during wet, rainy weather, leaving behind a silvery slime trail as they move. Snails feed on a wide range of plants, including vegetables, fruits, and flowers.",
                "symptoms": "Snail damage typically includes irregular holes or ragged edges in leaves, as well as eaten stems and roots. Snails also leave behind slime trails that are visible on plants and surrounding areas. In severe cases, snails can cause considerable plant defoliation and weaken the overall health of the plant.",
                "treatment": "To control snails, use physical barriers like copper tape or crushed eggshells around plants. Handpick snails during the evening or early morning when they are most active. Apply organic slug and snail baits, or create traps using beer to attract and kill snails. Ensure proper garden hygiene by removing plant debris and keeping areas dry to discourage snail infestations.",
                "photo": "https://www.azamsharp.com/images/snails.png"
            }
        ]
        
    },
    {
        "VegetableId": 98,
        "VegetableCode": "047",
        "CatalogId": 3,
        "Name": "Horseradish",
        "Description": "Horseradish (Armoracia rusticana) is a hardy perennial root vegetable renowned for its sharp, pungent, and spicy flavor. The thick, white roots are typically grated and used to make a zesty condiment that pairs well with roasted meats, seafood, and sauces. In addition to its culinary uses, horseradish has a long history in traditional medicine for its potential antibacterial properties and its ability to clear sinuses. The plant thrives in well-drained soil and full sun, making it an easy-to-grow addition to home gardens. With its bold flavor and versatility, horseradish is a favorite among those seeking to add a fiery kick to their dishes.",
        "ThumbnailImage": "https://www.azamsharp.com/images/horseradish.png",
        "SeedDepth": "Plant root cuttings 2-3\" (5-8 cm) deep",
        "GerminationSoilTemp": "50-75 F (10-24 C)",
        "DaysToGermination": 0,
        "SowIndoors": "Not applicable (grown from cuttings)",
        "SowOutdoors": "Early spring or fall",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "60-75 F (16-24 C)",
        "SpacingBeds": "18-24\" (45-60 cm)",
        "Watering": "Moderate",
        "Light": "Full sun to partial shade",
        "GoodCompanions": "Potatoes, strawberries, asparagus",
        "BadCompanions": "Beans, peas",
        "SowingDescription": "Plant horseradish root cuttings in loose, well-drained soil. Position cuttings at a slight angle with the narrower end facing downward. Cover with soil and water thoroughly.",
        "GrowingDescription": "Horseradish is low-maintenance but benefits from consistent watering and occasional fertilization. Keep the soil loose to encourage root development and remove weeds regularly.",
        "HarvestDescription": "Harvest horseradish roots in late fall after a frost for the best flavor. Dig up the roots, leaving smaller pieces in the ground for next year’s crop. Store harvested roots in a cool, dark place.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 175,
        "DaysToHarvestSeedlings": 145,
        "HealthBenefits": "Horseradish contains antioxidants and compounds that support immune health and promote digestion.",
        "Pests": [
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of various plants, including vegetables like tomatoes, potatoes, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles cause significant damage by creating small, round holes in the leaves, often giving them a perforated or 'shot-hole' appearance.",
                "symptoms": "Infested plants exhibit small, round holes in leaves, which appear like shot holes. Flea beetles can stunt plant growth, reduce vigor, and even kill seedlings under heavy infestations. The damage can reduce photosynthesis and make the plants more susceptible to other diseases.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as parasitic wasps and tachinid flies to reduce flea beetle populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and remove plant debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            },
            {
                "name": "Cabbage Worms",
                "description": "Cabbage worms are the larvae of several species of butterflies, particularly the large white butterfly (Pieris brassicae). These worms are notorious pests of cabbage, kale, and other cruciferous vegetables. They feed on the leaves of plants, causing significant damage and reducing the quality of the crops.",
                "symptoms": "Cabbage worms leave behind large, irregular holes in leaves. The plants may also appear chewed or shredded. Heavy infestations can result in significant defoliation, stunted plant growth, and reduced yield.",
                "treatment": "To manage cabbage worm infestations, manually remove and destroy worms or use floating row covers to prevent butterflies from laying eggs on the plants. Apply organic treatments such as Bacillus thuringiensis (Bt) to target larvae. Encourage natural predators like birds, spiders, and beneficial insects to control populations.",
                "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
            }
        ]
        
    },
    {
        "VegetableId": 99,
        "VegetableCode": "048",
        "CatalogId": 3,
        "Name": "Jicama",
        "Description": "Jicama (Pachyrhizus erosus), also known as the Mexican turnip or yam bean, is a root vegetable prized for its crisp texture and subtly sweet, nutty flavor. Its juicy, white flesh is commonly eaten raw, adding a refreshing crunch to salads, slaws, and fruit platters. Jicama also holds up well to cooking and can be stir-fried, sautéed, or used as a substitute for water chestnuts in recipes. Low in calories and high in dietary fiber, vitamin C, and potassium, jicama is a nutritious and versatile ingredient. This tropical plant thrives in warm climates and well-drained soil, making it a popular choice for gardeners and culinary enthusiasts alike.",
        "ThumbnailImage": "https://www.azamsharp.com/images/jicama.png",
        "SeedDepth": "1\" (25 mm)",
        "GerminationSoilTemp": "70-85 F (21-29 C)",
        "DaysToGermination": 10,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "After last frost when soil is warm",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "75-85 F (24-29 C)",
        "SpacingBeds": "12-18\" (30-45 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Corn, beans, squash",
        "BadCompanions": "None noted",
        "SowingDescription": "Sow jicama seeds directly in warm, well-drained soil after the danger of frost has passed. Thin seedlings to proper spacing after germination.",
        "GrowingDescription": "Jicama thrives in warm climates with consistent watering. Provide a trellis or support for the vines, which can grow several feet long. Avoid over-fertilizing, as this can reduce root size.",
        "HarvestDescription": "Harvest jicama roots when they are 3-6 inches in diameter, usually 5-9 months after planting. Do not eat the vines or seeds, as they are toxic. Store harvested roots in a cool, dry place.",
        "Active": null,
        "Season": "Spring, Summer",
        "DaysToHarvestSeeds": 150,
        "DaysToHarvestSeedlings": 150,
        "HealthBenefits": "Jicama is high in fiber and vitamin C, supporting digestion, boosting immunity, and promoting hydration.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They can be green, yellow, black, red, or brown, and reproduce rapidly, often forming large colonies. Aphids are common pests on a variety of plants, including vegetables, fruits, and ornamental plants. They can cause direct damage and transmit plant viruses.",
                "symptoms": "Infested plants show signs of curled, yellowed, or distorted leaves. Other symptoms include stunted growth and sticky honeydew on foliage, which attracts ants and leads to the growth of sooty mold. Aphids are usually visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "To control aphid infestations, encourage natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Use neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Root Nematodes",
                "description": "Root nematodes are microscopic roundworms that infest plant roots, causing damage by feeding on the root tissues. These pests can be particularly harmful to vegetables, fruits, and ornamental plants. Root nematodes interfere with nutrient and water absorption, leading to stunted growth and weakened plants.",
                "symptoms": "Plants infected by root nematodes may show symptoms such as yellowing, wilting, stunted growth, and reduced yields. The roots may appear discolored, swollen, or deformed. In severe infestations, plants may die prematurely due to the inability to absorb nutrients and water.",
                "treatment": "To manage root nematodes, practice crop rotation and avoid planting susceptible plants in the same soil year after year. Use nematode-resistant plant varieties when possible. Apply beneficial nematodes to the soil to target the harmful nematodes. Solarization, where soil is heated by the sun under clear plastic sheets, can also help reduce nematode populations in the soil.",
                "photo": "https://www.azamsharp.com/images/root_nematodes.png"
            }
        ]
        
    },
    {
        "VegetableId": 100,
        "VegetableCode": "049",
        "CatalogId": 3,
        "Name": "Bok Choy",
        "Description": "Bok Choy, also known as Pak Choi (Brassica rapa subsp. chinensis), is a type of Chinese cabbage characterized by its smooth, dark green leaves and crisp, white stalks. With its mild, slightly sweet flavor, Bok Choy is a staple in Asian cuisine, commonly featured in stir-fries, soups, and steamed dishes. Rich in vitamins A, C, and K, as well as calcium and antioxidants, it is a highly nutritious vegetable that supports bone health, immunity, and overall well-being. Bok Choy thrives in cool climates and well-drained soil, making it a popular choice for both home gardens and commercial farming. Its versatility and quick cooking time make it a favorite for healthy, flavorful meals.",
        "ThumbnailImage": "https://www.azamsharp.com/images/bok_choy.png",
        "SeedDepth": "1/4\" (6 mm)",
        "GerminationSoilTemp": "50-85 F (10-29 C)",
        "DaysToGermination": 5,
        "SowIndoors": "4-6 weeks before last frost",
        "SowOutdoors": "Early spring or late summer",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "60-70 F (16-21 C)",
        "SpacingBeds": "6-12\" (15-30 cm)",
        "Watering": "Moderate to heavy",
        "Light": "Full sun to partial shade",
        "GoodCompanions": "Carrots, onions, peas",
        "BadCompanions": "Strawberries, pole beans",
        "SowingDescription": "Sow Bok Choy seeds in fertile, well-drained soil. Thin seedlings to appropriate spacing to allow room for growth. Ensure the soil remains consistently moist.",
        "GrowingDescription": "Bok Choy prefers cool weather and grows best in spring or fall. Water consistently and mulch to retain moisture and keep roots cool. Protect from pests like cabbage worms.",
        "HarvestDescription": "Harvest Bok Choy when heads are firm and leaves are crisp, usually 6-8 weeks after planting. Cut the entire plant at the base, or harvest individual leaves as needed.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 50,
        "DaysToHarvestSeedlings": 30,
        "HealthBenefits": "Bok choy is rich in vitamins A, C, and K, supporting bone health, boosting immunity, and aiding digestion.",
        "Pests": [
            {
                "name": "Cabbage Worms",
                "description": "Cabbage worms are the larvae of several species of butterflies, particularly the large white butterfly (Pieris brassicae). These worms are notorious pests of cabbage, kale, and other cruciferous vegetables. They feed on the leaves of plants, causing significant damage and reducing the quality of the crops.",
                "symptoms": "Cabbage worms leave behind large, irregular holes in leaves. The plants may also appear chewed or shredded. Heavy infestations can result in significant defoliation, stunted plant growth, and reduced yield.",
                "treatment": "To manage cabbage worm infestations, manually remove and destroy worms or use floating row covers to prevent butterflies from laying eggs on the plants. Apply organic treatments such as Bacillus thuringiensis (Bt) to target larvae. Encourage natural predators like birds, spiders, and beneficial insects to control populations.",
                "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
            },
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in a variety of colors, including green, yellow, black, red, and brown, and reproduce rapidly. Aphids are a common pest on many types of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may exhibit curled, yellowed, or distorted leaves. Other symptoms include stunted growth, sticky honeydew on foliage, which attracts ants, and the growth of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Flea Beetles",
                "description": "Flea beetles are small, jumping insects that feed on the leaves of a wide variety of crops, including tomatoes, potatoes, and leafy greens. They are named for their ability to jump like fleas when disturbed. Flea beetles cause significant damage by creating small, round holes in leaves, often giving them a perforated or 'shot-hole' appearance.",
                "symptoms": "Infested plants exhibit small, round holes in leaves, which appear like shot holes. Severe infestations can stunt plant growth, reduce vigor, and even kill seedlings. The damage can reduce photosynthesis, weaken the plant, and make it more susceptible to other diseases.",
                "treatment": "Use floating row covers to protect seedlings from flea beetles. Apply diatomaceous earth or neem oil to deter the beetles. Encourage natural predators such as parasitic wasps and tachinid flies to reduce flea beetle populations. Plant trap crops like radishes to lure beetles away from the main crops. Practice crop rotation and remove plant debris to minimize future infestations.",
                "photo": "https://www.azamsharp.com/images/flea_beetles.png"
            }
        ]
        
    },
    {
        "VegetableId": 101,
        "VegetableCode": "050",
        "CatalogId": 3,
        "Name": "Snap Peas",
        "Description": "Snap peas (Pisum sativum var. macrocarpon) are a sweet and crunchy legume known for their edible pods and seeds, making them a versatile addition to meals. Whether enjoyed raw as a crisp snack or lightly cooked in stir-fries, salads, or side dishes, snap peas offer a delightful texture and fresh flavor. They are a rich source of vitamins A, C, and K, as well as dietary fiber and antioxidants, contributing to a healthy diet. As a cool-season crop, snap peas thrive in well-drained soil and mild temperatures, making them an ideal choice for early spring or fall gardens. Their ease of growth and high yield make them a favorite among gardeners and home cooks alike.",
        "ThumbnailImage": "https://www.azamsharp.com/images/snap_peas.png",
        "SeedDepth": "1\" (25 mm)",
        "GerminationSoilTemp": "40-75 F (4-24 C)",
        "DaysToGermination": 7,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "As soon as soil is workable in early spring",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "55-65 F (13-18 C)",
        "SpacingBeds": "2-3\" (5-8 cm) apart in rows 18-24\" (45-60 cm) apart",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Carrots, radishes, lettuce",
        "BadCompanions": "Garlic, onions",
        "SowingDescription": "Direct sow Snap Peas seeds in well-drained soil as soon as the ground can be worked in spring. Provide a trellis or support for climbing varieties.",
        "GrowingDescription": "Snap Peas thrive in cool weather and need consistent moisture for optimal growth. Mulch to retain soil moisture and control weeds. Avoid planting in hot weather.",
        "HarvestDescription": "Harvest Snap Peas when pods are plump and crisp, but before the peas inside become too large. Pick regularly to encourage continued production.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 50,
        "HealthBenefits": "Snap peas are high in fiber and vitamins A and C, supporting digestion and boosting immunity.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They come in a variety of colors, such as green, yellow, black, red, and brown, and reproduce rapidly, forming large colonies. Aphids are common pests on vegetables, fruits, and ornamental plants, often causing damage and transmitting plant viruses.",
                "symptoms": "Infested plants often show curled, yellowed, or distorted leaves. In addition, symptoms such as stunted growth, sticky honeydew on leaves, and the growth of sooty mold may occur. Aphids are typically visible in clusters on the undersides of leaves or new growth.",
                "treatment": "To control aphid infestations, introduce natural predators such as ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Pea Weevils",
                "description": "Pea weevils (Bruchus pisorum) are small, reddish-brown beetles that infest peas. The adult beetles lay eggs on the peas, and when the larvae hatch, they burrow into the seeds, causing damage. Pea weevils are a major pest in field-grown and stored peas, reducing both the quality and yield of the crop.",
                "symptoms": "Infested peas may show small, round holes on the seed surface or in the pods. The larvae feeding inside the seeds cause them to rot and become unusable. In severe infestations, the plants may yield fewer peas, and the peas that are harvested may be unfit for consumption or storage.",
                "treatment": "To prevent and manage pea weevil infestations, rotate crops to avoid planting peas in the same soil each year. Use insecticidal treatments labeled for peas during flowering or pod-setting. After harvest, remove and destroy any infested plants to minimize pest buildup. Store harvested peas in sealed containers to protect them from further contamination.",
                "photo": "https://www.azamsharp.com/images/pea_weevils.png"
            }
        ]
        
    },
    {
        "VegetableId": 102,
        "VegetableCode": "051",
        "CatalogId": 3,
        "Name": "Snow Peas",
        "Description": "Snow peas (Pisum sativum var. saccharatum) are a variety of pea known for their flat, tender, and edible pods, which are harvested before the peas inside fully develop. With a mild, slightly sweet flavor and crisp texture, snow peas are a popular ingredient in stir-fries, salads, and other light, refreshing dishes. They are low in calories and rich in vitamins A, C, and K, as well as antioxidants and dietary fiber, making them a nutritious addition to any meal. Snow peas thrive in cool weather and well-drained soil, and their climbing vines make them an excellent choice for trellised gardens. Their versatility and ease of preparation make them a favorite among cooks and gardeners alike.",
        "ThumbnailImage": "https://www.azamsharp.com/images/snow_peas.png",
        "SeedDepth": "1\" (25 mm)",
        "GerminationSoilTemp": "40-75 F (4-24 C)",
        "DaysToGermination": 7,
        "SowIndoors": "Not recommended",
        "SowOutdoors": "As soon as soil is workable in early spring",
        "PhRange": "6.0-7.5",
        "GrowingSoilTemp": "55-65 F (13-18 C)",
        "SpacingBeds": "2-3\" (5-8 cm) apart in rows 18-24\" (45-60 cm) apart",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Carrots, radishes, lettuce",
        "BadCompanions": "Garlic, onions",
        "SowingDescription": "Direct sow Snow Peas seeds in well-drained soil as soon as the ground can be worked in spring. Provide support for climbing varieties or plant bush types for compact growth.",
        "GrowingDescription": "Snow Peas thrive in cool weather and require consistent moisture for optimal growth. Mulch to retain soil moisture and suppress weeds. Avoid planting in hot weather.",
        "HarvestDescription": "Harvest Snow Peas when pods are flat and tender, before the peas inside start to swell. Pick frequently to encourage continued production.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 60,
        "DaysToHarvestSeedlings": 50,
        "HealthBenefits": "Snow peas are low in calories and rich in vitamins A and C, promoting digestion and supporting immune health.",
        "Pests": [
            {
                "name": "Aphids",
                "description": "Aphids are small, soft-bodied insects that feed on plant sap by piercing stems, leaves, and buds with their mouthparts. They can vary in color, including green, yellow, black, red, and brown, and reproduce rapidly. Aphids are common pests on a wide variety of plants, including vegetables, fruits, and ornamental plants.",
                "symptoms": "Infested plants may show curled, yellowed, or distorted leaves. Other symptoms include stunted growth, sticky honeydew on foliage, which attracts ants, and the development of sooty mold. Aphids are often visible in clusters on the undersides of leaves or new shoots.",
                "treatment": "Introduce natural predators like ladybugs, lacewings, and parasitic wasps. Spray plants with a strong stream of water to dislodge aphids. Apply neem oil, insecticidal soaps, or horticultural oils for organic control. Remove heavily infested leaves or stems to prevent further spread, and regularly inspect plants for early signs of infestation.",
                "photo": "https://www.azamsharp.com/images/aphids.png"
            },
            {
                "name": "Pea Weevils",
                "description": "Pea weevils (Bruchus pisorum) are small beetles that infest pea plants. The adult beetles lay their eggs on the peas, and when the larvae hatch, they burrow into the seeds, causing significant damage. Pea weevils are common pests in storage and field-grown peas and can severely affect the quality and yield of the crop.",
                "symptoms": "Infested peas may show small holes on the seed surface or in the pods. The larvae feeding inside the peas cause them to rot or become deformed. Infested plants may show signs of reduced yield, and peas may be unusable for both consumption and planting.",
                "treatment": "To manage pea weevil infestations, practice crop rotation and avoid planting peas in the same location year after year. Use insecticidal treatments labeled for use on peas during the flowering or pod-setting stages. After harvest, remove and destroy any infested plants to reduce the number of overwintering pests. Store harvested peas in sealed containers to prevent contamination.",
                "photo": "https://www.azamsharp.com/images/pea_weevils.png"
            }
        ]
        
    },
    {
        "VegetableId": 103,
        "VegetableCode": "052",
        "CatalogId": 3,
        "Name": "Shallots",
        "Description": "Shallots (Allium cepa var. aggregatum) are a type of onion prized for their mild, sweet flavor with subtle hints of garlic. Known for their rich, aromatic taste, shallots are a staple in culinary traditions worldwide, enhancing the flavor of sauces, dressings, sautés, and roasts. They are often used as a base ingredient in cooking due to their ability to add depth and complexity to dishes. Shallots grow in clusters of small bulbs and thrive in well-drained soil and full sunlight. In addition to their culinary uses, they are a good source of antioxidants, vitamins A and C, and minerals, contributing to overall health and well-being.",
        "ThumbnailImage": "https://azamsharp.com/images/shallots.png",
        "SeedDepth": "1\" (25 mm)",
        "GerminationSoilTemp": "50-85 F (10-29 C)",
        "DaysToGermination": 10,
        "SowIndoors": "6-8 weeks before last frost",
        "SowOutdoors": "Early spring or late summer for fall harvest",
        "PhRange": "6.0-7.0",
        "GrowingSoilTemp": "55-75 F (13-24 C)",
        "SpacingBeds": "6-8\" (15-20 cm)",
        "Watering": "Moderate",
        "Light": "Full sun",
        "GoodCompanions": "Carrots, lettuce, beets",
        "BadCompanions": "Beans, peas",
        "SowingDescription": "Plant shallot bulbs (or seeds) in loose, well-drained soil enriched with compost. Position the bulbs root side down, with the top just below the soil surface.",
        "GrowingDescription": "Keep the soil evenly moist but not waterlogged. Fertilize lightly with a balanced fertilizer during growth. Mulch around plants to suppress weeds and retain moisture.",
        "HarvestDescription": "Harvest shallots when the tops start to yellow and fall over. Dig up the bulbs carefully, dry them in a warm, airy location for 1-2 weeks, and store in a cool, dry place.",
        "Active": null,
        "Season": "Spring, Fall",
        "DaysToHarvestSeeds": 90,
        "DaysToHarvestSeedlings": 60,
        "HealthBenefits": "Shallots are rich in antioxidants and compounds that support heart health, boost immunity, and reduce inflammation.",
        "Pests": [
            {
                "name": "Onion Maggots",
                "description": "Onion maggots (Delia antiqua) are the larvae of small gray flies that infest onions and other allium plants like garlic, shallots, and leeks. These larvae feed on the roots and bulbs of the plants, causing rot and decay. They thrive in cool, moist conditions and are particularly damaging in the early stages of growth.",
                "symptoms": "Infested plants may show yellowing and wilting of leaves, stunted growth, and rotting bulbs. Upon inspection, small tunnels or feeding damage caused by the larvae can be found inside the bulbs. In severe cases, the plants may die prematurely.",
                "treatment": "To control onion maggot infestations, use floating row covers to prevent flies from laying eggs near the plants. Practice crop rotation to avoid planting onions or related crops in the same location year after year. Remove and destroy infested plants immediately after harvest. Insecticides labeled for use on onions may be applied to control adult maggots and larvae.",
                "photo": "https://www.azamsharp.com/images/onion_maggots.png"
            },
            {
                "name": "Thrips",
                "description": "Thrips are tiny, slender insects that feed on plant tissues by piercing plant cells and sucking out the contents. They infest a wide variety of plants, including vegetables, fruits, and flowers. Thrips are not only harmful because of their feeding, but they can also transmit plant viruses.",
                "symptoms": "Plants affected by thrips may show silvery or stippled discoloration on leaves, distorted or deformed growth, and dark specks (fecal spots) on the leaves. In severe cases, flowers and fruits may become deformed or prematurely drop, and the plant may show signs of stunted growth.",
                "treatment": "To control thrips, introduce natural predators such as lacewings, minute pirate bugs, and predatory mites. Use yellow sticky traps to monitor and reduce thrips populations. Insecticidal soap, neem oil, or horticultural oils can be used for organic control. Regularly inspect plants and remove heavily infested leaves or flowers to prevent the spread of thrips.",
                "photo": "https://www.azamsharp.com/images/thrips.png"
            }
        ]
        
    }
]
